; ModuleID = 'coreutils-9.3/build/src/cat.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [335 x i8] c"\0A  -A, --show-all           equivalent to -vET\0A  -b, --number-nonblank    number nonempty output lines, overrides -n\0A  -e                       equivalent to -vE\0A  -E, --show-ends          display $ at end of each line\0A  -n, --number             number all output lines\0A  -s, --squeeze-blank      suppress repeated empty output lines\0A\00", align 1, !dbg !17

!220 = distinct !DIGlobalVariable(scope: null, file: !58, line: 662, type: !128, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !58, line: 662, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 15)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !58, line: 663, type: !128, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !58, line: 664, type: !128, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !58, line: 665, type: !128, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !58, line: 678, type: !196, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !58, line: 678, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 40)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !58, line: 683, type: !44, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !58, line: 689, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 71)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !58, line: 695, type: !140, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !58, line: 696, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 27)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !58, line: 698, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 51)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !58, line: 699, type: !191, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !2, line: 301, type: !216, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "newlines2", scope: !55, file: !2, line: 81, type: !52, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "line_num_end", scope: !55, file: !2, line: 78, type: !54, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "line_num_start", scope: !55, file: !2, line: 75, type: !54, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "line_buf", scope: !55, file: !2, line: 63, type: !167, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "line_num_print", scope: !55, file: !2, line: 72, type: !54, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "pending_cr", scope: !55, file: !2, line: 84, type: !274, isLocal: true, isDefinition: true)
!274 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!275 = !{!276, !277, !278, !279, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !354, !355, !356, !357, !358, !360, !361, !362, !365, !367, !368}
!276 = !DILocalVariable(name: "argc", arg: 1, scope: !49, file: !2, line: 539, type: !52)
!277 = !DILocalVariable(name: "argv", arg: 2, scope: !49, file: !2, line: 539, type: !53)
!278 = !DILocalVariable(name: "have_read_stdin", scope: !49, file: !2, line: 542, type: !274)
!279 = !DILocalVariable(name: "stat_buf", scope: !49, file: !2, line: 544, type: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !281, line: 182, size: 1152, elements: !282)
!281 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!282 = !{!283, !289, !295, !298, !302, !306, !310, !311, !318, !319, !320, !321, !327, !331, !335, !336, !337, !338}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !280, file: !281, line: 182, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !285, line: 31, baseType: !286)
!285 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !287, line: 57, baseType: !288)
!287 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !102, line: 46, baseType: !52)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !280, file: !281, line: 182, baseType: !290, size: 16, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !291, line: 31, baseType: !292)
!291 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !287, line: 70, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !102, line: 45, baseType: !294)
!294 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !280, file: !281, line: 182, baseType: !296, size: 16, offset: 48)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !297, line: 31, baseType: !293)
!297 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !280, file: !281, line: 182, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !287, line: 62, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !102, line: 49, baseType: !301)
!301 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !280, file: !281, line: 182, baseType: !303, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !304, line: 31, baseType: !305)
!304 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !287, line: 75, baseType: !104)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !280, file: !281, line: 182, baseType: !307, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !308, line: 31, baseType: !309)
!308 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !287, line: 60, baseType: !104)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !280, file: !281, line: 182, baseType: !284, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !280, file: !281, line: 182, baseType: !312, size: 128, offset: 256)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !313, line: 33, size: 128, elements: !314)
!313 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !312, file: !313, line: 35, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !102, line: 122, baseType: !98)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !312, file: !313, line: 36, baseType: !98, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !280, file: !281, line: 182, baseType: !312, size: 128, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !280, file: !281, line: 182, baseType: !312, size: 128, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !280, file: !281, line: 182, baseType: !312, size: 128, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !280, file: !281, line: 182, baseType: !322, size: 64, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !323, line: 31, baseType: !324)
!323 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !287, line: 71, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 48, baseType: !326)
!326 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !280, file: !281, line: 182, baseType: !328, size: 64, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !329, line: 31, baseType: !330)
!329 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !287, line: 55, baseType: !325)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !280, file: !281, line: 182, baseType: !332, size: 32, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !333, line: 31, baseType: !334)
!333 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !287, line: 56, baseType: !288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !280, file: !281, line: 182, baseType: !104, size: 32, offset: 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !280, file: !281, line: 182, baseType: !104, size: 32, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !280, file: !281, line: 182, baseType: !288, size: 32, offset: 992)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !280, file: !281, line: 182, baseType: !339, size: 128, offset: 1024)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 128, elements: !175)
!340 = !DILocalVariable(name: "number", scope: !49, file: !2, line: 547, type: !274)
!341 = !DILocalVariable(name: "number_nonblank", scope: !49, file: !2, line: 548, type: !274)
!342 = !DILocalVariable(name: "squeeze_blank", scope: !49, file: !2, line: 549, type: !274)
!343 = !DILocalVariable(name: "show_ends", scope: !49, file: !2, line: 550, type: !274)
!344 = !DILocalVariable(name: "show_nonprinting", scope: !49, file: !2, line: 551, type: !274)
!345 = !DILocalVariable(name: "show_tabs", scope: !49, file: !2, line: 552, type: !274)
!346 = !DILocalVariable(name: "file_open_mode", scope: !49, file: !2, line: 553, type: !52)
!347 = !DILocalVariable(name: "c", scope: !49, file: !2, line: 583, type: !52)
!348 = !DILocalVariable(name: "outsize", scope: !49, file: !2, line: 649, type: !94)
!349 = !DILocalVariable(name: "out_dev", scope: !49, file: !2, line: 652, type: !284)
!350 = !DILocalVariable(name: "out_ino", scope: !49, file: !2, line: 653, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !352, line: 31, baseType: !353)
!352 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_ino_t.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !287, line: 64, baseType: !299)
!354 = !DILocalVariable(name: "out_isreg", scope: !49, file: !2, line: 656, type: !274)
!355 = !DILocalVariable(name: "argind", scope: !49, file: !2, line: 667, type: !52)
!356 = !DILocalVariable(name: "ok", scope: !49, file: !2, line: 668, type: !274)
!357 = !DILocalVariable(name: "page_size", scope: !49, file: !2, line: 669, type: !94)
!358 = !DILocalVariable(name: "reading_stdin", scope: !359, file: !2, line: 676, type: !274)
!359 = distinct !DILexicalBlock(scope: !49, file: !2, line: 672, column: 5)
!360 = !DILocalVariable(name: "insize", scope: !359, file: !2, line: 703, type: !94)
!361 = !DILocalVariable(name: "inbuf", scope: !359, file: !2, line: 721, type: !54)
!362 = !DILocalVariable(name: "copy_cat_status", scope: !363, file: !2, line: 730, type: !52)
!363 = distinct !DILexicalBlock(scope: !364, file: !2, line: 729, column: 9)
!364 = distinct !DILexicalBlock(scope: !359, file: !2, line: 727, column: 11)
!365 = !DILocalVariable(name: "bufsize", scope: !366, file: !2, line: 770, type: !94)
!366 = distinct !DILexicalBlock(scope: !364, file: !2, line: 745, column: 9)
!367 = !DILocalVariable(name: "outbuf", scope: !366, file: !2, line: 775, type: !54)
!368 = !DILabel(scope: !359, name: "contin", file: !2, line: 786)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 2560, elements: !129)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !372, line: 50, size: 256, elements: !373)
!372 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!373 = !{!374, !375, !376, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !372, line: 52, baseType: !91, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !371, file: !372, line: 55, baseType: !52, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !372, line: 56, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !371, file: !372, line: 57, baseType: !52, size: 32, offset: 192)
!379 = !{!"Homebrew clang version 16.0.4"}
!380 = !{i32 7, !"Dwarf Version", i32 4}
!381 = !{i32 2, !"Debug Info Version", i32 3}
!382 = !{i32 1, !"wchar_size", i32 4}
!383 = !{i32 8, !"PIC Level", i32 2}
!384 = !{i32 7, !"uwtable", i32 2}
!385 = !{i32 7, !"frame-pointer", i32 2}
!386 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 87, type: !387, scopeLine: 88, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !52}
!389 = !{!390}
!390 = !DILocalVariable(name: "status", arg: 1, scope: !386, file: !2, line: 87, type: !52)
!391 = !DILocation(line: 0, scope: !386)
!392 = !DILocation(line: 89, column: 14, scope: !393)
!393 = distinct !DILexicalBlock(scope: !386, file: !2, line: 89, column: 7)
!394 = !DILocation(line: 89, column: 7, scope: !386)
!395 = !DILocation(line: 90, column: 5, scope: !393)
!396 = !DILocation(line: 90, column: 5, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !2, line: 90, column: 5)
!398 = !{!399, !399, i64 0}
!399 = !{!"any pointer", !400, i64 0}
!400 = !{!"omnipotent char", !401, i64 0}
!401 = !{!"Simple C/C++ TBAA"}
!402 = !DILocation(line: 96, column: 15, scope: !403)
!403 = distinct !DILexicalBlock(scope: !393, file: !2, line: 92, column: 5)
!404 = !DILocation(line: 93, column: 7, scope: !403)
!405 = !DILocation(line: 99, column: 5, scope: !403)
!406 = !DILocation(line: 97, column: 7, scope: !403)
!407 = !DILocation(line: 101, column: 7, scope: !403)
!408 = !DILocation(line: 111, column: 5, scope: !403)
!409 = !DILocation(line: 103, column: 7, scope: !403)
!410 = !DILocation(line: 117, column: 5, scope: !403)
!411 = !DILocation(line: 112, column: 7, scope: !403)
!412 = !DILocation(line: 118, column: 39, scope: !403)
!413 = !DILocation(line: 118, column: 7, scope: !403)
!414 = !DILocation(line: 119, column: 42, scope: !403)
!415 = !DILocation(line: 119, column: 7, scope: !403)
!416 = !DILocation(line: 126, column: 15, scope: !403)
!417 = !DILocation(line: 126, column: 29, scope: !403)
!418 = !DILocation(line: 120, column: 7, scope: !403)
!419 = !DILocation(line: 127, column: 7, scope: !403)
!420 = !DILocation(line: 129, column: 3, scope: !386)
!421 = !DISubprogram(name: "fprintf", scope: !422, file: !422, line: 155, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!422 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!423 = !DISubroutineType(types: !424)
!424 = !{!52, !425, !475, null}
!425 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !428, line: 157, baseType: !429)
!428 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !428, line: 126, size: 1216, elements: !430)
!430 = !{!431, !434, !435, !436, !438, !439, !444, !445, !446, !450, !454, !459, !463, !464, !467, !468, !470, !472, !473, !474}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !429, file: !428, line: 127, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !429, file: !428, line: 128, baseType: !52, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !429, file: !428, line: 129, baseType: !52, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !429, file: !428, line: 130, baseType: !437, size: 16, offset: 128)
!437 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !429, file: !428, line: 131, baseType: !437, size: 16, offset: 144)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !429, file: !428, line: 132, baseType: !440, size: 128, offset: 192)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !428, line: 92, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !440, file: !428, line: 93, baseType: !432, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !440, file: !428, line: 94, baseType: !52, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !429, file: !428, line: 133, baseType: !52, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !429, file: !428, line: 136, baseType: !93, size: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !429, file: !428, line: 137, baseType: !447, size: 64, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!52, !93}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !429, file: !428, line: 138, baseType: !451, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!52, !93, !54, !52}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !429, file: !428, line: 139, baseType: !455, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !93, !458, !52}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !428, line: 81, baseType: !324)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !429, file: !428, line: 140, baseType: !460, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!52, !93, !91, !52}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !429, file: !428, line: 143, baseType: !440, size: 128, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !429, file: !428, line: 144, baseType: !465, size: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !428, line: 98, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !429, file: !428, line: 145, baseType: !52, size: 32, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !429, file: !428, line: 148, baseType: !469, size: 24, offset: 928)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 24, elements: !180)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !429, file: !428, line: 149, baseType: !471, size: 8, offset: 952)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 8, elements: !151)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !429, file: !428, line: 152, baseType: !440, size: 128, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !429, file: !428, line: 155, baseType: !52, size: 32, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !429, file: !428, line: 156, baseType: !458, size: 64, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !91)
!476 = !{}
!477 = !DISubprogram(name: "printf", scope: !422, file: !422, line: 175, type: !478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!478 = !DISubroutineType(types: !479)
!479 = !{!52, !475, null}
!480 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !422, file: !422, line: 157, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!481 = !DISubroutineType(types: !482)
!482 = !{!52, !475, !425}
!483 = distinct !DISubprogram(name: "emit_stdin_note", scope: !58, file: !58, line: 577, type: !484, scopeLine: 578, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !476)
!484 = !DISubroutineType(types: !485)
!485 = !{null}
!486 = !DILocation(line: 581, column: 5, scope: !483)
!487 = !DILocation(line: 579, column: 3, scope: !483)
!488 = !DILocation(line: 582, column: 1, scope: !483)
!489 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !58, file: !58, line: 657, type: !490, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !91}
!492 = !{!493, !494, !501, !502, !504, !505}
!493 = !DILocalVariable(name: "program", arg: 1, scope: !489, file: !58, line: 657, type: !91)
!494 = !DILocalVariable(name: "infomap", scope: !489, file: !58, line: 659, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 896, elements: !114)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !489, file: !58, line: 659, size: 128, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !497, file: !58, line: 659, baseType: !91, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !497, file: !58, line: 659, baseType: !91, size: 64, offset: 64)
!501 = !DILocalVariable(name: "node", scope: !489, file: !58, line: 669, type: !91)
!502 = !DILocalVariable(name: "map_prog", scope: !489, file: !58, line: 670, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!504 = !DILocalVariable(name: "lc_messages", scope: !489, file: !58, line: 682, type: !91)
!505 = !DILocalVariable(name: "url_program", scope: !489, file: !58, line: 695, type: !91)
!506 = !DILocation(line: 0, scope: !489)
!507 = !DILocation(line: 659, column: 3, scope: !489)
!508 = !DILocation(line: 659, column: 67, scope: !489)
!509 = !DILocation(line: 670, column: 36, scope: !489)
!510 = !DILocation(line: 672, column: 3, scope: !489)
!511 = !DILocation(line: 672, column: 20, scope: !489)
!512 = !{!513, !399, i64 0}
!513 = !{!"infomap", !399, i64 0, !399, i64 8}
!514 = !DILocation(line: 672, column: 10, scope: !489)
!515 = !DILocation(line: 672, column: 28, scope: !489)
!516 = !DILocation(line: 672, column: 33, scope: !489)
!517 = !DILocation(line: 672, column: 31, scope: !489)
!518 = !DILocation(line: 673, column: 13, scope: !489)
!519 = distinct !{!519, !510, !518, !520, !521}
!520 = !{!"llvm.loop.mustprogress"}
!521 = !{!"llvm.loop.unroll.disable"}
!522 = !DILocation(line: 675, column: 17, scope: !523)
!523 = distinct !DILexicalBlock(scope: !489, file: !58, line: 675, column: 7)
!524 = !{!513, !399, i64 8}
!525 = !DILocation(line: 675, column: 7, scope: !523)
!526 = !DILocation(line: 675, column: 7, scope: !489)
!527 = !DILocation(line: 676, column: 22, scope: !523)
!528 = !DILocation(line: 676, column: 5, scope: !523)
!529 = !DILocation(line: 678, column: 3, scope: !489)
!530 = !DILocation(line: 682, column: 29, scope: !489)
!531 = !DILocation(line: 683, column: 7, scope: !532)
!532 = distinct !DILexicalBlock(scope: !489, file: !58, line: 683, column: 7)
!533 = !DILocation(line: 683, column: 19, scope: !532)
!534 = !DILocation(line: 683, column: 22, scope: !532)
!535 = !DILocation(line: 683, column: 7, scope: !489)
!536 = !DILocation(line: 690, column: 61, scope: !537)
!537 = distinct !DILexicalBlock(scope: !532, file: !58, line: 684, column: 5)
!538 = !DILocation(line: 689, column: 7, scope: !537)
!539 = !DILocation(line: 691, column: 5, scope: !537)
!540 = !DILocation(line: 695, column: 29, scope: !489)
!541 = !DILocation(line: 696, column: 3, scope: !489)
!542 = !DILocation(line: 699, column: 22, scope: !489)
!543 = !DILocation(line: 699, column: 17, scope: !489)
!544 = !DILocation(line: 698, column: 3, scope: !489)
!545 = !DILocation(line: 700, column: 1, scope: !489)
!546 = !DISubprogram(name: "exit", scope: !547, file: !547, line: 145, type: !387, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !476)
!547 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!548 = !DISubprogram(name: "strcmp", scope: !549, file: !549, line: 77, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!549 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!550 = !DISubroutineType(types: !551)
!551 = !{!52, !91, !91}
!552 = !DISubprogram(name: "setlocale", scope: !553, file: !553, line: 53, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!553 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!554 = !DISubroutineType(types: !555)
!555 = !{!54, !52, !91}
!556 = !DISubprogram(name: "strncmp", scope: !549, file: !549, line: 84, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !476)
!557 = !DISubroutineType(types: !558)
!558 = !{!52, !91, !91, !99}
!559 = !DILocation(line: 0, scope: !49)
!560 = !DILocation(line: 544, column: 3, scope: !49)
