; ModuleID = 'coreutils-9.3/build/src/echo.o.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.infomap = type { ptr, ptr }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, ptr, i32, i32, ptr }
%struct._RuneRange = type { i32, ptr }

@__func__.usage = private unnamed_addr constant [6 x i8] c"usage\00", align 1, !dbg !0
@.str = private unnamed_addr constant [7 x i8] c"echo.c\00", align 1, !dbg !8
@.str.1 = private unnamed_addr constant [23 x i8] c"status == EXIT_SUCCESS\00", align 1, !dbg !13
@.str.2 = private unnamed_addr constant [63 x i8] c"Usage: %s [SHORT-OPTION]... [STRING]...\0A  or:  %s LONG-OPTION\0A\00", align 1, !dbg !18
@program_name = external global ptr, align 8
@.str.3 = private unnamed_addr constant [93 x i8] c"Echo the STRING(s) to standard output.\0A\0A  -n             do not output the trailing newline\0A\00", align 1, !dbg !23
@__stdoutp = external global ptr, align 8
@.str.4 = private unnamed_addr constant [132 x i8] c"  -e             enable interpretation of backslash escapes\0A  -E             disable interpretation of backslash escapes (default)\0A\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !33

!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 216, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 27)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !106, line: 698, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 408, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 51)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !106, line: 699, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 12)
!166 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !167, retainedTypes: !172, globals: !176, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!167 = !{!168}
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 32, baseType: !169, size: 32, elements: !170)
!169 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!170 = !{!171}
!171 = !DIEnumerator(name: "DEFAULT_ECHO_TO_XPG", value: 0)
!172 = !{!173, !174, !175}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !{!0, !8, !13, !18, !23, !28, !33, !38, !43, !45, !50, !55, !60, !65, !70, !75, !80, !85, !87, !92, !97, !99, !104, !110, !112, !114, !119, !121, !126, !128, !130, !132, !134, !139, !144, !149, !151, !156, !161}
!177 = !{!"Homebrew clang version 16.0.4"}
!178 = !{i32 7, !"Dwarf Version", i32 4}
!179 = !{i32 2, !"Debug Info Version", i32 3}
!180 = !{i32 1, !"wchar_size", i32 4}
!181 = !{i32 8, !"PIC Level", i32 2}
!182 = !{i32 7, !"uwtable", i32 2}
!183 = !{i32 7, !"frame-pointer", i32 2}
!184 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !185, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !166, retainedNodes: !188)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187}
!187 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!188 = !{!189}
!189 = !DILocalVariable(name: "status", arg: 1, scope: !184, file: !2, line: 36, type: !187)
!190 = !DILocation(line: 0, scope: !184)
!191 = !DILocation(line: 40, column: 3, scope: !184)
!192 = !DILocation(line: 45, column: 5, scope: !184)
!193 = !{!194, !194, i64 0}
!194 = !{!"any pointer", !195, i64 0}
!195 = !{!"omnipotent char", !196, i64 0}
!196 = !{!"Simple C/C++ TBAA"}
!197 = !DILocation(line: 45, column: 19, scope: !184)
!198 = !DILocation(line: 42, column: 3, scope: !184)
!199 = !DILocation(line: 50, column: 5, scope: !184)
!200 = !DILocation(line: 46, column: 3, scope: !184)
!201 = !DILocation(line: 58, column: 10, scope: !184)
!202 = !DILocation(line: 51, column: 3, scope: !184)
!203 = !DILocation(line: 59, column: 35, scope: !184)
!204 = !DILocation(line: 59, column: 3, scope: !184)
!205 = !DILocation(line: 60, column: 38, scope: !184)
!206 = !DILocation(line: 60, column: 3, scope: !184)
!207 = !DILocation(line: 65, column: 5, scope: !184)
!208 = !DILocation(line: 61, column: 3, scope: !184)
!209 = !DILocation(line: 77, column: 5, scope: !184)
!210 = !DILocation(line: 66, column: 3, scope: !184)
!211 = !DILocation(line: 81, column: 5, scope: !184)
!212 = !DILocation(line: 78, column: 3, scope: !184)
!213 = !DILocation(line: 82, column: 3, scope: !184)
!214 = !DILocation(line: 86, column: 5, scope: !184)
!215 = !DILocation(line: 83, column: 3, scope: !184)
!216 = !DILocation(line: 87, column: 3, scope: !184)
!217 = !DILocation(line: 88, column: 3, scope: !184)
!218 = !DISubprogram(name: "__assert_rtn", scope: !219, file: !219, line: 82, type: !220, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !222)
!219 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/assert.h", directory: "")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !173, !173, !187, !173}
!222 = !{}
!223 = !DISubprogram(name: "printf", scope: !224, file: !224, line: 175, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !222)
!224 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!225 = !DISubroutineType(types: !226)
!226 = !{!187, !227, null}
!227 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !173)
!228 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !224, file: !224, line: 157, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !222)
!229 = !DISubroutineType(types: !230)
!230 = !{!187, !227, !231}
!231 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !234, line: 157, baseType: !235)
!234 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !234, line: 126, size: 1216, elements: !236)
!236 = !{!237, !240, !241, !242, !244, !245, !250, !251, !252, !256, !260, !270, !274, !275, !278, !279, !281, !283, !284, !285}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !235, file: !234, line: 127, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !235, file: !234, line: 128, baseType: !187, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !235, file: !234, line: 129, baseType: !187, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !235, file: !234, line: 130, baseType: !243, size: 16, offset: 128)
!243 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !235, file: !234, line: 131, baseType: !243, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !235, file: !234, line: 132, baseType: !246, size: 128, offset: 192)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !234, line: 92, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !246, file: !234, line: 93, baseType: !238, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !246, file: !234, line: 94, baseType: !187, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !235, file: !234, line: 133, baseType: !187, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !235, file: !234, line: 136, baseType: !175, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !235, file: !234, line: 137, baseType: !253, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!187, !175}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !235, file: !234, line: 138, baseType: !257, size: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!187, !175, !174, !187}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !235, file: !234, line: 139, baseType: !261, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !175, !264, !187}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !234, line: 81, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !266, line: 71, baseType: !267)
!266 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !268, line: 48, baseType: !269)
!268 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!269 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !235, file: !234, line: 140, baseType: !271, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!187, !175, !173, !187}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !235, file: !234, line: 143, baseType: !246, size: 128, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !235, file: !234, line: 144, baseType: !276, size: 64, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !234, line: 98, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !235, file: !234, line: 145, baseType: !187, size: 32, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !235, file: !234, line: 148, baseType: !280, size: 24, offset: 928)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 24, elements: !78)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !235, file: !234, line: 149, baseType: !282, size: 8, offset: 952)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 8, elements: !83)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !235, file: !234, line: 152, baseType: !246, size: 128, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !235, file: !234, line: 155, baseType: !187, size: 32, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !235, file: !234, line: 156, baseType: !264, size: 64, offset: 1152)
!286 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !106, file: !106, line: 657, type: !287, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !166, retainedNodes: !289)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !173}
!289 = !{!290, !291, !298, !299, !301, !302}
!290 = !DILocalVariable(name: "program", arg: 1, scope: !286, file: !106, line: 657, type: !173)
!291 = !DILocalVariable(name: "infomap", scope: !286, file: !106, line: 659, type: !292)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 896, elements: !11)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !286, file: !106, line: 659, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !294, file: !106, line: 659, baseType: !173, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !294, file: !106, line: 659, baseType: !173, size: 64, offset: 64)
!298 = !DILocalVariable(name: "node", scope: !286, file: !106, line: 669, type: !173)
!299 = !DILocalVariable(name: "map_prog", scope: !286, file: !106, line: 670, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!301 = !DILocalVariable(name: "lc_messages", scope: !286, file: !106, line: 682, type: !173)
!302 = !DILocalVariable(name: "url_program", scope: !286, file: !106, line: 695, type: !173)
!303 = !DILocation(line: 0, scope: !286)
!304 = !DILocation(line: 659, column: 3, scope: !286)
!305 = !DILocation(line: 659, column: 67, scope: !286)
!306 = !DILocation(line: 670, column: 36, scope: !286)
!307 = !DILocation(line: 672, column: 3, scope: !286)
!308 = !DILocation(line: 672, column: 20, scope: !286)
!309 = !{!310, !194, i64 0}
!310 = !{!"infomap", !194, i64 0, !194, i64 8}
!311 = !DILocation(line: 672, column: 10, scope: !286)
!312 = !DILocation(line: 672, column: 28, scope: !286)
!313 = !DILocation(line: 672, column: 33, scope: !286)
!314 = !DILocation(line: 672, column: 31, scope: !286)
!315 = !DILocation(line: 673, column: 13, scope: !286)
!316 = distinct !{!316, !307, !315, !317, !318}
!317 = !{!"llvm.loop.mustprogress"}
!318 = !{!"llvm.loop.unroll.disable"}
!319 = !DILocation(line: 675, column: 17, scope: !320)
!320 = distinct !DILexicalBlock(scope: !286, file: !106, line: 675, column: 7)
!321 = !{!310, !194, i64 8}
!322 = !DILocation(line: 675, column: 7, scope: !320)
!323 = !DILocation(line: 675, column: 7, scope: !286)
!324 = !DILocation(line: 676, column: 22, scope: !320)
!325 = !DILocation(line: 676, column: 5, scope: !320)
!326 = !DILocation(line: 678, column: 3, scope: !286)
!327 = !DILocation(line: 682, column: 29, scope: !286)
!328 = !DILocation(line: 683, column: 7, scope: !329)
!329 = distinct !DILexicalBlock(scope: !286, file: !106, line: 683, column: 7)
!330 = !DILocation(line: 683, column: 19, scope: !329)
!331 = !DILocation(line: 683, column: 22, scope: !329)
!332 = !DILocation(line: 683, column: 7, scope: !286)
!333 = !DILocation(line: 690, column: 61, scope: !334)
!334 = distinct !DILexicalBlock(scope: !329, file: !106, line: 684, column: 5)
!335 = !DILocation(line: 689, column: 7, scope: !334)
!336 = !DILocation(line: 691, column: 5, scope: !334)
!337 = !DILocation(line: 695, column: 29, scope: !286)
!338 = !DILocation(line: 696, column: 3, scope: !286)
!339 = !DILocation(line: 699, column: 22, scope: !286)
!340 = !DILocation(line: 699, column: 17, scope: !286)
!341 = !DILocation(line: 698, column: 3, scope: !286)
!342 = !DILocation(line: 700, column: 1, scope: !286)
!343 = !DISubprogram(name: "exit", scope: !344, file: !344, line: 145, type: !185, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !222)
!344 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!345 = !DISubprogram(name: "strcmp", scope: !346, file: !346, line: 77, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !222)
!346 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!347 = !DISubroutineType(types: !348)
!348 = !{!187, !173, !173}
!349 = !DISubprogram(name: "setlocale", scope: !350, file: !350, line: 53, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !222)
!350 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!351 = !DISubroutineType(types: !352)
!352 = !{!174, !187, !173}
!353 = !DISubprogram(name: "strncmp", scope: !346, file: !346, line: 84, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !222)
!354 = !DISubroutineType(types: !355)
!355 = !{!187, !173, !173, !356}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !357, line: 31, baseType: !358)
