; ModuleID = 'coreutils-9.3/build/src/kill.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [90 x i8] c"Usage: %s [-s SIGNAL | -SIGNAL] PID...\0A  or:  %s -l [SIGNAL]...\0A  or:  %s -t [SIGNAL]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [45 x i8] c"Send signals to processes, or list signals.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [236 x i8] c"  -s, --signal=SIGNAL, -SIGNAL\0A                   specify the name or number of the signal to be sent\0A  -l, --list       list signal names, or convert signal names to/from numbers\0A  -t, --table      print a table of signal information\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [57 x i8] c"      --version     output version information and exit\0A\00", align 1, !dbg !27

!117 = distinct !DIGlobalVariable(scope: null, file: !57, line: 661, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 10)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !57, line: 661, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 22)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !57, line: 662, type: !118, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !57, line: 662, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 15)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !57, line: 663, type: !118, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !57, line: 664, type: !118, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !57, line: 665, type: !118, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !57, line: 678, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 23)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !57, line: 678, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 40)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !57, line: 683, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 4)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !57, line: 689, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 71)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !57, line: 695, type: !44, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !57, line: 696, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 27)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !57, line: 698, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 51)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !57, line: 699, type: !91, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !44, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 7)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 6)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !44, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "long_options", scope: !54, file: !2, line: 60, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1536, elements: !183)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !197, line: 50, size: 256, elements: !198)
!197 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!198 = !{!199, !200, !201, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !197, line: 52, baseType: !63, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !196, file: !197, line: 55, baseType: !58, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !196, file: !197, line: 56, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !196, file: !197, line: 57, baseType: !58, size: 32, offset: 192)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !151, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 13)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !108, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 207, type: !141, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 3)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 904, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 113)
!223 = !{!"Homebrew clang version 16.0.4"}
!224 = !{i32 7, !"Dwarf Version", i32 4}
!225 = !{i32 2, !"Debug Info Version", i32 3}
!226 = !{i32 1, !"wchar_size", i32 4}
!227 = !{i32 8, !"PIC Level", i32 2}
!228 = !{i32 7, !"uwtable", i32 2}
!229 = !{i32 7, !"frame-pointer", i32 2}
!230 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 71, type: !231, scopeLine: 72, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !233)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !58}
!233 = !{!234}
!234 = !DILocalVariable(name: "status", arg: 1, scope: !230, file: !2, line: 71, type: !58)
!235 = !DILocation(line: 0, scope: !230)
!236 = !DILocation(line: 73, column: 14, scope: !237)
!237 = distinct !DILexicalBlock(scope: !230, file: !2, line: 73, column: 7)
!238 = !DILocation(line: 73, column: 7, scope: !230)
!239 = !DILocation(line: 74, column: 5, scope: !237)
!240 = !DILocation(line: 74, column: 5, scope: !241)
!241 = distinct !DILexicalBlock(scope: !237, file: !2, line: 74, column: 5)
!242 = !{!243, !243, i64 0}
!243 = !{!"any pointer", !244, i64 0}
!244 = !{!"omnipotent char", !245, i64 0}
!245 = !{!"Simple C/C++ TBAA"}
!246 = !DILocation(line: 82, column: 15, scope: !247)
!247 = distinct !DILexicalBlock(scope: !237, file: !2, line: 76, column: 5)
!248 = !DILocation(line: 82, column: 29, scope: !247)
!249 = !DILocation(line: 82, column: 43, scope: !247)
!250 = !DILocation(line: 77, column: 7, scope: !247)
!251 = !DILocation(line: 85, column: 5, scope: !247)
!252 = !DILocation(line: 83, column: 7, scope: !247)
!253 = !DILocation(line: 87, column: 7, scope: !247)
!254 = !DILocation(line: 94, column: 5, scope: !247)
!255 = !DILocation(line: 89, column: 7, scope: !247)
!256 = !DILocation(line: 95, column: 39, scope: !247)
!257 = !DILocation(line: 95, column: 7, scope: !247)
!258 = !DILocation(line: 96, column: 42, scope: !247)
!259 = !DILocation(line: 96, column: 7, scope: !247)
!260 = !DILocation(line: 101, column: 5, scope: !247)
!261 = !DILocation(line: 97, column: 7, scope: !247)
!262 = !DILocation(line: 102, column: 7, scope: !247)
!263 = !DILocation(line: 103, column: 7, scope: !247)
!264 = !DILocation(line: 105, column: 3, scope: !230)
!265 = !DISubprogram(name: "fprintf", scope: !266, file: !266, line: 155, type: !267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!266 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!267 = !DISubroutineType(types: !268)
!268 = !{!58, !269, !324, null}
!269 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !272, line: 157, baseType: !273)
!272 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !272, line: 126, size: 1216, elements: !274)
!274 = !{!275, !278, !279, !280, !282, !283, !288, !289, !290, !294, !298, !308, !312, !313, !316, !317, !319, !321, !322, !323}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !273, file: !272, line: 127, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !273, file: !272, line: 128, baseType: !58, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !273, file: !272, line: 129, baseType: !58, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !273, file: !272, line: 130, baseType: !281, size: 16, offset: 128)
!281 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !273, file: !272, line: 131, baseType: !281, size: 16, offset: 144)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !273, file: !272, line: 132, baseType: !284, size: 128, offset: 192)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !272, line: 92, size: 128, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !284, file: !272, line: 93, baseType: !276, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !284, file: !272, line: 94, baseType: !58, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !273, file: !272, line: 133, baseType: !58, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !273, file: !272, line: 136, baseType: !66, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !273, file: !272, line: 137, baseType: !291, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!58, !66}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !273, file: !272, line: 138, baseType: !295, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!58, !66, !65, !58}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !273, file: !272, line: 139, baseType: !299, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !66, !302, !58}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !272, line: 81, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !304, line: 71, baseType: !305)
!304 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !306, line: 48, baseType: !307)
!306 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!307 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !273, file: !272, line: 140, baseType: !309, size: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!58, !66, !63, !58}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !273, file: !272, line: 143, baseType: !284, size: 128, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !273, file: !272, line: 144, baseType: !314, size: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !272, line: 98, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !273, file: !272, line: 145, baseType: !58, size: 32, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !273, file: !272, line: 148, baseType: !318, size: 24, offset: 928)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 24, elements: !218)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !273, file: !272, line: 149, baseType: !320, size: 8, offset: 952)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 8, elements: !50)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !273, file: !272, line: 152, baseType: !284, size: 128, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !273, file: !272, line: 155, baseType: !58, size: 32, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !273, file: !272, line: 156, baseType: !302, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!325 = !{}
!326 = !DISubprogram(name: "printf", scope: !266, file: !266, line: 175, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!327 = !DISubroutineType(types: !328)
!328 = !{!58, !324, null}
!329 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !266, file: !266, line: 157, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!330 = !DISubroutineType(types: !331)
!331 = !{!58, !324, !269}
!332 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !57, file: !57, line: 584, type: !333, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !325)
!333 = !DISubroutineType(types: !334)
!334 = !{null}
!335 = !DILocation(line: 588, column: 5, scope: !332)
!336 = !DILocation(line: 586, column: 3, scope: !332)
!337 = !DILocation(line: 589, column: 1, scope: !332)
!338 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !57, file: !57, line: 657, type: !339, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !63}
!341 = !{!342, !343, !350, !351, !353, !354}
!342 = !DILocalVariable(name: "program", arg: 1, scope: !338, file: !57, line: 657, type: !63)
!343 = !DILocalVariable(name: "infomap", scope: !338, file: !57, line: 659, type: !344)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 896, elements: !178)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !338, file: !57, line: 659, size: 128, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !346, file: !57, line: 659, baseType: !63, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !346, file: !57, line: 659, baseType: !63, size: 64, offset: 64)
!350 = !DILocalVariable(name: "node", scope: !338, file: !57, line: 669, type: !63)
!351 = !DILocalVariable(name: "map_prog", scope: !338, file: !57, line: 670, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!353 = !DILocalVariable(name: "lc_messages", scope: !338, file: !57, line: 682, type: !63)
!354 = !DILocalVariable(name: "url_program", scope: !338, file: !57, line: 695, type: !63)
!355 = !DILocation(line: 0, scope: !338)
!356 = !DILocation(line: 659, column: 3, scope: !338)
!357 = !DILocation(line: 659, column: 67, scope: !338)
!358 = !DILocation(line: 670, column: 36, scope: !338)
!359 = !DILocation(line: 672, column: 3, scope: !338)
!360 = !DILocation(line: 672, column: 20, scope: !338)
!361 = !{!362, !243, i64 0}
!362 = !{!"infomap", !243, i64 0, !243, i64 8}
!363 = !DILocation(line: 672, column: 10, scope: !338)
!364 = !DILocation(line: 672, column: 28, scope: !338)
!365 = !DILocation(line: 672, column: 33, scope: !338)
!366 = !DILocation(line: 672, column: 31, scope: !338)
!367 = !DILocation(line: 673, column: 13, scope: !338)
!368 = distinct !{!368, !359, !367, !369, !370}
!369 = !{!"llvm.loop.mustprogress"}
!370 = !{!"llvm.loop.unroll.disable"}
!371 = !DILocation(line: 675, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !338, file: !57, line: 675, column: 7)
!373 = !{!362, !243, i64 8}
!374 = !DILocation(line: 675, column: 7, scope: !372)
!375 = !DILocation(line: 675, column: 7, scope: !338)
!376 = !DILocation(line: 676, column: 22, scope: !372)
!377 = !DILocation(line: 676, column: 5, scope: !372)
!378 = !DILocation(line: 678, column: 3, scope: !338)
!379 = !DILocation(line: 682, column: 29, scope: !338)
!380 = !DILocation(line: 683, column: 7, scope: !381)
!381 = distinct !DILexicalBlock(scope: !338, file: !57, line: 683, column: 7)
!382 = !DILocation(line: 683, column: 19, scope: !381)
!383 = !DILocation(line: 683, column: 22, scope: !381)
!384 = !DILocation(line: 683, column: 7, scope: !338)
!385 = !DILocation(line: 690, column: 61, scope: !386)
!386 = distinct !DILexicalBlock(scope: !381, file: !57, line: 684, column: 5)
!387 = !DILocation(line: 689, column: 7, scope: !386)
!388 = !DILocation(line: 691, column: 5, scope: !386)
!389 = !DILocation(line: 695, column: 29, scope: !338)
!390 = !DILocation(line: 696, column: 3, scope: !338)
!391 = !DILocation(line: 699, column: 22, scope: !338)
!392 = !DILocation(line: 699, column: 17, scope: !338)
!393 = !DILocation(line: 698, column: 3, scope: !338)
!394 = !DILocation(line: 700, column: 1, scope: !338)
!395 = !DISubprogram(name: "exit", scope: !396, file: !396, line: 145, type: !231, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !325)
!396 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!397 = !DISubprogram(name: "strcmp", scope: !398, file: !398, line: 77, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!398 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!399 = !DISubroutineType(types: !400)
!400 = !{!58, !63, !63}
!401 = !DISubprogram(name: "setlocale", scope: !402, file: !402, line: 53, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!402 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!403 = !DISubroutineType(types: !404)
!404 = !{!65, !58, !63}
!405 = !DISubprogram(name: "strncmp", scope: !398, file: !398, line: 84, type: !406, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !325)
!406 = !DISubroutineType(types: !407)
!407 = !{!58, !63, !63, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !409, line: 31, baseType: !410)
