; ModuleID = 'coreutils-9.3/build/src/ls.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.timespec = type { i64, i64 }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.bin_str = type { i64, ptr }
%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, ptr, i32, i32, ptr }
%struct._RuneRange = type { i32, ptr }
%struct.ignore_pattern = type { ptr, ptr }
%struct.dev_ino = type { i64, i32 }
%struct.pending = type { ptr, ptr, i8, ptr }
%struct.winsize = type { i16, i16, i16, i16 }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, i8, ptr }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.fileinfo = type { ptr, ptr, ptr, %struct.stat, i32, i16, ptr, i8, i8, i32, i8, i32, i64 }
%struct.dirent = type { i64, i64, i16, i16, i8, [1024 x i8] }
%struct.sigaction = type { %union.anon.0, i32, i32 }
%union.__mbstate_t = type { i64, [120 x i8] }
%struct.column_info = type { i8, i64, ptr }

!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "indicator_style", file: !2, line: 544, baseType: !12, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "none", value: 0)
!59 = !DIEnumerator(name: "slash", value: 1)
!60 = !DIEnumerator(name: "file_type", value: 2)
!61 = !DIEnumerator(name: "classify", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 315, baseType: !12, size: 32, elements: !63)
!63 = !{!64}
!64 = !DIEnumerator(name: "INITIAL_TABLE_SIZE", value: 30)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !2, line: 479, baseType: !12, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIEnumerator(name: "sort_name", value: 0)
!68 = !DIEnumerator(name: "sort_extension", value: 1)
!69 = !DIEnumerator(name: "sort_width", value: 2)
!70 = !DIEnumerator(name: "sort_size", value: 3)
!71 = !DIEnumerator(name: "sort_version", value: 4)
!72 = !DIEnumerator(name: "sort_time", value: 5)
!73 = !DIEnumerator(name: "sort_none", value: 6)
!74 = !DIEnumerator(name: "sort_numtypes", value: 7)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !2, line: 162, baseType: !12, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!77 = !DIEnumerator(name: "unknown", value: 0)
!78 = !DIEnumerator(name: "fifo", value: 1)
!79 = !DIEnumerator(name: "chardev", value: 2)
!80 = !DIEnumerator(name: "directory", value: 3)
!81 = !DIEnumerator(name: "blockdev", value: 4)
!82 = !DIEnumerator(name: "normal", value: 5)
!83 = !DIEnumerator(name: "symbolic_link", value: 6)
!84 = !DIEnumerator(name: "sock", value: 7)
!85 = !DIEnumerator(name: "whiteout", value: 8)
!86 = !DIEnumerator(name: "arg_directory", value: 9)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 114, baseType: !12, size: 32, elements: !89)
!88 = !DIFile(filename: "../src/system.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!89 = !{!90}
!90 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !92, line: 32, baseType: !12, size: 32, elements: !93)
!92 = !DIFile(filename: "../lib/quotearg.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!94 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!95 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!96 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!97 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!98 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!99 = !DIEnumerator(name: "c_quoting_style", value: 5)
!100 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!101 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!102 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!103 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!104 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !2, line: 190, baseType: !12, size: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "ACL_T_NONE", value: 0)
!108 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1)
!109 = !DIEnumerator(name: "ACL_T_YES", value: 2)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !111, file: !2, line: 1579, baseType: !12, size: 32, elements: !174)
!111 = distinct !DISubprogram(name: "signal_setup", scope: !2, file: !2, line: 1553, type: !112, scopeLine: 1554, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !115)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114}
!114 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!115 = !{!116, !117, !119}
!116 = !DILocalVariable(name: "init", arg: 1, scope: !111, file: !2, line: 1553, type: !114)
!117 = !DILocalVariable(name: "j", scope: !111, file: !2, line: 1585, type: !118)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DILocalVariable(name: "act", scope: !120, file: !2, line: 1590, type: !122)
!120 = distinct !DILexicalBlock(scope: !121, file: !2, line: 1588, column: 5)
!121 = distinct !DILexicalBlock(scope: !111, file: !2, line: 1587, column: 7)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !123, line: 286, size: 128, elements: !124)
!123 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/signal.h", directory: "")
!124 = !{!125, !169, !173}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_u", scope: !122, file: !123, line: 287, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sigaction_u", file: !123, line: 269, size: 64, elements: !127)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_handler", scope: !126, file: !123, line: 270, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !118}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__sa_sigaction", scope: !126, file: !123, line: 271, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !118, !136, !156}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__siginfo", file: !123, line: 177, size: 832, elements: !138)
!138 = !{!139, !140, !141, !142, !149, !154, !155, !157, !162, !164}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !137, file: !123, line: 178, baseType: !118, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !137, file: !123, line: 179, baseType: !118, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !137, file: !123, line: 180, baseType: !118, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !137, file: !123, line: 181, baseType: !143, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !144, line: 31, baseType: !145)
!144 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_pid_t.h", directory: "")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !146, line: 72, baseType: !147)
!146 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !148, line: 46, baseType: !118)
!148 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!149 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !137, file: !123, line: 182, baseType: !150, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !151, line: 31, baseType: !152)
!151 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !146, line: 75, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !148, line: 47, baseType: !12)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !137, file: !123, line: 183, baseType: !118, size: 32, offset: 160)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !137, file: !123, line: 184, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_value", scope: !137, file: !123, line: 185, baseType: !158, size: 64, offset: 256)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !123, line: 158, size: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !158, file: !123, line: 160, baseType: !118, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !158, file: !123, line: 161, baseType: !156, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !137, file: !123, line: 186, baseType: !163, size: 64, offset: 320)
!163 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !137, file: !123, line: 187, baseType: !165, size: 448, offset: 384)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 448, elements: !167)
!166 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!167 = !{!168}
!168 = !DISubrange(count: 7)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !122, file: !123, line: 288, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !171, line: 31, baseType: !172)
!171 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_sigset_t.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_sigset_t", file: !146, line: 73, baseType: !153)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !122, file: !123, line: 289, baseType: !118, size: 32, offset: 96)
!174 = !{!175}
!175 = !DIEnumerator(name: "nsigs", value: 11)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 683, baseType: !12, size: 32, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0)
!179 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1)
!180 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !2, line: 464, baseType: !12, size: 32, elements: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIEnumerator(name: "time_mtime", value: 0)
!184 = !DIEnumerator(name: "time_ctime", value: 1)
!185 = !DIEnumerator(name: "time_atime", value: 2)
!186 = !DIEnumerator(name: "time_btime", value: 3)
!187 = !DIEnumerator(name: "time_numtypes", value: 4)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 829, baseType: !12, size: 32, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!190 = !DIEnumerator(name: "AUTHOR_OPTION", value: 128)
!191 = !DIEnumerator(name: "BLOCK_SIZE_OPTION", value: 129)
!192 = !DIEnumerator(name: "COLOR_OPTION", value: 130)
!193 = !DIEnumerator(name: "DEREFERENCE_COMMAND_LINE_SYMLINK_TO_DIR_OPTION", value: 131)
!194 = !DIEnumerator(name: "FILE_TYPE_INDICATOR_OPTION", value: 132)
!195 = !DIEnumerator(name: "FORMAT_OPTION", value: 133)
!196 = !DIEnumerator(name: "FULL_TIME_OPTION", value: 134)
!197 = !DIEnumerator(name: "GROUP_DIRECTORIES_FIRST_OPTION", value: 135)
!198 = !DIEnumerator(name: "HIDE_OPTION", value: 136)
!199 = !DIEnumerator(name: "HYPERLINK_OPTION", value: 137)
!200 = !DIEnumerator(name: "INDICATOR_STYLE_OPTION", value: 138)
!201 = !DIEnumerator(name: "QUOTING_STYLE_OPTION", value: 139)
!202 = !DIEnumerator(name: "SHOW_CONTROL_CHARS_OPTION", value: 140)
!203 = !DIEnumerator(name: "SI_OPTION", value: 141)
!204 = !DIEnumerator(name: "SORT_OPTION", value: 142)
!205 = !DIEnumerator(name: "TIME_OPTION", value: 143)
!206 = !DIEnumerator(name: "TIME_STYLE_OPTION", value: 144)
!207 = !DIEnumerator(name: "ZERO_OPTION", value: 145)
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !209, line: 42, baseType: !12, size: 32, elements: !210)
!209 = !DIFile(filename: "../lib/human.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!211 = !DIEnumerator(name: "human_ceiling", value: 0)
!212 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!213 = !DIEnumerator(name: "human_floor", value: 2)
!214 = !DIEnumerator(name: "human_group_digits", value: 4)
!215 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!216 = !DIEnumerator(name: "human_autoscale", value: 16)
!217 = !DIEnumerator(name: "human_base_1024", value: 32)
!218 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!219 = !DIEnumerator(name: "human_SI", value: 128)
!220 = !DIEnumerator(name: "human_B", value: 256)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !2, line: 579, baseType: !12, size: 32, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIEnumerator(name: "when_never", value: 0)
!224 = !DIEnumerator(name: "when_always", value: 1)
!225 = !DIEnumerator(name: "when_if_tty", value: 2)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !227, line: 26, baseType: !12, size: 32, elements: !228)
!227 = !DIFile(filename: "../lib/xstrtol.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!228 = !{!229, !230, !231, !232, !233}
!229 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!230 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!231 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!232 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!233 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 332, baseType: !118, size: 32, elements: !235)
!235 = !{!236, !237}
!236 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!237 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 972, baseType: !12, size: 32, elements: !239)
!239 = !{!240}
!240 = !DIEnumerator(name: "MIN_COLUMN_WIDTH", value: 3)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !2, line: 441, baseType: !12, size: 32, elements: !242)
!242 = !{!243, !244, !245, !246}
!243 = !DIEnumerator(name: "full_iso_time_style", value: 0)
!244 = !DIEnumerator(name: "long_iso_time_style", value: 1)
!245 = !DIEnumerator(name: "iso_time_style", value: 2)
!246 = !DIEnumerator(name: "locale_time_style", value: 3)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1304, baseType: !12, size: 32, elements: !248)
!248 = !{!249}
!249 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1301, baseType: !12, size: 32, elements: !251)
!251 = !{!252}
!252 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 12)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !254, line: 20, baseType: !12, size: 32, elements: !255)
!254 = !DIFile(filename: "../lib/mbsalign.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!255 = !{!256, !257, !258}
!256 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0)
!257 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1)
!258 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !2, line: 2694, baseType: !12, size: 32, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266}
!261 = !DIEnumerator(name: "PS_START", value: 1)
!262 = !DIEnumerator(name: "PS_2", value: 2)
!263 = !DIEnumerator(name: "PS_3", value: 3)
!264 = !DIEnumerator(name: "PS_4", value: 4)
!265 = !DIEnumerator(name: "PS_DONE", value: 5)
!266 = !DIEnumerator(name: "PS_FAIL", value: 6)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !268, file: !2, line: 2505, baseType: !12, size: 32, elements: !290)
!268 = distinct !DISubprogram(name: "get_funky_string", scope: !2, file: !2, line: 2500, type: !269, scopeLine: 2502, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !280)
!269 = !DISubroutineType(types: !270)
!270 = !{!114, !271, !273, !114, !276}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !278, line: 31, baseType: !279)
!278 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !148, line: 94, baseType: !166)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289}
!281 = !DILocalVariable(name: "dest", arg: 1, scope: !268, file: !2, line: 2500, type: !271)
!282 = !DILocalVariable(name: "src", arg: 2, scope: !268, file: !2, line: 2500, type: !273)
!283 = !DILocalVariable(name: "equals_end", arg: 3, scope: !268, file: !2, line: 2500, type: !114)
!284 = !DILocalVariable(name: "output_count", arg: 4, scope: !268, file: !2, line: 2501, type: !276)
!285 = !DILocalVariable(name: "num", scope: !268, file: !2, line: 2503, type: !4)
!286 = !DILocalVariable(name: "count", scope: !268, file: !2, line: 2504, type: !277)
!287 = !DILocalVariable(name: "state", scope: !268, file: !2, line: 2507, type: !267)
!288 = !DILocalVariable(name: "p", scope: !268, file: !2, line: 2508, type: !274)
!289 = !DILocalVariable(name: "q", scope: !268, file: !2, line: 2509, type: !272)
!290 = !{!291, !292, !293, !294, !295, !296, !297}
!291 = !DIEnumerator(name: "ST_GND", value: 0)
!292 = !DIEnumerator(name: "ST_BACKSLASH", value: 1)
!293 = !DIEnumerator(name: "ST_OCTAL", value: 2)
!294 = !DIEnumerator(name: "ST_HEX", value: 3)
!295 = !DIEnumerator(name: "ST_CARET", value: 4)
!296 = !DIEnumerator(name: "ST_END", value: 5)
!297 = !DIEnumerator(name: "ST_ERROR", value: 6)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !299, line: 28, baseType: !12, size: 32, elements: !300)
!299 = !DIFile(filename: "../lib/canonicalize.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!300 = !{!301, !302, !303, !304}
!301 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!302 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!303 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!304 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 762, baseType: !12, size: 32, elements: !306)
!306 = !{!307}
!307 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000)
!308 = !{!309, !156, !274, !312, !277, !129, !272, !314, !153, !316, !318, !320, !325}
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !310, line: 31, baseType: !311)
!310 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_time_t.h", directory: "")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !148, line: 122, baseType: !163)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !313, line: 32, baseType: !166)
!313 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !317, line: 30, baseType: !118)
!317 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !319, line: 30, baseType: !12)
!319 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !321, line: 31, baseType: !322)
!321 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !146, line: 71, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !148, line: 48, baseType: !324)
!324 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!326 = !{!0, !327, !332, !337, !342, !345, !350, !352, !357, !362, !367, !372, !377, !382, !387, !392, !397, !402, !407, !412, !417, !422, !427, !432, !437, !442, !447, !452, !457, !462, !467, !472, !477, !482, !484, !489, !494, !499, !504, !509, !514, !519, !524, !529, !534, !539, !544, !549, !554, !559, !564, !569, !574, !579, !584, !586, !591, !596, !598, !603, !605, !611, !678, !680, !682, !684, !686, !695, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !727, !729, !731, !737, !739, !741, !746, !7, !748, !799, !801, !803, !805, !807, !812, !814, !819, !824, !826, !828, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848, !850, !852, !861, !867, !869, !871, !876, !879, !884, !886, !888, !891, !896, !898, !900, !905, !907, !912, !915, !920, !925, !930, !935, !937, !939, !941, !943, !948, !950, !955, !957, !962, !1050, !1052, !1054, !1059, !1061, !1066, !1068, !1073, !1076, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1130, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1193, !1195, !1197, !1199, !1201, !1203, !1205, !1207, !1209, !1211, !1213, !1215, !1217, !1221, !1223, !1225, !1227, !1229, !1231, !1233, !1235, !1237, !1239, !1242, !1249, !1251, !1253, !1257, !1259, !1262, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1290, !1292, !1294, !1296, !1298, !1300, !1302, !1304, !1307, !1311, !1313, !1316, !1318, !1320, !1322, !1324, !1326, !1331, !1333, !1335, !1337, !1339, !1342, !1344, !1346, !1348, !1352, !1354, !1356, !1361, !1363, !1365, !1367, !1369, !1371, !1376, !1378, !1380, !1382, !1388, !1390, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1417, !1419, !1421, !1423, !1425, !1427, !1429, !1431, !1433, !1435, !1437, !1439, !1441, !1443, !1445, !1448, !1519, !1521, !1523, !1525, !1527, !1529, !1534, !1536, !1538, !1540, !1542, !1544, !1546, !1548, !1550, !1553, !1555, !1557, !1559, !1561, !1563, !1565, !1567, !1569, !1571, !1573, !1575, !1577, !1579, !1584, !1586, !1588, !1590, !1599, !1609, !1618, !1620, !1622, !1625, !1630, !1632, !1639, !1649, !1651, !1653, !1655, !1658, !1660, !1681, !1701, !1709, !1711, !1713, !1715, !1717, !1719, !1750, !1752, !1757, !1759, !1761, !1763, !1765, !1767, !1769, !1771, !1773, !1775, !1780, !1782, !1784, !1786, !1788, !1793, !1795}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1721, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 3)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1761, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 2)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1808, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 40, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 5)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1808, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !340)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1808, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 6)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !329, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1852, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 10)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1853, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 13)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1854, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 38)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1860, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 41)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5457, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 39)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5460, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 33)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5461, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1152, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 144)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5468, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2168, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 271)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5474, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1240, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 155)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5479, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 72)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5482, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2240, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 280)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5489, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2200, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 275)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5495, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1664, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 208)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5500, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1184, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 148)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5505, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 60)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5508, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 61)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5511, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1936, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 242)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5518, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 73)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5521, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1200, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 150)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5525, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 896, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 112)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5529, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1392, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 174)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5535, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1088, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 136)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5541, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 56)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5544, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1872, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 234)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5551, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1168, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 146)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5556, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1232, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 154)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5562, type: !464, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5565, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1776, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 222)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5571, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 80)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5575, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2424, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 303)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5582, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 71)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5585, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1248, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 156)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5591, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 67)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5594, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2304, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 288)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5601, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1576, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 197)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5606, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 63)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5609, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1272, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 159)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5615, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4056, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 507)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5625, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 856, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 107)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5629, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1128, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 141)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5633, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1760, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 220)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5639, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 75)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5642, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 76)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5645, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3264, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 408)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5653, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 48)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5654, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 57)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5656, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3008, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 376)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5664, type: !561, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5668, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2312, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 289)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5675, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1216, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 152)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5682, type: !329, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5682, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 4)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5682, type: !344, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !9, file: !2, line: 324, type: !607, isLocal: true, isDefinition: true)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !609, line: 49, baseType: !610)
!609 = !DIFile(filename: "../lib/hash.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !609, line: 47, flags: DIFlagFwdDecl)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "cwd_file", scope: !9, file: !2, line: 335, type: !613, isLocal: true, isDefinition: true)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !2, line: 197, size: 1664, elements: !615)
!615 = !{!616, !617, !618, !619, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !614, file: !2, line: 200, baseType: !272, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !614, file: !2, line: 203, baseType: !272, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !614, file: !2, line: 206, baseType: !272, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !614, file: !2, line: 208, baseType: !620, size: 1152, offset: 192)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !621, line: 182, size: 1152, elements: !622)
!621 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!622 = !{!623, !627, !633, !636, !640, !641, !645, !646, !652, !653, !654, !655, !656, !660, !664, !665, !666, !667}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !620, file: !621, line: 182, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !625, line: 31, baseType: !626)
!625 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !146, line: 57, baseType: !147)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !620, file: !621, line: 182, baseType: !628, size: 16, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !629, line: 31, baseType: !630)
!629 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !146, line: 70, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !148, line: 45, baseType: !632)
!632 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !620, file: !621, line: 182, baseType: !634, size: 16, offset: 48)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !635, line: 31, baseType: !631)
!635 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !620, file: !621, line: 182, baseType: !637, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !146, line: 62, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !148, line: 49, baseType: !639)
!639 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !620, file: !621, line: 182, baseType: !150, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !620, file: !621, line: 182, baseType: !642, size: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !643, line: 31, baseType: !644)
!643 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !146, line: 60, baseType: !153)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !620, file: !621, line: 182, baseType: !624, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !620, file: !621, line: 182, baseType: !647, size: 128, offset: 256)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !648, line: 33, size: 128, elements: !649)
!648 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !647, file: !648, line: 35, baseType: !311, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !647, file: !648, line: 36, baseType: !163, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !620, file: !621, line: 182, baseType: !647, size: 128, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !620, file: !621, line: 182, baseType: !647, size: 128, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !620, file: !621, line: 182, baseType: !647, size: 128, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !620, file: !621, line: 182, baseType: !320, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !620, file: !621, line: 182, baseType: !657, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !658, line: 31, baseType: !659)
!658 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !146, line: 55, baseType: !323)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !620, file: !621, line: 182, baseType: !661, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !662, line: 31, baseType: !663)
!662 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !146, line: 56, baseType: !147)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !620, file: !621, line: 182, baseType: !153, size: 32, offset: 928)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !620, file: !621, line: 182, baseType: !153, size: 32, offset: 960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !620, file: !621, line: 182, baseType: !147, size: 32, offset: 992)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !620, file: !621, line: 182, baseType: !668, size: 128, offset: 1024)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, elements: !335)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !614, file: !2, line: 210, baseType: !75, size: 32, offset: 1344)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !614, file: !2, line: 214, baseType: !628, size: 16, offset: 1376)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !614, file: !2, line: 217, baseType: !272, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !614, file: !2, line: 219, baseType: !114, size: 8, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !614, file: !2, line: 223, baseType: !114, size: 8, offset: 1480)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !614, file: !2, line: 227, baseType: !105, size: 32, offset: 1504)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !614, file: !2, line: 230, baseType: !114, size: 8, offset: 1536)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !614, file: !2, line: 233, baseType: !118, size: 32, offset: 1568)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !614, file: !2, line: 236, baseType: !277, size: 64, offset: 1600)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !9, file: !2, line: 338, type: !277, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !9, file: !2, line: 341, type: !277, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !9, file: !2, line: 360, type: !114, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "hostname", scope: !9, file: !2, line: 362, type: !274, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !9, file: !2, line: 386, type: !688, isLocal: true, isDefinition: true)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !2, line: 375, size: 256, elements: !690)
!690 = !{!691, !692, !693, !694}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !2, line: 377, baseType: !272, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !689, file: !2, line: 381, baseType: !272, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !689, file: !2, line: 382, baseType: !114, size: 8, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !2, line: 383, baseType: !688, size: 64, offset: 192)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "current_time", scope: !9, file: !2, line: 391, type: !647, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "print_scontext", scope: !9, file: !2, line: 393, type: !114, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "format", scope: !9, file: !2, line: 436, type: !42, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "sort_type", scope: !9, file: !2, line: 491, type: !65, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "print_block_size", scope: !9, file: !2, line: 520, type: !114, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "dired", scope: !9, file: !2, line: 535, type: !114, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "indicator_style", scope: !9, file: !2, line: 552, type: !56, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "print_with_color", scope: !9, file: !2, line: 569, type: !114, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !9, file: !2, line: 571, type: !114, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !9, file: !2, line: 656, type: !114, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "dereference", scope: !9, file: !2, line: 665, type: !49, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "recursive", scope: !9, file: !2, line: 670, type: !114, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !9, file: !2, line: 675, type: !114, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "directories_first", scope: !9, file: !2, line: 679, type: !114, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !9, file: !2, line: 726, type: !725, isLocal: true, isDefinition: true)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !92, line: 270, flags: DIFlagFwdDecl)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "tabsize", scope: !9, file: !2, line: 731, type: !277, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !9, file: !2, line: 735, type: !114, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "localtz", scope: !9, file: !2, line: 744, type: !733, isLocal: true, isDefinition: true)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !734, line: 896, baseType: !735)
!734 = !DIFile(filename: "./lib/time.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !734, line: 896, flags: DIFlagFwdDecl)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !9, file: !2, line: 749, type: !114, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !9, file: !2, line: 754, type: !114, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !9, file: !2, line: 803, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !745, line: 41, baseType: !118)
!745 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/signal.h", directory: "")
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !9, file: !2, line: 807, type: !743, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !9, file: !2, line: 1011, type: !750, isLocal: true, isDefinition: true)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !751, line: 173, size: 704, elements: !752)
!751 = !DIFile(filename: "../lib/obstack.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!752 = !{!753, !754, !764, !765, !766, !767, !772, !773, !784, !795, !796, !797, !798}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !750, file: !751, line: 175, baseType: !277, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !750, file: !751, line: 176, baseType: !755, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !751, line: 166, size: 128, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !756, file: !751, line: 168, baseType: !272, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !751, line: 169, baseType: !755, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !756, file: !751, line: 170, baseType: !761, offset: 128)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: -1)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !750, file: !751, line: 177, baseType: !272, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !750, file: !751, line: 178, baseType: !272, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !750, file: !751, line: 179, baseType: !272, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !750, file: !751, line: 184, baseType: !768, size: 64, offset: 320)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !750, file: !751, line: 180, size: 64, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !768, file: !751, line: 182, baseType: !277, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !768, file: !751, line: 183, baseType: !156, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !750, file: !751, line: 185, baseType: !277, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !750, file: !751, line: 192, baseType: !774, size: 64, offset: 448)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !750, file: !751, line: 188, size: 64, elements: !775)
!775 = !{!776, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !774, file: !751, line: 190, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!156, !277}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !774, file: !751, line: 191, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!156, !156, !277}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !750, file: !751, line: 197, baseType: !785, size: 64, offset: 512)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !750, file: !751, line: 193, size: 64, elements: !786)
!786 = !{!787, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !785, file: !751, line: 195, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !156}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !785, file: !751, line: 196, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !156, !156}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !750, file: !751, line: 199, baseType: !156, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !750, file: !751, line: 200, baseType: !12, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !750, file: !751, line: 201, baseType: !12, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !750, file: !751, line: 205, baseType: !12, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !9, file: !2, line: 1018, type: !750, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !9, file: !2, line: 1031, type: !750, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1459, type: !334, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1460, type: !329, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "RFC3986", scope: !9, file: !2, line: 1281, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 256)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "dired_pos", scope: !9, file: !2, line: 979, type: !320, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1056, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 96, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 12)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1056, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 55)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "used_color", scope: !9, file: !2, line: 577, type: !114, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !334, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !347, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !2, line: 628, type: !347, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !2, line: 629, type: !329, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !2, line: 630, type: !347, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !2, line: 631, type: !347, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !2, line: 635, type: !347, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !2, line: 637, type: !347, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !347, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !2, line: 639, type: !347, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !2, line: 640, type: !347, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !2, line: 641, type: !347, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 644, type: !600, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "color_indicator", scope: !9, file: !2, line: 619, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 3072, elements: !859)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !2, line: 245, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !855, file: !2, line: 247, baseType: !277, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !855, file: !2, line: 248, baseType: !274, size: 64, offset: 64)
!859 = !{!860}
!860 = !DISubrange(count: 24)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "sig", scope: !111, file: !2, line: 1556, type: !863, isLocal: true, isDefinition: true)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 352, elements: !865)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!865 = !{!866}
!866 = !DISubrange(count: 11)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "caught_signals", scope: !9, file: !2, line: 799, type: !170, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1091, type: !344, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1923, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 44)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2030, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !167)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2030, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 19)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2043, type: !329, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2044, type: !600, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2059, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !865)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2108, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 17)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2139, type: !878, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2147, type: !878, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2151, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 9)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2157, type: !902, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2164, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 8)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2179, type: !914, isLocal: true, isDefinition: true)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !817)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2191, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 18)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2197, type: !922, isLocal: true, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 16)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2242, type: !927, isLocal: true, isDefinition: true)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 14)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2242, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 20)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2242, type: !922, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2251, type: !927, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2254, type: !890, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2298, type: !909, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2304, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 59)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2326, type: !909, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2335, type: !952, isLocal: true, isDefinition: true)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 62)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2368, type: !347, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2381, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 36)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !964, file: !2, line: 2400, type: !1049, isLocal: true, isDefinition: true)
!964 = distinct !DISubprogram(name: "decode_switches", scope: !2, file: !2, line: 1906, type: !965, scopeLine: 1907, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{!118, !118, !271}
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !979, !980, !982, !983, !986, !993, !995, !997, !999, !1002, !1003, !1015, !1018, !1023, !1026, !1027, !1030, !1033, !1036, !1037, !1039, !1044}
!968 = !DILocalVariable(name: "argc", arg: 1, scope: !964, file: !2, line: 1906, type: !118)
!969 = !DILocalVariable(name: "argv", arg: 2, scope: !964, file: !2, line: 1906, type: !271)
!970 = !DILocalVariable(name: "time_style_option", scope: !964, file: !2, line: 1908, type: !272)
!971 = !DILocalVariable(name: "kibibytes_specified", scope: !964, file: !2, line: 1911, type: !114)
!972 = !DILocalVariable(name: "format_opt", scope: !964, file: !2, line: 1912, type: !118)
!973 = !DILocalVariable(name: "hide_control_chars_opt", scope: !964, file: !2, line: 1913, type: !118)
!974 = !DILocalVariable(name: "quoting_style_opt", scope: !964, file: !2, line: 1914, type: !118)
!975 = !DILocalVariable(name: "sort_opt", scope: !964, file: !2, line: 1915, type: !118)
!976 = !DILocalVariable(name: "tabsize_opt", scope: !964, file: !2, line: 1916, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !978, line: 35, baseType: !163)
!978 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stddef.h", directory: "")
!979 = !DILocalVariable(name: "width_opt", scope: !964, file: !2, line: 1917, type: !977)
!980 = !DILocalVariable(name: "oi", scope: !981, file: !2, line: 1921, type: !118)
!981 = distinct !DILexicalBlock(scope: !964, file: !2, line: 1920, column: 5)
!982 = !DILocalVariable(name: "c", scope: !981, file: !2, line: 1922, type: !118)
!983 = !DILocalVariable(name: "i", scope: !984, file: !2, line: 2057, type: !118)
!984 = distinct !DILexicalBlock(scope: !985, file: !2, line: 2056, column: 11)
!985 = distinct !DILexicalBlock(scope: !981, file: !2, line: 1929, column: 9)
!986 = !DILocalVariable(name: "hide", scope: !987, file: !2, line: 2131, type: !988)
!987 = distinct !DILexicalBlock(scope: !985, file: !2, line: 2130, column: 11)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !2, line: 701, size: 128, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !989, file: !2, line: 703, baseType: !274, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !2, line: 704, baseType: !988, size: 64, offset: 64)
!993 = !DILocalVariable(name: "i", scope: !994, file: !2, line: 2162, type: !118)
!994 = distinct !DILexicalBlock(scope: !985, file: !2, line: 2161, column: 11)
!995 = !DILocalVariable(name: "i", scope: !996, file: !2, line: 2177, type: !118)
!996 = distinct !DILexicalBlock(scope: !985, file: !2, line: 2176, column: 11)
!997 = !DILocalVariable(name: "e", scope: !998, file: !2, line: 2212, type: !226)
!998 = distinct !DILexicalBlock(scope: !985, file: !2, line: 2211, column: 11)
!999 = !DILocalVariable(name: "ls_block_size", scope: !1000, file: !2, line: 2251, type: !274)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !2, line: 2250, column: 5)
!1001 = distinct !DILexicalBlock(scope: !964, file: !2, line: 2249, column: 7)
!1002 = !DILocalVariable(name: "linelen", scope: !964, file: !2, line: 2274, type: !977)
!1003 = !DILocalVariable(name: "ws", scope: !1004, file: !2, line: 2286, type: !1008)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !2, line: 2280, column: 9)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !2, line: 2279, column: 11)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 2277, column: 5)
!1007 = distinct !DILexicalBlock(scope: !964, file: !2, line: 2275, column: 7)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !1009, line: 82, size: 64, elements: !1010)
!1009 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/ttycom.h", directory: "")
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !1008, file: !1009, line: 83, baseType: !632, size: 16)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !1008, file: !1009, line: 84, baseType: !632, size: 16, offset: 16)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !1008, file: !1009, line: 85, baseType: !632, size: 16, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !1008, file: !1009, line: 86, baseType: !632, size: 16, offset: 48)
!1015 = !DILocalVariable(name: "p", scope: !1016, file: !2, line: 2298, type: !274)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 2297, column: 9)
!1017 = distinct !DILexicalBlock(scope: !1006, file: !2, line: 2296, column: 11)
!1018 = !DILocalVariable(name: "p", scope: !1019, file: !2, line: 2326, type: !274)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 2324, column: 9)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 2321, column: 11)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 2320, column: 5)
!1022 = distinct !DILexicalBlock(scope: !964, file: !2, line: 2319, column: 7)
!1023 = !DILocalVariable(name: "tmp", scope: !1024, file: !2, line: 2329, type: !312)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 2328, column: 13)
!1025 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 2327, column: 15)
!1026 = !DILocalVariable(name: "qs", scope: !964, file: !2, line: 2346, type: !118)
!1027 = !DILocalVariable(name: "p", scope: !1028, file: !2, line: 2367, type: !274)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 2366, column: 5)
!1029 = distinct !DILexicalBlock(scope: !964, file: !2, line: 2365, column: 7)
!1030 = !DILocalVariable(name: "style", scope: !1031, file: !2, line: 2399, type: !272)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 2398, column: 5)
!1032 = distinct !DILexicalBlock(scope: !964, file: !2, line: 2397, column: 7)
!1033 = !DILocalVariable(name: "p0", scope: !1034, file: !2, line: 2415, type: !272)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 2414, column: 9)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !2, line: 2413, column: 11)
!1036 = !DILocalVariable(name: "p1", scope: !1034, file: !2, line: 2416, type: !272)
!1037 = !DILocalVariable(name: "res", scope: !1038, file: !2, line: 2431, type: !977)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 2430, column: 9)
!1039 = !DILocalVariable(name: "p", scope: !1040, file: !2, line: 2447, type: !1042)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 2435, column: 13)
!1041 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 2434, column: 15)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!1044 = !DILocalVariable(name: "i", scope: !1045, file: !2, line: 2473, type: !118)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 2473, column: 19)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 2472, column: 17)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !2, line: 2471, column: 19)
!1048 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 2455, column: 13)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 56, elements: !167)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2403, type: !890, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2404, type: !878, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2422, type: !1056, isLocal: true, isDefinition: true)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 29)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2439, type: !890, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2446, type: !1063, isLocal: true, isDefinition: true)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 22)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2449, type: !922, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2450, type: !1070, isLocal: true, isDefinition: true)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 54)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !1075, isLocal: true, isDefinition: true)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !859)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2462, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 15)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2466, type: !354, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2467, type: !914, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !600, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !2, line: 854, type: !878, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !2, line: 855, type: !354, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !347, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !2, line: 857, type: !354, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !2, line: 858, type: !1075, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !2, line: 860, type: !1078, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 861, type: !347, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 862, type: !354, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 863, type: !922, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 864, type: !902, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 865, type: !881, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 866, type: !909, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 867, type: !344, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !347, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 869, type: !890, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 870, type: !1078, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 871, type: !902, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 872, type: !354, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 873, type: !329, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 874, type: !1127, isLocal: true, isDefinition: true)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1128)
!1128 = !{!1129}
!1129 = !DISubrange(count: 25)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 875, type: !1132, isLocal: true, isDefinition: true)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 40)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 877, type: !344, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !2, line: 878, type: !878, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 879, type: !922, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !914, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 881, type: !909, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !2, line: 882, type: !890, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 883, type: !927, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 884, type: !354, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !2, line: 885, type: !878, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !881, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !2, line: 887, type: !344, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !2, line: 888, type: !909, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 889, type: !344, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !890, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 891, type: !344, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !347, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 893, type: !354, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 894, type: !890, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !2, line: 895, type: !909, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 896, type: !878, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 897, type: !344, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !2, line: 898, type: !909, isLocal: true, isDefinition: true)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(name: "long_options", scope: !9, file: !2, line: 851, type: !1181, isLocal: true, isDefinition: true)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 11520, elements: !1191)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !1184, line: 50, size: 256, elements: !1185)
!1184 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1185 = !{!1186, !1187, !1188, !1190}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1183, file: !1184, line: 52, baseType: !274, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1183, file: !1184, line: 55, baseType: !118, size: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1183, file: !1184, line: 56, baseType: !1189, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1183, file: !1184, line: 57, baseType: !118, size: 32, offset: 192)
!1191 = !{!1192}
!1192 = !DISubrange(count: 45)
!1193 = !DIGlobalVariableExpression(var: !1194, expr: !DIExpression())
!1194 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !9, file: !2, line: 694, type: !176, isLocal: true, isDefinition: true)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "time_type", scope: !9, file: !2, line: 473, type: !181, isLocal: true, isDefinition: true)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(name: "print_owner", scope: !9, file: !2, line: 503, type: !114, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !9, file: !2, line: 523, type: !118, isLocal: true, isDefinition: true)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !9, file: !2, line: 529, type: !118, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "output_block_size", scope: !9, file: !2, line: 526, type: !312, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !9, file: !2, line: 530, type: !312, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(name: "print_inode", scope: !9, file: !2, line: 660, type: !114, isLocal: true, isDefinition: true)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !9, file: !2, line: 516, type: !114, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(name: "print_group", scope: !9, file: !2, line: 511, type: !114, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !9, file: !2, line: 499, type: !114, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !9, file: !2, line: 707, type: !988, isLocal: true, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "when_types", scope: !9, file: !2, line: 948, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 288, elements: !903)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 944, type: !878, isLocal: true, isDefinition: true)
