; ModuleID = 'coreutils-9.3/build/src/mkdir.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.mkdir_options = type { ptr, i16, i16, i16, i16, ptr, ptr }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [58 x i8] c"Create the DIRECTORY(ies), if they do not already exist.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [279 x i8] c"  -m, --mode=MODE   set file mode (as in chmod), not a=rwx - umask\0A  -p, --parents     no error if existing, make parent directories as needed,\0A                    with their file modes unaffected by any -m option.\0A  -v, --verbose     print a message for each created directory\0A\00", align 1, !dbg !17

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "../src/mkdir.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 39)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 36)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 58)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2232, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 279)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2064, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 258)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 48)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 57)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 6)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !39, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "longopts", scope: !51, file: !2, line: 41, type: !240, isLocal: true, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !98, globals: !110, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!52 = !{!53, !59, !84}
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 332, baseType: !55, size: 32, elements: !56)
!54 = !DIFile(filename: "../src/system.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!58 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !61, file: !60, line: 38, baseType: !76, size: 32, elements: !77)
!60 = !DIFile(filename: "../lib/savewd.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !60, line: 35, size: 64, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !61, file: !60, line: 65, baseType: !59, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !61, file: !60, line: 73, baseType: !65, size: 32, offset: 32)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !60, line: 68, size: 32, elements: !66)
!66 = !{!67, !68, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !60, line: 70, baseType: !55, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !65, file: !60, line: 71, baseType: !55, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !65, file: !60, line: 72, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !71, line: 31, baseType: !72)
!71 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_pid_t.h", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pid_t", file: !73, line: 72, baseType: !74)
!73 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !75, line: 46, baseType: !55)
!75 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!76 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!77 = !{!78, !79, !80, !81, !82, !83}
!78 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!79 = !DIEnumerator(name: "FD_STATE", value: 1)
!80 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!81 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!82 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!83 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !85, line: 32, baseType: !76, size: 32, elements: !86)
!85 = !DIFile(filename: "../lib/quotearg.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!87 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!88 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!89 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!90 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!91 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!92 = !DIEnumerator(name: "c_quoting_style", value: 5)
!93 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!94 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!95 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!96 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!97 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!98 = !{!99, !101, !102, !103, !107}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !104, line: 31, baseType: !105)
!104 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !73, line: 75, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !75, line: 47, baseType: !76)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !108, line: 31, baseType: !109)
!108 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !73, line: 60, baseType: !106)
!110 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !111, !116, !121, !126, !131, !133, !138, !140, !145, !150, !152, !157, !162, !164, !169, !171, !173, !175, !180, !185, !190, !195, !200, !205, !210, !215, !220, !222, !224, !226, !228, !49, !230, !235}
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 21)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 73)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 14)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !128, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 277, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 50)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 292, type: !128, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !54, line: 586, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 75)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !54, line: 660, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !54, line: 660, type: !128, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !54, line: 661, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 10)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !54, line: 661, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 22)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !54, line: 662, type: !154, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !54, line: 662, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 15)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !54, line: 663, type: !154, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !54, line: 664, type: !154, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !54, line: 665, type: !154, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !54, line: 678, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 23)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !54, line: 678, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 40)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !54, line: 683, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 4)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !54, line: 689, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 71)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !54, line: 695, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 5)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !54, line: 696, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 27)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !54, line: 698, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 51)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !54, line: 699, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 12)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 8)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !197, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 45, type: !217, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 46, type: !217, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 47, type: !197, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !217, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 46)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 185, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 33)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1792, elements: !250)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !243, line: 50, size: 256, elements: !244)
!243 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!244 = !{!245, !246, !247, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !243, line: 52, baseType: !99, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !242, file: !243, line: 55, baseType: !55, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !243, line: 56, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !242, file: !243, line: 57, baseType: !55, size: 32, offset: 192)
!250 = !{!251}
!251 = !DISubrange(count: 7)
!252 = !{!"Homebrew clang version 16.0.4"}
!253 = !{i32 7, !"Dwarf Version", i32 4}
!254 = !{i32 2, !"Debug Info Version", i32 3}
!255 = !{i32 1, !"wchar_size", i32 4}
!256 = !{i32 8, !"PIC Level", i32 2}
!257 = !{i32 7, !"uwtable", i32 2}
!258 = !{i32 7, !"frame-pointer", i32 2}
!259 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 53, type: !260, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !55}
!262 = !{!263}
!263 = !DILocalVariable(name: "status", arg: 1, scope: !259, file: !2, line: 53, type: !55)
!264 = !DILocation(line: 0, scope: !259)
!265 = !DILocation(line: 55, column: 14, scope: !266)
!266 = distinct !DILexicalBlock(scope: !259, file: !2, line: 55, column: 7)
!267 = !DILocation(line: 55, column: 7, scope: !259)
!268 = !DILocation(line: 56, column: 5, scope: !266)
!269 = !DILocation(line: 56, column: 5, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !2, line: 56, column: 5)
!271 = !{!272, !272, i64 0}
!272 = !{!"any pointer", !273, i64 0}
!273 = !{!"omnipotent char", !274, i64 0}
!274 = !{!"Simple C/C++ TBAA"}
!275 = !DILocation(line: 59, column: 58, scope: !276)
!276 = distinct !DILexicalBlock(scope: !266, file: !2, line: 58, column: 5)
!277 = !DILocation(line: 59, column: 7, scope: !276)
!278 = !DILocation(line: 62, column: 5, scope: !276)
!279 = !DILocation(line: 60, column: 7, scope: !276)
!280 = !DILocation(line: 64, column: 7, scope: !276)
!281 = !DILocation(line: 71, column: 5, scope: !276)
!282 = !DILocation(line: 66, column: 7, scope: !276)
!283 = !DILocation(line: 77, column: 5, scope: !276)
!284 = !DILocation(line: 72, column: 7, scope: !276)
!285 = !DILocation(line: 78, column: 39, scope: !276)
!286 = !DILocation(line: 78, column: 7, scope: !276)
!287 = !DILocation(line: 79, column: 42, scope: !276)
!288 = !DILocation(line: 79, column: 7, scope: !276)
!289 = !DILocation(line: 80, column: 7, scope: !276)
!290 = !DILocation(line: 82, column: 3, scope: !259)
!291 = !DISubprogram(name: "fprintf", scope: !292, file: !292, line: 155, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!292 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!293 = !DISubroutineType(types: !294)
!294 = !{!55, !295, !350, null}
!295 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !298, line: 157, baseType: !299)
!298 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !298, line: 126, size: 1216, elements: !300)
!300 = !{!301, !304, !305, !306, !308, !309, !314, !315, !316, !320, !324, !332, !336, !337, !340, !341, !345, !347, !348, !349}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !299, file: !298, line: 127, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !299, file: !298, line: 128, baseType: !55, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !299, file: !298, line: 129, baseType: !55, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !299, file: !298, line: 130, baseType: !307, size: 16, offset: 128)
!307 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !299, file: !298, line: 131, baseType: !307, size: 16, offset: 144)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !299, file: !298, line: 132, baseType: !310, size: 128, offset: 192)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !298, line: 92, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !310, file: !298, line: 93, baseType: !302, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !310, file: !298, line: 94, baseType: !55, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !299, file: !298, line: 133, baseType: !55, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !299, file: !298, line: 136, baseType: !102, size: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !299, file: !298, line: 137, baseType: !317, size: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!55, !102}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !299, file: !298, line: 138, baseType: !321, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!55, !102, !101, !55}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !299, file: !298, line: 139, baseType: !325, size: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !102, !328, !55}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !298, line: 81, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !73, line: 71, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !75, line: 48, baseType: !331)
!331 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !299, file: !298, line: 140, baseType: !333, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!55, !102, !99, !55}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !299, file: !298, line: 143, baseType: !310, size: 128, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !299, file: !298, line: 144, baseType: !338, size: 64, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !298, line: 98, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !299, file: !298, line: 145, baseType: !55, size: 32, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !299, file: !298, line: 148, baseType: !342, size: 24, offset: 928)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 24, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 3)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !299, file: !298, line: 149, baseType: !346, size: 8, offset: 952)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 8, elements: !45)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !299, file: !298, line: 152, baseType: !310, size: 128, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !299, file: !298, line: 155, baseType: !55, size: 32, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !299, file: !298, line: 156, baseType: !328, size: 64, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !99)
!351 = !{}
!352 = !DISubprogram(name: "printf", scope: !292, file: !292, line: 175, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!353 = !DISubroutineType(types: !354)
!354 = !{!55, !350, null}
!355 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !292, file: !292, line: 157, type: !356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!356 = !DISubroutineType(types: !357)
!357 = !{!55, !350, !295}
!358 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !54, file: !54, line: 584, type: !359, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !351)
!359 = !DISubroutineType(types: !360)
!360 = !{null}
!361 = !DILocation(line: 588, column: 5, scope: !358)
!362 = !DILocation(line: 586, column: 3, scope: !358)
!363 = !DILocation(line: 589, column: 1, scope: !358)
!364 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 657, type: !365, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !99}
!367 = !{!368, !369, !376, !377, !379, !380}
!368 = !DILocalVariable(name: "program", arg: 1, scope: !364, file: !54, line: 657, type: !99)
!369 = !DILocalVariable(name: "infomap", scope: !364, file: !54, line: 659, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 896, elements: !250)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !364, file: !54, line: 659, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !372, file: !54, line: 659, baseType: !99, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !54, line: 659, baseType: !99, size: 64, offset: 64)
!376 = !DILocalVariable(name: "node", scope: !364, file: !54, line: 669, type: !99)
!377 = !DILocalVariable(name: "map_prog", scope: !364, file: !54, line: 670, type: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!379 = !DILocalVariable(name: "lc_messages", scope: !364, file: !54, line: 682, type: !99)
!380 = !DILocalVariable(name: "url_program", scope: !364, file: !54, line: 695, type: !99)
!381 = !DILocation(line: 0, scope: !364)
!382 = !DILocation(line: 659, column: 3, scope: !364)
!383 = !DILocation(line: 659, column: 67, scope: !364)
!384 = !DILocation(line: 670, column: 36, scope: !364)
!385 = !DILocation(line: 672, column: 3, scope: !364)
!386 = !DILocation(line: 672, column: 20, scope: !364)
!387 = !{!388, !272, i64 0}
!388 = !{!"infomap", !272, i64 0, !272, i64 8}
!389 = !DILocation(line: 672, column: 10, scope: !364)
!390 = !DILocation(line: 672, column: 28, scope: !364)
!391 = !DILocation(line: 672, column: 33, scope: !364)
!392 = !DILocation(line: 672, column: 31, scope: !364)
!393 = !DILocation(line: 673, column: 13, scope: !364)
!394 = distinct !{!394, !385, !393, !395, !396}
!395 = !{!"llvm.loop.mustprogress"}
!396 = !{!"llvm.loop.unroll.disable"}
!397 = !DILocation(line: 675, column: 17, scope: !398)
!398 = distinct !DILexicalBlock(scope: !364, file: !54, line: 675, column: 7)
!399 = !{!388, !272, i64 8}
!400 = !DILocation(line: 675, column: 7, scope: !398)
!401 = !DILocation(line: 675, column: 7, scope: !364)
!402 = !DILocation(line: 676, column: 22, scope: !398)
!403 = !DILocation(line: 676, column: 5, scope: !398)
!404 = !DILocation(line: 678, column: 3, scope: !364)
!405 = !DILocation(line: 682, column: 29, scope: !364)
!406 = !DILocation(line: 683, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !364, file: !54, line: 683, column: 7)
!408 = !DILocation(line: 683, column: 19, scope: !407)
!409 = !DILocation(line: 683, column: 22, scope: !407)
!410 = !DILocation(line: 683, column: 7, scope: !364)
!411 = !DILocation(line: 690, column: 61, scope: !412)
!412 = distinct !DILexicalBlock(scope: !407, file: !54, line: 684, column: 5)
!413 = !DILocation(line: 689, column: 7, scope: !412)
!414 = !DILocation(line: 691, column: 5, scope: !412)
!415 = !DILocation(line: 695, column: 29, scope: !364)
!416 = !DILocation(line: 696, column: 3, scope: !364)
!417 = !DILocation(line: 699, column: 22, scope: !364)
!418 = !DILocation(line: 699, column: 17, scope: !364)
!419 = !DILocation(line: 698, column: 3, scope: !364)
!420 = !DILocation(line: 700, column: 1, scope: !364)
!421 = !DISubprogram(name: "exit", scope: !422, file: !422, line: 145, type: !260, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !351)
!422 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!423 = !DISubprogram(name: "strcmp", scope: !424, file: !424, line: 77, type: !425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!424 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!425 = !DISubroutineType(types: !426)
!426 = !{!55, !99, !99}
!427 = !DISubprogram(name: "setlocale", scope: !428, file: !428, line: 53, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!428 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!429 = !DISubroutineType(types: !430)
!430 = !{!101, !55, !99}
!431 = !DISubprogram(name: "strncmp", scope: !424, file: !424, line: 84, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !351)
!432 = !DISubroutineType(types: !433)
!433 = !{!55, !99, !99, !434}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !435, line: 31, baseType: !436)
!435 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !75, line: 94, baseType: !437)
!437 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!438 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 193, type: !439, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !442)
!439 = !DISubroutineType(types: !440)
!440 = !{!55, !55, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!442 = !{!443, !444, !445, !446, !447, !448, !469, !472, !475}
!443 = !DILocalVariable(name: "argc", arg: 1, scope: !438, file: !2, line: 193, type: !55)
!444 = !DILocalVariable(name: "argv", arg: 2, scope: !438, file: !2, line: 193, type: !441)
!445 = !DILocalVariable(name: "specified_mode", scope: !438, file: !2, line: 195, type: !99)
!446 = !DILocalVariable(name: "optc", scope: !438, file: !2, line: 196, type: !55)
!447 = !DILocalVariable(name: "scontext", scope: !438, file: !2, line: 197, type: !99)
!448 = !DILocalVariable(name: "options", scope: !438, file: !2, line: 198, type: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !2, line: 86, size: 256, elements: !450)
!450 = !{!451, !455, !461, !462, !463, !464, !468}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !449, file: !2, line: 90, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!55, !99, !99, !102}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "umask_ancestor", scope: !449, file: !2, line: 93, baseType: !456, size: 16, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !73, line: 70, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !75, line: 45, baseType: !460)
!460 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "umask_self", scope: !449, file: !2, line: 96, baseType: !456, size: 16, offset: 80)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !449, file: !2, line: 99, baseType: !456, size: 16, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !449, file: !2, line: 102, baseType: !456, size: 16, offset: 112)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !449, file: !2, line: 105, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !467, line: 50, flags: DIFlagFwdDecl)
!467 = !DIFile(filename: "./lib/selinux/label.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !449, file: !2, line: 108, baseType: !99, size: 64, offset: 192)
!469 = !DILocalVariable(name: "ret", scope: !470, file: !2, line: 270, type: !55)
!470 = distinct !DILexicalBlock(scope: !471, file: !2, line: 269, column: 5)
!471 = distinct !DILexicalBlock(scope: !438, file: !2, line: 268, column: 7)
!472 = !DILocalVariable(name: "umask_value", scope: !473, file: !2, line: 285, type: !456)
!473 = distinct !DILexicalBlock(scope: !474, file: !2, line: 284, column: 5)
!474 = distinct !DILexicalBlock(scope: !438, file: !2, line: 283, column: 7)
!475 = !DILocalVariable(name: "change", scope: !476, file: !2, line: 290, type: !478)
!476 = distinct !DILexicalBlock(scope: !477, file: !2, line: 289, column: 9)
!477 = distinct !DILexicalBlock(scope: !473, file: !2, line: 288, column: 11)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !480, line: 25, flags: DIFlagFwdDecl)
!480 = !DIFile(filename: "../lib/modechange.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!481 = !DILocation(line: 0, scope: !438)
!482 = !DILocation(line: 198, column: 3, scope: !438)
!483 = !DILocation(line: 198, column: 24, scope: !438)
!484 = !DILocation(line: 200, column: 11, scope: !438)
!485 = !DILocation(line: 200, column: 34, scope: !438)
!486 = !{!487, !272, i64 0}
!487 = !{!"mkdir_options", !272, i64 0, !488, i64 8, !488, i64 10, !488, i64 12, !488, i64 14, !272, i64 16, !272, i64 24}
!488 = !{!"short", !273, i64 0}
!489 = !DILocation(line: 201, column: 11, scope: !438)
!490 = !DILocation(line: 201, column: 16, scope: !438)
!491 = !{!487, !488, i64 12}
!492 = !DILocation(line: 202, column: 11, scope: !438)
!493 = !DILocation(line: 202, column: 21, scope: !438)
!494 = !{!487, !488, i64 14}
!495 = !DILocation(line: 203, column: 11, scope: !438)
!496 = !DILocation(line: 203, column: 36, scope: !438)
!497 = !{!487, !272, i64 24}
!498 = !DILocation(line: 204, column: 11, scope: !438)
!499 = !DILocation(line: 204, column: 32, scope: !438)
!500 = !{!487, !272, i64 16}
!501 = !DILocation(line: 207, column: 21, scope: !438)
!502 = !DILocation(line: 207, column: 3, scope: !438)
!503 = !DILocation(line: 208, column: 3, scope: !438)
!504 = !DILocation(line: 212, column: 3, scope: !438)
!505 = !DILocation(line: 214, column: 3, scope: !438)
!506 = !DILocation(line: 195, column: 15, scope: !438)
!507 = !DILocation(line: 214, column: 18, scope: !438)
!508 = !DILocation(line: 214, column: 69, scope: !438)
!509 = !DILocation(line: 216, column: 7, scope: !510)
!510 = distinct !DILexicalBlock(scope: !438, file: !2, line: 215, column: 5)
!511 = !DILocation(line: 219, column: 19, scope: !512)
!512 = distinct !DILexicalBlock(scope: !510, file: !2, line: 217, column: 9)
!513 = !DILocation(line: 219, column: 42, scope: !512)
!514 = !DILocation(line: 220, column: 11, scope: !512)
!515 = !DILocation(line: 222, column: 28, scope: !512)
!516 = !DILocation(line: 223, column: 11, scope: !512)
!517 = !DILocation(line: 225, column: 19, scope: !512)
!518 = !DILocation(line: 225, column: 44, scope: !512)
!519 = !DILocation(line: 226, column: 11, scope: !512)
!520 = !DILocation(line: 228, column: 15, scope: !521)
!521 = distinct !DILexicalBlock(scope: !512, file: !2, line: 228, column: 15)
!522 = !DILocation(line: 228, column: 15, scope: !512)
!523 = !DILocation(line: 231, column: 26, scope: !524)
!524 = distinct !DILexicalBlock(scope: !521, file: !2, line: 229, column: 13)
!525 = !DILocation(line: 232, column: 13, scope: !524)
!526 = !DILocation(line: 245, column: 20, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !2, line: 245, column: 20)
!528 = distinct !DILexicalBlock(scope: !521, file: !2, line: 233, column: 20)
!529 = !DILocation(line: 245, column: 20, scope: !528)
!530 = !DILocation(line: 247, column: 15, scope: !531)
