; ModuleID = 'coreutils-9.3/build/src/mv.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.dev_ino = type { i64, i32 }
%struct.cp_options = type { i32, i32, i32, i32, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, ptr, ptr }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [127 x i8] c"Usage: %s [OPTION]... [-T] SOURCE DEST\0A  or:  %s [OPTION]... SOURCE... DIRECTORY\0A  or:  %s [OPTION]... -t DIRECTORY SOURCE...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [56 x i8] c"Rename SOURCE to DEST, or move SOURCE(s) to DIRECTORY.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8

!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 7)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 8)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 6)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !327, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !187, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 11)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !322, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !219, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !280, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !317, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !214, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !317, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !322, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !300, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !322, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "update_type", scope: !79, file: !2, line: 61, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 96, elements: !65)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !290, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !300, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !327, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "update_type_string", scope: !79, file: !2, line: 57, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !291)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, elements: !323)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !300, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !262, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !380, file: !2, line: 109, type: !394, isLocal: true, isDefinition: true)
!380 = distinct !DISubprogram(name: "rm_option_init", scope: !2, file: !2, line: 88, type: !381, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !415)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !145, line: 32, size: 256, elements: !385)
!385 = !{!386, !388, !389, !390, !391, !392, !411, !412, !413, !414}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !384, file: !145, line: 35, baseType: !387, size: 8)
!387 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !384, file: !145, line: 38, baseType: !144, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !384, file: !145, line: 47, baseType: !387, size: 8, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !384, file: !145, line: 50, baseType: !387, size: 8, offset: 72)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !384, file: !145, line: 53, baseType: !387, size: 8, offset: 80)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !384, file: !145, line: 57, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !395, line: 25, size: 128, elements: !396)
!395 = !DIFile(filename: "../lib/dev-ino.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!396 = !{!397, !406}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !394, file: !395, line: 27, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !399, line: 31, baseType: !400)
!399 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_ino_t.h", directory: "")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !401, line: 64, baseType: !402)
!401 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !401, line: 62, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !404, line: 49, baseType: !405)
!404 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!405 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !394, file: !395, line: 28, baseType: !407, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !408, line: 31, baseType: !409)
!408 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !401, line: 57, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !404, line: 46, baseType: !126)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !384, file: !145, line: 61, baseType: !387, size: 8, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !384, file: !145, line: 64, baseType: !387, size: 8, offset: 200)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !384, file: !145, line: 67, baseType: !387, size: 8, offset: 208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !384, file: !145, line: 75, baseType: !387, size: 8, offset: 216)
!415 = !{!416}
!416 = !DILocalVariable(name: "x", arg: 1, scope: !380, file: !2, line: 88, type: !383)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 31)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !253, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 4096, elements: !193)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !427, line: 50, size: 256, elements: !428)
!427 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!428 = !{!429, !430, !431, !433}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !427, line: 52, baseType: !158, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !426, file: !427, line: 55, baseType: !126, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !427, line: 56, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !426, file: !427, line: 57, baseType: !126, size: 32, offset: 192)
!434 = !{!"Homebrew clang version 16.0.4"}
!435 = !{i32 7, !"Dwarf Version", i32 4}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = !{i32 8, !"PIC Level", i32 2}
!439 = !{i32 7, !"uwtable", i32 2}
!440 = !{i32 7, !"frame-pointer", i32 2}
!441 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 250, type: !442, scopeLine: 251, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !126}
!444 = !{!445}
!445 = !DILocalVariable(name: "status", arg: 1, scope: !441, file: !2, line: 250, type: !126)
!446 = !DILocation(line: 0, scope: !441)
!447 = !DILocation(line: 252, column: 14, scope: !448)
!448 = distinct !DILexicalBlock(scope: !441, file: !2, line: 252, column: 7)
!449 = !DILocation(line: 252, column: 7, scope: !441)
!450 = !DILocation(line: 253, column: 5, scope: !448)
!451 = !DILocation(line: 253, column: 5, scope: !452)
!452 = distinct !DILexicalBlock(scope: !448, file: !2, line: 253, column: 5)
!453 = !{!454, !454, i64 0}
!454 = !{!"any pointer", !455, i64 0}
!455 = !{!"omnipotent char", !456, i64 0}
!456 = !{!"Simple C/C++ TBAA"}
!457 = !DILocation(line: 261, column: 15, scope: !458)
!458 = distinct !DILexicalBlock(scope: !448, file: !2, line: 255, column: 5)
!459 = !DILocation(line: 261, column: 29, scope: !458)
!460 = !DILocation(line: 261, column: 43, scope: !458)
!461 = !DILocation(line: 256, column: 7, scope: !458)
!462 = !DILocation(line: 264, column: 5, scope: !458)
!463 = !DILocation(line: 262, column: 7, scope: !458)
!464 = !DILocation(line: 266, column: 7, scope: !458)
!465 = !DILocation(line: 272, column: 5, scope: !458)
!466 = !DILocation(line: 268, column: 7, scope: !458)
!467 = !DILocation(line: 275, column: 5, scope: !458)
!468 = !DILocation(line: 273, column: 7, scope: !458)
!469 = !DILocation(line: 281, column: 5, scope: !458)
!470 = !DILocation(line: 276, column: 7, scope: !458)
!471 = !DILocation(line: 287, column: 5, scope: !458)
!472 = !DILocation(line: 282, column: 7, scope: !458)
!473 = !DILocation(line: 291, column: 5, scope: !458)
!474 = !DILocation(line: 288, column: 7, scope: !458)
!475 = !DILocation(line: 296, column: 5, scope: !458)
!476 = !DILocation(line: 292, column: 7, scope: !458)
!477 = !DILocation(line: 301, column: 5, scope: !458)
!478 = !DILocation(line: 297, column: 7, scope: !458)
!479 = !DILocation(line: 302, column: 39, scope: !458)
!480 = !DILocation(line: 302, column: 7, scope: !458)
!481 = !DILocation(line: 303, column: 42, scope: !458)
!482 = !DILocation(line: 303, column: 7, scope: !458)
!483 = !DILocation(line: 304, column: 7, scope: !458)
!484 = !DILocation(line: 305, column: 7, scope: !458)
!485 = !DILocation(line: 306, column: 7, scope: !458)
!486 = !DILocation(line: 308, column: 3, scope: !441)
!487 = !DISubprogram(name: "fprintf", scope: !488, file: !488, line: 155, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!488 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!489 = !DISubroutineType(types: !490)
!490 = !{!126, !491, !544, null}
!491 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !494, line: 157, baseType: !495)
!494 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !494, line: 126, size: 1216, elements: !496)
!496 = !{!497, !500, !501, !502, !504, !505, !510, !511, !512, !516, !520, !528, !532, !533, !536, !537, !539, !541, !542, !543}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !495, file: !494, line: 127, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !495, file: !494, line: 128, baseType: !126, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !495, file: !494, line: 129, baseType: !126, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !495, file: !494, line: 130, baseType: !503, size: 16, offset: 128)
!503 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !495, file: !494, line: 131, baseType: !503, size: 16, offset: 144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !495, file: !494, line: 132, baseType: !506, size: 128, offset: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !494, line: 92, size: 128, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !506, file: !494, line: 93, baseType: !498, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !506, file: !494, line: 94, baseType: !126, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !495, file: !494, line: 133, baseType: !126, size: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !495, file: !494, line: 136, baseType: !160, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !495, file: !494, line: 137, baseType: !513, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!126, !160}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !495, file: !494, line: 138, baseType: !517, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!126, !160, !163, !126}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !495, file: !494, line: 139, baseType: !521, size: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!524, !160, !524, !126}
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !494, line: 81, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !401, line: 71, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !404, line: 48, baseType: !527)
!527 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !495, file: !494, line: 140, baseType: !529, size: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!126, !160, !158, !126}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !495, file: !494, line: 143, baseType: !506, size: 128, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !495, file: !494, line: 144, baseType: !534, size: 64, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !494, line: 98, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !495, file: !494, line: 145, baseType: !126, size: 32, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !495, file: !494, line: 148, baseType: !538, size: 24, offset: 928)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 24, elements: !65)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !495, file: !494, line: 149, baseType: !540, size: 8, offset: 952)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 8, elements: !70)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !495, file: !494, line: 152, baseType: !506, size: 128, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !495, file: !494, line: 155, baseType: !126, size: 32, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !495, file: !494, line: 156, baseType: !524, size: 64, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !158)
!545 = !{}
!546 = !DISubprogram(name: "printf", scope: !488, file: !488, line: 175, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!547 = !DISubroutineType(types: !548)
!548 = !{!126, !544, null}
!549 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !488, file: !488, line: 157, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!550 = !DISubroutineType(types: !551)
!551 = !{!126, !544, !491}
!552 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !125, file: !125, line: 584, type: !553, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !545)
!553 = !DISubroutineType(types: !554)
!554 = !{null}
!555 = !DILocation(line: 588, column: 5, scope: !552)
!556 = !DILocation(line: 586, column: 3, scope: !552)
!557 = !DILocation(line: 589, column: 1, scope: !552)
!558 = distinct !DISubprogram(name: "emit_update_parameters_note", scope: !125, file: !125, line: 612, type: !553, scopeLine: 613, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !545)
!559 = !DILocation(line: 623, column: 5, scope: !558)
!560 = !DILocation(line: 614, column: 3, scope: !558)
!561 = !DILocation(line: 624, column: 1, scope: !558)
!562 = distinct !DISubprogram(name: "emit_backup_suffix_note", scope: !125, file: !125, line: 627, type: !553, scopeLine: 628, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !545)
!563 = !DILocation(line: 635, column: 5, scope: !562)
!564 = !DILocation(line: 629, column: 3, scope: !562)
!565 = !DILocation(line: 641, column: 5, scope: !562)
!566 = !DILocation(line: 636, column: 3, scope: !562)
!567 = !DILocation(line: 642, column: 1, scope: !562)
!568 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !125, file: !125, line: 657, type: !569, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !158}
!571 = !{!572, !573, !580, !581, !583, !584}
!572 = !DILocalVariable(name: "program", arg: 1, scope: !568, file: !125, line: 657, type: !158)
!573 = !DILocalVariable(name: "infomap", scope: !568, file: !125, line: 659, type: !574)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 896, elements: !318)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !568, file: !125, line: 659, size: 128, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !576, file: !125, line: 659, baseType: !158, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !576, file: !125, line: 659, baseType: !158, size: 64, offset: 64)
!580 = !DILocalVariable(name: "node", scope: !568, file: !125, line: 669, type: !158)
!581 = !DILocalVariable(name: "map_prog", scope: !568, file: !125, line: 670, type: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!583 = !DILocalVariable(name: "lc_messages", scope: !568, file: !125, line: 682, type: !158)
!584 = !DILocalVariable(name: "url_program", scope: !568, file: !125, line: 695, type: !158)
!585 = !DILocation(line: 0, scope: !568)
!586 = !DILocation(line: 659, column: 3, scope: !568)
!587 = !DILocation(line: 659, column: 67, scope: !568)
!588 = !DILocation(line: 670, column: 36, scope: !568)
!589 = !DILocation(line: 672, column: 3, scope: !568)
!590 = !DILocation(line: 672, column: 20, scope: !568)
!591 = !{!592, !454, i64 0}
!592 = !{!"infomap", !454, i64 0, !454, i64 8}
!593 = !DILocation(line: 672, column: 10, scope: !568)
!594 = !DILocation(line: 672, column: 28, scope: !568)
!595 = !DILocation(line: 672, column: 33, scope: !568)
!596 = !DILocation(line: 672, column: 31, scope: !568)
!597 = !DILocation(line: 673, column: 13, scope: !568)
!598 = distinct !{!598, !589, !597, !599, !600}
!599 = !{!"llvm.loop.mustprogress"}
!600 = !{!"llvm.loop.unroll.disable"}
!601 = !DILocation(line: 675, column: 17, scope: !602)
!602 = distinct !DILexicalBlock(scope: !568, file: !125, line: 675, column: 7)
!603 = !{!592, !454, i64 8}
!604 = !DILocation(line: 675, column: 7, scope: !602)
!605 = !DILocation(line: 675, column: 7, scope: !568)
!606 = !DILocation(line: 676, column: 22, scope: !602)
!607 = !DILocation(line: 676, column: 5, scope: !602)
!608 = !DILocation(line: 678, column: 3, scope: !568)
!609 = !DILocation(line: 682, column: 29, scope: !568)
!610 = !DILocation(line: 683, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !568, file: !125, line: 683, column: 7)
!612 = !DILocation(line: 683, column: 19, scope: !611)
!613 = !DILocation(line: 683, column: 22, scope: !611)
!614 = !DILocation(line: 683, column: 7, scope: !568)
!615 = !DILocation(line: 690, column: 61, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !125, line: 684, column: 5)
!617 = !DILocation(line: 689, column: 7, scope: !616)
!618 = !DILocation(line: 691, column: 5, scope: !616)
!619 = !DILocation(line: 695, column: 29, scope: !568)
!620 = !DILocation(line: 696, column: 3, scope: !568)
!621 = !DILocation(line: 699, column: 22, scope: !568)
!622 = !DILocation(line: 699, column: 17, scope: !568)
!623 = !DILocation(line: 698, column: 3, scope: !568)
!624 = !DILocation(line: 700, column: 1, scope: !568)
!625 = !DISubprogram(name: "exit", scope: !626, file: !626, line: 145, type: !442, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !545)
!626 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!627 = !DISubprogram(name: "strcmp", scope: !628, file: !628, line: 77, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!628 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!629 = !DISubroutineType(types: !630)
!630 = !{!126, !158, !158}
!631 = !DISubprogram(name: "setlocale", scope: !632, file: !632, line: 53, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!632 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!633 = !DISubroutineType(types: !634)
!634 = !{!163, !126, !158}
!635 = !DISubprogram(name: "strncmp", scope: !628, file: !628, line: 84, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !545)
!636 = !DISubroutineType(types: !637)
!637 = !{!126, !158, !158, !638}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !639, line: 31, baseType: !640)
!639 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !404, line: 94, baseType: !641)
!641 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!642 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 312, type: !643, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !646)
!643 = !DISubroutineType(types: !644)
!644 = !{!126, !126, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !710, !711, !712, !713, !714, !715, !716, !722, !769, !770, !774, !777, !780, !783, !787, !790, !791, !792}
!647 = !DILocalVariable(name: "argc", arg: 1, scope: !642, file: !2, line: 312, type: !126)
!648 = !DILocalVariable(name: "argv", arg: 2, scope: !642, file: !2, line: 312, type: !645)
!649 = !DILocalVariable(name: "c", scope: !642, file: !2, line: 314, type: !126)
!650 = !DILocalVariable(name: "ok", scope: !642, file: !2, line: 315, type: !387)
!651 = !DILocalVariable(name: "make_backups", scope: !642, file: !2, line: 316, type: !387)
!652 = !DILocalVariable(name: "backup_suffix", scope: !642, file: !2, line: 317, type: !158)
!653 = !DILocalVariable(name: "version_control_string", scope: !642, file: !2, line: 318, type: !163)
!654 = !DILocalVariable(name: "x", scope: !642, file: !2, line: 319, type: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !90, line: 113, size: 704, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !709}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !655, file: !90, line: 115, baseType: !81, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !655, file: !90, line: 118, baseType: !89, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !655, file: !90, line: 123, baseType: !96, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !655, file: !90, line: 126, baseType: !103, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !655, file: !90, line: 130, baseType: !662, size: 16, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !663, line: 31, baseType: !664)
!663 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !401, line: 70, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !404, line: 45, baseType: !666)
!666 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !655, file: !90, line: 134, baseType: !387, size: 8, offset: 144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !655, file: !90, line: 138, baseType: !387, size: 8, offset: 152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !655, file: !90, line: 145, baseType: !387, size: 8, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !655, file: !90, line: 149, baseType: !387, size: 8, offset: 168)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !655, file: !90, line: 153, baseType: !387, size: 8, offset: 176)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "no_copy", scope: !655, file: !90, line: 153, baseType: !387, size: 8, offset: 184)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !655, file: !90, line: 156, baseType: !387, size: 8, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !655, file: !90, line: 160, baseType: !387, size: 8, offset: 200)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !655, file: !90, line: 167, baseType: !387, size: 8, offset: 208)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !655, file: !90, line: 171, baseType: !387, size: 8, offset: 216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !655, file: !90, line: 175, baseType: !387, size: 8, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !655, file: !90, line: 176, baseType: !387, size: 8, offset: 232)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !655, file: !90, line: 177, baseType: !387, size: 8, offset: 240)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !655, file: !90, line: 178, baseType: !387, size: 8, offset: 248)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !655, file: !90, line: 181, baseType: !682, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !684, line: 50, flags: DIFlagFwdDecl)
!684 = !DIFile(filename: "./lib/selinux/label.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !655, file: !90, line: 193, baseType: !387, size: 8, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !655, file: !90, line: 197, baseType: !387, size: 8, offset: 328)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !655, file: !90, line: 203, baseType: !387, size: 8, offset: 336)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !655, file: !90, line: 207, baseType: !387, size: 8, offset: 344)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !655, file: !90, line: 216, baseType: !387, size: 8, offset: 352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !655, file: !90, line: 220, baseType: !387, size: 8, offset: 360)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !655, file: !90, line: 229, baseType: !387, size: 8, offset: 368)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !655, file: !90, line: 238, baseType: !387, size: 8, offset: 376)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !655, file: !90, line: 242, baseType: !387, size: 8, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !655, file: !90, line: 246, baseType: !387, size: 8, offset: 392)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !655, file: !90, line: 250, baseType: !387, size: 8, offset: 400)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !655, file: !90, line: 254, baseType: !387, size: 8, offset: 408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !655, file: !90, line: 257, baseType: !387, size: 8, offset: 416)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !655, file: !90, line: 260, baseType: !387, size: 8, offset: 424)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !655, file: !90, line: 263, baseType: !387, size: 8, offset: 432)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !655, file: !90, line: 268, baseType: !387, size: 8, offset: 440)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !655, file: !90, line: 272, baseType: !387, size: 8, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !655, file: !90, line: 277, baseType: !126, size: 32, offset: 480)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !655, file: !90, line: 280, baseType: !109, size: 32, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !655, file: !90, line: 291, baseType: !705, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !707, line: 49, baseType: !708)
!707 = !DIFile(filename: "../lib/hash.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !707, line: 47, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !655, file: !90, line: 294, baseType: !705, size: 64, offset: 640)
!710 = !DILocalVariable(name: "remove_trailing_slashes", scope: !642, file: !2, line: 320, type: !387)
!711 = !DILocalVariable(name: "target_directory", scope: !642, file: !2, line: 321, type: !158)
!712 = !DILocalVariable(name: "no_target_directory", scope: !642, file: !2, line: 322, type: !387)
!713 = !DILocalVariable(name: "n_files", scope: !642, file: !2, line: 323, type: !126)
!714 = !DILocalVariable(name: "file", scope: !642, file: !2, line: 324, type: !645)
!715 = !DILocalVariable(name: "selinux_enabled", scope: !642, file: !2, line: 325, type: !387)
!716 = !DILocalVariable(name: "update_opt", scope: !717, file: !2, line: 381, type: !119)
!717 = distinct !DILexicalBlock(scope: !718, file: !2, line: 380, column: 13)
!718 = distinct !DILexicalBlock(scope: !719, file: !2, line: 379, column: 20)
!719 = distinct !DILexicalBlock(scope: !720, file: !2, line: 377, column: 15)
!720 = distinct !DILexicalBlock(scope: !721, file: !2, line: 344, column: 9)
!721 = distinct !DILexicalBlock(scope: !642, file: !2, line: 342, column: 5)
!722 = !DILocalVariable(name: "sb", scope: !642, file: !2, line: 440, type: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !724, line: 182, size: 1152, elements: !725)
!724 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!725 = !{!726, !727, !728, !731, !732, !737, !741, !742, !750, !751, !752, !753, !756, !760, !764, !765, !766, !767}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !723, file: !724, line: 182, baseType: !407, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !723, file: !724, line: 182, baseType: !662, size: 16, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !723, file: !724, line: 182, baseType: !729, size: 16, offset: 48)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !730, line: 31, baseType: !665)
!730 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!731 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !723, file: !724, line: 182, baseType: !402, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !723, file: !724, line: 182, baseType: !733, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !734, line: 31, baseType: !735)
!734 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !401, line: 75, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !404, line: 47, baseType: !83)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !723, file: !724, line: 182, baseType: !738, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !739, line: 31, baseType: !740)
!739 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !401, line: 60, baseType: !736)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !723, file: !724, line: 182, baseType: !407, size: 32, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !723, file: !724, line: 182, baseType: !743, size: 128, offset: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !744, line: 33, size: 128, elements: !745)
!744 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!745 = !{!746, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !743, file: !744, line: 35, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !404, line: 122, baseType: !748)
!748 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !743, file: !744, line: 36, baseType: !748, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !723, file: !724, line: 182, baseType: !743, size: 128, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !723, file: !724, line: 182, baseType: !743, size: 128, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !723, file: !724, line: 182, baseType: !743, size: 128, offset: 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !723, file: !724, line: 182, baseType: !754, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !755, line: 31, baseType: !525)
!755 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !723, file: !724, line: 182, baseType: !757, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !758, line: 31, baseType: !759)
!758 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !401, line: 55, baseType: !526)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !723, file: !724, line: 182, baseType: !761, size: 32, offset: 896)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !762, line: 31, baseType: !763)
!762 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !401, line: 56, baseType: !410)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !723, file: !724, line: 182, baseType: !736, size: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !723, file: !724, line: 182, baseType: !736, size: 32, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !723, file: !724, line: 182, baseType: !410, size: 32, offset: 992)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !723, file: !724, line: 182, baseType: !768, size: 128, offset: 1024)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 128, elements: !254)
!769 = !DILocalVariable(name: "target_dirfd", scope: !642, file: !2, line: 442, type: !126)
!770 = !DILocalVariable(name: "lastfile", scope: !771, file: !2, line: 464, type: !158)
!771 = distinct !DILexicalBlock(scope: !772, file: !2, line: 463, column: 5)
!772 = distinct !DILexicalBlock(scope: !773, file: !2, line: 455, column: 12)
!773 = distinct !DILexicalBlock(scope: !642, file: !2, line: 443, column: 7)
!774 = !DILocalVariable(name: "fd", scope: !775, file: !2, line: 471, type: !126)
!775 = distinct !DILexicalBlock(scope: !776, file: !2, line: 470, column: 9)
!776 = distinct !DILexicalBlock(scope: !771, file: !2, line: 469, column: 11)
!777 = !DILocalVariable(name: "err", scope: !778, file: !2, line: 490, type: !126)
!778 = distinct !DILexicalBlock(scope: !779, file: !2, line: 480, column: 13)
!779 = distinct !DILexicalBlock(scope: !775, file: !2, line: 472, column: 15)
!780 = !DILocalVariable(name: "i", scope: !781, file: !2, line: 506, type: !126)
!781 = distinct !DILexicalBlock(scope: !782, file: !2, line: 506, column: 5)
!782 = distinct !DILexicalBlock(scope: !642, file: !2, line: 505, column: 7)
!783 = !DILocalVariable(name: "i", scope: !784, file: !2, line: 536, type: !126)
!784 = distinct !DILexicalBlock(scope: !785, file: !2, line: 536, column: 7)
!785 = distinct !DILexicalBlock(scope: !786, file: !2, line: 528, column: 5)
!786 = distinct !DILexicalBlock(scope: !642, file: !2, line: 527, column: 7)
!787 = !DILocalVariable(name: "source", scope: !788, file: !2, line: 539, type: !158)
!788 = distinct !DILexicalBlock(scope: !789, file: !2, line: 537, column: 9)
!789 = distinct !DILexicalBlock(scope: !784, file: !2, line: 536, column: 7)
!790 = !DILocalVariable(name: "source_basename", scope: !788, file: !2, line: 540, type: !158)
!791 = !DILocalVariable(name: "dest_relname", scope: !788, file: !2, line: 541, type: !163)
!792 = !DILocalVariable(name: "dest", scope: !788, file: !2, line: 542, type: !163)
!793 = !DILocation(line: 0, scope: !642)
!794 = !DILocation(line: 319, column: 3, scope: !642)
!795 = !DILocation(line: 319, column: 21, scope: !642)
!796 = !DILocation(line: 328, column: 21, scope: !642)
!797 = !DILocation(line: 328, column: 3, scope: !642)
!798 = !DILocation(line: 329, column: 3, scope: !642)
!799 = !DILocation(line: 333, column: 3, scope: !642)
!800 = !DILocation(line: 335, column: 3, scope: !642)
!801 = !DILocation(line: 338, column: 3, scope: !642)
!802 = !DILocation(line: 340, column: 3, scope: !642)
!803 = !DILocation(line: 322, column: 8, scope: !642)
!804 = !DILocation(line: 321, column: 15, scope: !642)
!805 = !DILocation(line: 320, column: 8, scope: !642)
!806 = !DILocation(line: 318, column: 9, scope: !642)
!807 = !DILocation(line: 317, column: 15, scope: !642)
!808 = !DILocation(line: 316, column: 8, scope: !642)
!809 = !DILocation(line: 340, column: 15, scope: !642)
!810 = !DILocation(line: 341, column: 10, scope: !642)
!811 = !DILocation(line: 343, column: 7, scope: !721)
!812 = !DILocation(line: 347, column: 15, scope: !813)
!813 = distinct !DILexicalBlock(scope: !720, file: !2, line: 347, column: 15)
!814 = !DILocation(line: 347, column: 15, scope: !720)
!815 = !DILocation(line: 348, column: 38, scope: !813)
!816 = !DILocation(line: 348, column: 13, scope: !813)
!817 = !DILocation(line: 349, column: 11, scope: !720)
!818 = !DILocation(line: 351, column: 13, scope: !720)
!819 = !DILocation(line: 351, column: 25, scope: !720)
!820 = !{!821, !455, i64 8}
