; ModuleID = 'coreutils-9.3/build/src/nproc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [128 x i8] c"Print the number of processing units available to the current process,\0Awhich may be less than the number of online processors\0A\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [117 x i8] c"      --all      print the number of installed processors\0A      --ignore=N  if possible, exclude N processing units\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [57 x i8] c"      --version     output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [6 x i8] c"nproc\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !37

!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !54, line: 660, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 2)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !54, line: 660, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 16)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !54, line: 661, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 10)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !54, line: 661, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 22)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !54, line: 662, type: !106, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !54, line: 662, type: !81, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !54, line: 663, type: !106, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !54, line: 664, type: !106, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !54, line: 665, type: !106, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !54, line: 678, type: !9, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !54, line: 678, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 40)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !54, line: 683, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !54, line: 689, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 71)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !54, line: 695, type: !91, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !54, line: 696, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 27)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !54, line: 698, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 51)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !54, line: 699, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 12)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !133, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 7)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 45, type: !91, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 46, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 8)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 1280, elements: !92)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !175, line: 50, size: 256, elements: !176)
!175 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!176 = !{!177, !178, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !175, line: 52, baseType: !64, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !174, file: !175, line: 55, baseType: !55, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !175, line: 56, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !174, file: !175, line: 57, baseType: !55, size: 32, offset: 192)
!182 = !{!"Homebrew clang version 16.0.4"}
!183 = !{i32 7, !"Dwarf Version", i32 4}
!184 = !{i32 2, !"Debug Info Version", i32 3}
!185 = !{i32 1, !"wchar_size", i32 4}
!186 = !{i32 8, !"PIC Level", i32 2}
!187 = !{i32 7, !"uwtable", i32 2}
!188 = !{i32 7, !"frame-pointer", i32 2}
!189 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 51, type: !190, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !44, retainedNodes: !192)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !55}
!192 = !{!193}
!193 = !DILocalVariable(name: "status", arg: 1, scope: !189, file: !2, line: 51, type: !55)
!194 = !DILocation(line: 0, scope: !189)
!195 = !DILocation(line: 53, column: 14, scope: !196)
!196 = distinct !DILexicalBlock(scope: !189, file: !2, line: 53, column: 7)
!197 = !DILocation(line: 53, column: 7, scope: !189)
!198 = !DILocation(line: 54, column: 5, scope: !196)
!199 = !DILocation(line: 54, column: 5, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !2, line: 54, column: 5)
!201 = !{!202, !202, i64 0}
!202 = !{!"any pointer", !203, i64 0}
!203 = !{!"omnipotent char", !204, i64 0}
!204 = !{!"Simple C/C++ TBAA"}
!205 = !DILocation(line: 57, column: 45, scope: !206)
!206 = distinct !DILexicalBlock(scope: !196, file: !2, line: 56, column: 5)
!207 = !DILocation(line: 57, column: 7, scope: !206)
!208 = !DILocation(line: 62, column: 5, scope: !206)
!209 = !DILocation(line: 58, column: 7, scope: !206)
!210 = !DILocation(line: 66, column: 5, scope: !206)
!211 = !DILocation(line: 63, column: 7, scope: !206)
!212 = !DILocation(line: 68, column: 39, scope: !206)
!213 = !DILocation(line: 68, column: 7, scope: !206)
!214 = !DILocation(line: 69, column: 42, scope: !206)
!215 = !DILocation(line: 69, column: 7, scope: !206)
!216 = !DILocation(line: 70, column: 7, scope: !206)
!217 = !DILocation(line: 72, column: 3, scope: !189)
!218 = !DISubprogram(name: "fprintf", scope: !219, file: !219, line: 155, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!219 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!220 = !DISubroutineType(types: !221)
!221 = !{!55, !222, !279, null}
!222 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !225, line: 157, baseType: !226)
!225 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !225, line: 126, size: 1216, elements: !227)
!227 = !{!228, !231, !232, !233, !235, !236, !241, !242, !243, !247, !251, !261, !265, !266, !269, !270, !274, !276, !277, !278}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !226, file: !225, line: 127, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !226, file: !225, line: 128, baseType: !55, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !226, file: !225, line: 129, baseType: !55, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !226, file: !225, line: 130, baseType: !234, size: 16, offset: 128)
!234 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !226, file: !225, line: 131, baseType: !234, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !226, file: !225, line: 132, baseType: !237, size: 128, offset: 192)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !225, line: 92, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !237, file: !225, line: 93, baseType: !229, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !237, file: !225, line: 94, baseType: !55, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !226, file: !225, line: 133, baseType: !55, size: 32, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !226, file: !225, line: 136, baseType: !67, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !226, file: !225, line: 137, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!55, !67}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !226, file: !225, line: 138, baseType: !248, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!55, !67, !66, !55}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !226, file: !225, line: 139, baseType: !252, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !67, !255, !55}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !225, line: 81, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !257, line: 71, baseType: !258)
!257 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !259, line: 48, baseType: !260)
!259 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!260 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !226, file: !225, line: 140, baseType: !262, size: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!55, !67, !64, !55}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !226, file: !225, line: 143, baseType: !237, size: 128, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !226, file: !225, line: 144, baseType: !267, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !225, line: 98, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !226, file: !225, line: 145, baseType: !55, size: 32, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !226, file: !225, line: 148, baseType: !271, size: 24, offset: 928)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 24, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !226, file: !225, line: 149, baseType: !275, size: 8, offset: 952)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 8, elements: !40)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !226, file: !225, line: 152, baseType: !237, size: 128, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !226, file: !225, line: 155, baseType: !55, size: 32, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !226, file: !225, line: 156, baseType: !255, size: 64, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !64)
!280 = !{}
!281 = !DISubprogram(name: "printf", scope: !219, file: !219, line: 175, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!282 = !DISubroutineType(types: !283)
!283 = !{!55, !279, null}
!284 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !219, file: !219, line: 157, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!285 = !DISubroutineType(types: !286)
!286 = !{!55, !279, !222}
!287 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !54, file: !54, line: 657, type: !288, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !44, retainedNodes: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !64}
!290 = !{!291, !292, !299, !300, !302, !303}
!291 = !DILocalVariable(name: "program", arg: 1, scope: !287, file: !54, line: 657, type: !64)
!292 = !DILocalVariable(name: "infomap", scope: !287, file: !54, line: 659, type: !293)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 896, elements: !163)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !287, file: !54, line: 659, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !295, file: !54, line: 659, baseType: !64, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !295, file: !54, line: 659, baseType: !64, size: 64, offset: 64)
!299 = !DILocalVariable(name: "node", scope: !287, file: !54, line: 669, type: !64)
!300 = !DILocalVariable(name: "map_prog", scope: !287, file: !54, line: 670, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!302 = !DILocalVariable(name: "lc_messages", scope: !287, file: !54, line: 682, type: !64)
!303 = !DILocalVariable(name: "url_program", scope: !287, file: !54, line: 695, type: !64)
!304 = !DILocation(line: 0, scope: !287)
!305 = !DILocation(line: 659, column: 3, scope: !287)
!306 = !DILocation(line: 659, column: 67, scope: !287)
!307 = !DILocation(line: 670, column: 36, scope: !287)
!308 = !DILocation(line: 672, column: 3, scope: !287)
!309 = !DILocation(line: 672, column: 20, scope: !287)
!310 = !{!311, !202, i64 0}
!311 = !{!"infomap", !202, i64 0, !202, i64 8}
!312 = !DILocation(line: 672, column: 10, scope: !287)
!313 = !DILocation(line: 672, column: 28, scope: !287)
!314 = !DILocation(line: 672, column: 33, scope: !287)
!315 = !DILocation(line: 672, column: 31, scope: !287)
!316 = !DILocation(line: 673, column: 13, scope: !287)
!317 = distinct !{!317, !308, !316, !318, !319}
!318 = !{!"llvm.loop.mustprogress"}
!319 = !{!"llvm.loop.unroll.disable"}
!320 = !DILocation(line: 675, column: 17, scope: !321)
!321 = distinct !DILexicalBlock(scope: !287, file: !54, line: 675, column: 7)
!322 = !{!311, !202, i64 8}
!323 = !DILocation(line: 675, column: 7, scope: !321)
!324 = !DILocation(line: 675, column: 7, scope: !287)
!325 = !DILocation(line: 676, column: 22, scope: !321)
!326 = !DILocation(line: 676, column: 5, scope: !321)
!327 = !DILocation(line: 678, column: 3, scope: !287)
!328 = !DILocation(line: 682, column: 29, scope: !287)
!329 = !DILocation(line: 683, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !287, file: !54, line: 683, column: 7)
!331 = !DILocation(line: 683, column: 19, scope: !330)
!332 = !DILocation(line: 683, column: 22, scope: !330)
!333 = !DILocation(line: 683, column: 7, scope: !287)
!334 = !DILocation(line: 690, column: 61, scope: !335)
!335 = distinct !DILexicalBlock(scope: !330, file: !54, line: 684, column: 5)
!336 = !DILocation(line: 689, column: 7, scope: !335)
!337 = !DILocation(line: 691, column: 5, scope: !335)
!338 = !DILocation(line: 695, column: 29, scope: !287)
!339 = !DILocation(line: 696, column: 3, scope: !287)
!340 = !DILocation(line: 699, column: 22, scope: !287)
!341 = !DILocation(line: 699, column: 17, scope: !287)
!342 = !DILocation(line: 698, column: 3, scope: !287)
!343 = !DILocation(line: 700, column: 1, scope: !287)
!344 = !DISubprogram(name: "exit", scope: !345, file: !345, line: 145, type: !190, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !280)
!345 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!346 = !DISubprogram(name: "strcmp", scope: !347, file: !347, line: 77, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!347 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!348 = !DISubroutineType(types: !349)
!349 = !{!55, !64, !64}
!350 = !DISubprogram(name: "setlocale", scope: !351, file: !351, line: 53, type: !352, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!351 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!352 = !DISubroutineType(types: !353)
!353 = !{!66, !55, !64}
!354 = !DISubprogram(name: "strncmp", scope: !347, file: !347, line: 84, type: !355, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !280)
!355 = !DISubroutineType(types: !356)
!356 = !{!55, !64, !64, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 31, baseType: !359)
