; ModuleID = 'coreutils-9.3/build/src/paste.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.__sFILE = type { ptr, i32, i32, i16, i16, %struct.__sbuf, i32, ptr, ptr, ptr, ptr, ptr, %struct.__sbuf, ptr, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sbuf = type { ptr, i32 }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [119 x i8] c"Write lines consisting of the sequentially corresponding lines from\0Aeach FILE, separated by TABs, to standard output.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [144 x i8] c"  -d, --delimiters=LIST   reuse characters from LIST instead of TABs\0A  -s, --serial            paste one file at a time instead of in parallel\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [63 x i8] c"  -z, --zero-terminated    line delimiter is NUL, not newline\0A\00", align 1, !dbg !22

!144 = distinct !DIGlobalVariable(scope: null, file: !57, line: 661, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 10)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !57, line: 661, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 22)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !57, line: 662, type: !145, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !57, line: 662, type: !109, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !57, line: 663, type: !145, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !57, line: 664, type: !145, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !57, line: 665, type: !145, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !57, line: 678, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 23)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !57, line: 678, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 40)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !57, line: 683, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 4)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !57, line: 689, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 71)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !57, line: 695, type: !94, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !57, line: 696, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 27)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !57, line: 698, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 51)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !57, line: 699, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 12)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 7)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 11)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !114, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !94, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 8)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "longopts", scope: !54, file: !2, line: 73, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 1536, elements: !40)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !224, line: 50, size: 256, elements: !225)
!224 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!225 = !{!226, !227, !228, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !224, line: 52, baseType: !87, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !223, file: !224, line: 55, baseType: !58, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !224, line: 56, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !224, line: 57, baseType: !58, size: 32, offset: 192)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "line_delim", scope: !54, file: !2, line: 71, type: !233, isLocal: true, isDefinition: true)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "delim_end", scope: !54, file: !2, line: 69, type: !87, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !44, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 367, type: !99, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !197, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 221, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 25)
!247 = !{!"Homebrew clang version 16.0.4"}
!248 = !{i32 7, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{i32 8, !"PIC Level", i32 2}
!252 = !{i32 7, !"uwtable", i32 2}
!253 = !{i32 7, !"frame-pointer", i32 2}
!254 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 427, type: !255, scopeLine: 428, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !58}
!257 = !{!258}
!258 = !DILocalVariable(name: "status", arg: 1, scope: !254, file: !2, line: 427, type: !58)
!259 = !DILocation(line: 0, scope: !254)
!260 = !DILocation(line: 429, column: 14, scope: !261)
!261 = distinct !DILexicalBlock(scope: !254, file: !2, line: 429, column: 7)
!262 = !DILocation(line: 429, column: 7, scope: !254)
!263 = !DILocation(line: 430, column: 5, scope: !261)
!264 = !DILocation(line: 430, column: 5, scope: !265)
!265 = distinct !DILexicalBlock(scope: !261, file: !2, line: 430, column: 5)
!266 = !{!267, !267, i64 0}
!267 = !{!"any pointer", !268, i64 0}
!268 = !{!"omnipotent char", !269, i64 0}
!269 = !{!"Simple C/C++ TBAA"}
!270 = !DILocation(line: 436, column: 15, scope: !271)
!271 = distinct !DILexicalBlock(scope: !261, file: !2, line: 432, column: 5)
!272 = !DILocation(line: 433, column: 7, scope: !271)
!273 = !DILocation(line: 440, column: 5, scope: !271)
!274 = !DILocation(line: 437, column: 7, scope: !271)
!275 = !DILocation(line: 442, column: 7, scope: !271)
!276 = !DILocation(line: 443, column: 7, scope: !271)
!277 = !DILocation(line: 448, column: 5, scope: !271)
!278 = !DILocation(line: 445, column: 7, scope: !271)
!279 = !DILocation(line: 451, column: 5, scope: !271)
!280 = !DILocation(line: 449, column: 7, scope: !271)
!281 = !DILocation(line: 452, column: 39, scope: !271)
!282 = !DILocation(line: 452, column: 7, scope: !271)
!283 = !DILocation(line: 453, column: 42, scope: !271)
!284 = !DILocation(line: 453, column: 7, scope: !271)
!285 = !DILocation(line: 455, column: 7, scope: !271)
!286 = !DILocation(line: 457, column: 3, scope: !254)
!287 = !DISubprogram(name: "fprintf", scope: !288, file: !288, line: 155, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!288 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!289 = !DISubroutineType(types: !290)
!290 = !{!58, !291, !345, null}
!291 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !294, line: 157, baseType: !295)
!294 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !294, line: 126, size: 1216, elements: !296)
!296 = !{!297, !299, !300, !301, !303, !304, !309, !310, !311, !315, !319, !329, !333, !334, !337, !338, !340, !342, !343, !344}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !295, file: !294, line: 127, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !295, file: !294, line: 128, baseType: !58, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !295, file: !294, line: 129, baseType: !58, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !295, file: !294, line: 130, baseType: !302, size: 16, offset: 128)
!302 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !295, file: !294, line: 131, baseType: !302, size: 16, offset: 144)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !295, file: !294, line: 132, baseType: !305, size: 128, offset: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !294, line: 92, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !305, file: !294, line: 93, baseType: !298, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !305, file: !294, line: 94, baseType: !58, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !295, file: !294, line: 133, baseType: !58, size: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !295, file: !294, line: 136, baseType: !90, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !295, file: !294, line: 137, baseType: !312, size: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!58, !90}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !295, file: !294, line: 138, baseType: !316, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!58, !90, !89, !58}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !295, file: !294, line: 139, baseType: !320, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!323, !90, !323, !58}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !294, line: 81, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !325, line: 71, baseType: !326)
!325 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !327, line: 48, baseType: !328)
!327 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!328 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !295, file: !294, line: 140, baseType: !330, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!58, !90, !87, !58}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !295, file: !294, line: 143, baseType: !305, size: 128, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !295, file: !294, line: 144, baseType: !335, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !294, line: 98, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !295, file: !294, line: 145, baseType: !58, size: 32, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !295, file: !294, line: 148, baseType: !339, size: 24, offset: 928)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 24, elements: !100)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !295, file: !294, line: 149, baseType: !341, size: 8, offset: 952)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 8, elements: !50)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !295, file: !294, line: 152, baseType: !305, size: 128, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !295, file: !294, line: 155, baseType: !58, size: 32, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !295, file: !294, line: 156, baseType: !323, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!346 = !{}
!347 = !DISubprogram(name: "printf", scope: !288, file: !288, line: 175, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!348 = !DISubroutineType(types: !349)
!349 = !{!58, !345, null}
!350 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !288, file: !288, line: 157, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!351 = !DISubroutineType(types: !352)
!352 = !{!58, !345, !291}
!353 = distinct !DISubprogram(name: "emit_stdin_note", scope: !57, file: !57, line: 577, type: !354, scopeLine: 578, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !346)
!354 = !DISubroutineType(types: !355)
!355 = !{null}
!356 = !DILocation(line: 581, column: 5, scope: !353)
!357 = !DILocation(line: 579, column: 3, scope: !353)
!358 = !DILocation(line: 582, column: 1, scope: !353)
!359 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !57, file: !57, line: 584, type: !354, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !346)
!360 = !DILocation(line: 588, column: 5, scope: !359)
!361 = !DILocation(line: 586, column: 3, scope: !359)
!362 = !DILocation(line: 589, column: 1, scope: !359)
!363 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !57, file: !57, line: 657, type: !364, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !87}
!366 = !{!367, !368, !375, !376, !378, !379}
!367 = !DILocalVariable(name: "program", arg: 1, scope: !363, file: !57, line: 657, type: !87)
!368 = !DILocalVariable(name: "infomap", scope: !363, file: !57, line: 659, type: !369)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 896, elements: !203)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !363, file: !57, line: 659, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !371, file: !57, line: 659, baseType: !87, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !371, file: !57, line: 659, baseType: !87, size: 64, offset: 64)
!375 = !DILocalVariable(name: "node", scope: !363, file: !57, line: 669, type: !87)
!376 = !DILocalVariable(name: "map_prog", scope: !363, file: !57, line: 670, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!378 = !DILocalVariable(name: "lc_messages", scope: !363, file: !57, line: 682, type: !87)
!379 = !DILocalVariable(name: "url_program", scope: !363, file: !57, line: 695, type: !87)
!380 = !DILocation(line: 0, scope: !363)
!381 = !DILocation(line: 659, column: 3, scope: !363)
!382 = !DILocation(line: 659, column: 67, scope: !363)
!383 = !DILocation(line: 670, column: 36, scope: !363)
!384 = !DILocation(line: 672, column: 3, scope: !363)
!385 = !DILocation(line: 672, column: 20, scope: !363)
!386 = !{!387, !267, i64 0}
!387 = !{!"infomap", !267, i64 0, !267, i64 8}
!388 = !DILocation(line: 672, column: 10, scope: !363)
!389 = !DILocation(line: 672, column: 28, scope: !363)
!390 = !DILocation(line: 672, column: 33, scope: !363)
!391 = !DILocation(line: 672, column: 31, scope: !363)
!392 = !DILocation(line: 673, column: 13, scope: !363)
!393 = distinct !{!393, !384, !392, !394, !395}
!394 = !{!"llvm.loop.mustprogress"}
!395 = !{!"llvm.loop.unroll.disable"}
!396 = !DILocation(line: 675, column: 17, scope: !397)
!397 = distinct !DILexicalBlock(scope: !363, file: !57, line: 675, column: 7)
!398 = !{!387, !267, i64 8}
!399 = !DILocation(line: 675, column: 7, scope: !397)
!400 = !DILocation(line: 675, column: 7, scope: !363)
!401 = !DILocation(line: 676, column: 22, scope: !397)
!402 = !DILocation(line: 676, column: 5, scope: !397)
!403 = !DILocation(line: 678, column: 3, scope: !363)
!404 = !DILocation(line: 682, column: 29, scope: !363)
!405 = !DILocation(line: 683, column: 7, scope: !406)
!406 = distinct !DILexicalBlock(scope: !363, file: !57, line: 683, column: 7)
!407 = !DILocation(line: 683, column: 19, scope: !406)
!408 = !DILocation(line: 683, column: 22, scope: !406)
!409 = !DILocation(line: 683, column: 7, scope: !363)
!410 = !DILocation(line: 690, column: 61, scope: !411)
!411 = distinct !DILexicalBlock(scope: !406, file: !57, line: 684, column: 5)
!412 = !DILocation(line: 689, column: 7, scope: !411)
!413 = !DILocation(line: 691, column: 5, scope: !411)
!414 = !DILocation(line: 695, column: 29, scope: !363)
!415 = !DILocation(line: 696, column: 3, scope: !363)
!416 = !DILocation(line: 699, column: 22, scope: !363)
!417 = !DILocation(line: 699, column: 17, scope: !363)
!418 = !DILocation(line: 698, column: 3, scope: !363)
!419 = !DILocation(line: 700, column: 1, scope: !363)
!420 = !DISubprogram(name: "exit", scope: !421, file: !421, line: 145, type: !255, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !346)
!421 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!422 = !DISubprogram(name: "strcmp", scope: !423, file: !423, line: 77, type: !424, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!423 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!424 = !DISubroutineType(types: !425)
!425 = !{!58, !87, !87}
!426 = !DISubprogram(name: "setlocale", scope: !427, file: !427, line: 53, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!427 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!428 = !DISubroutineType(types: !429)
!429 = !{!89, !58, !87}
!430 = !DISubprogram(name: "strncmp", scope: !423, file: !423, line: 84, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !346)
!431 = !DISubroutineType(types: !432)
!432 = !{!58, !87, !87, !433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !434, line: 31, baseType: !435)
