; ModuleID = 'coreutils-9.3/build/src/printf.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.infomap = type { ptr, ptr }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, ptr, i32, i32, ptr }
%struct._RuneRange = type { i32, ptr }
%union.__mbstate_t = type { i64, [120 x i8] }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [57 x i8] c"      --version     output version information and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [97 x i8] c"\0AFORMAT controls the output as in C printf.  Interpreted sequences are:\0A\0A  \\\22      double quote\0A\00", align 1, !dbg !27

!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !14, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !64, file: !2, line: 84, type: !203, isLocal: true, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !109, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 29)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 35)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 360, type: !109, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !125, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 37)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !187, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 304, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 41)
!232 = !{!"Homebrew clang version 16.0.4"}
!233 = !{i32 7, !"Dwarf Version", i32 4}
!234 = !{i32 2, !"Debug Info Version", i32 3}
!235 = !{i32 1, !"wchar_size", i32 4}
!236 = !{i32 8, !"PIC Level", i32 2}
!237 = !{i32 7, !"uwtable", i32 2}
!238 = !{i32 7, !"frame-pointer", i32 2}
!239 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 88, type: !240, scopeLine: 89, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !242)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !86}
!242 = !{!243}
!243 = !DILocalVariable(name: "status", arg: 1, scope: !239, file: !2, line: 88, type: !86)
!244 = !DILocation(line: 0, scope: !239)
!245 = !DILocation(line: 90, column: 14, scope: !246)
!246 = distinct !DILexicalBlock(scope: !239, file: !2, line: 90, column: 7)
!247 = !DILocation(line: 90, column: 7, scope: !239)
!248 = !DILocation(line: 91, column: 5, scope: !246)
!249 = !DILocation(line: 91, column: 5, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !2, line: 91, column: 5)
!251 = !{!252, !252, i64 0}
!252 = !{!"any pointer", !253, i64 0}
!253 = !{!"omnipotent char", !254, i64 0}
!254 = !{!"Simple C/C++ TBAA"}
!255 = !DILocation(line: 98, column: 15, scope: !256)
!256 = distinct !DILexicalBlock(scope: !246, file: !2, line: 93, column: 5)
!257 = !DILocation(line: 98, column: 29, scope: !256)
!258 = !DILocation(line: 94, column: 7, scope: !256)
!259 = !DILocation(line: 102, column: 5, scope: !256)
!260 = !DILocation(line: 99, column: 7, scope: !256)
!261 = !DILocation(line: 103, column: 39, scope: !256)
!262 = !DILocation(line: 103, column: 7, scope: !256)
!263 = !DILocation(line: 104, column: 42, scope: !256)
!264 = !DILocation(line: 104, column: 7, scope: !256)
!265 = !DILocation(line: 110, column: 5, scope: !256)
!266 = !DILocation(line: 105, column: 7, scope: !256)
!267 = !DILocation(line: 122, column: 5, scope: !256)
!268 = !DILocation(line: 111, column: 7, scope: !256)
!269 = !DILocation(line: 128, column: 5, scope: !256)
!270 = !DILocation(line: 123, column: 7, scope: !256)
!271 = !DILocation(line: 138, column: 5, scope: !256)
!272 = !DILocation(line: 129, column: 7, scope: !256)
!273 = !DILocation(line: 139, column: 7, scope: !256)
!274 = !DILocation(line: 140, column: 7, scope: !256)
!275 = !DILocation(line: 142, column: 3, scope: !239)
!276 = !DISubprogram(name: "fprintf", scope: !277, file: !277, line: 155, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!277 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!278 = !DISubroutineType(types: !279)
!279 = !{!86, !280, !335, null}
!280 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !283, line: 157, baseType: !284)
!283 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !283, line: 126, size: 1216, elements: !285)
!285 = !{!286, !289, !290, !291, !293, !294, !299, !300, !301, !305, !309, !319, !323, !324, !327, !328, !330, !332, !333, !334}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !284, file: !283, line: 127, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !284, file: !283, line: 128, baseType: !86, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !284, file: !283, line: 129, baseType: !86, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !284, file: !283, line: 130, baseType: !292, size: 16, offset: 128)
!292 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !284, file: !283, line: 131, baseType: !292, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !284, file: !283, line: 132, baseType: !295, size: 128, offset: 192)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !283, line: 92, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !295, file: !283, line: 93, baseType: !287, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !295, file: !283, line: 94, baseType: !86, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !284, file: !283, line: 133, baseType: !86, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !284, file: !283, line: 136, baseType: !84, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !284, file: !283, line: 137, baseType: !302, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!86, !84}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !284, file: !283, line: 138, baseType: !306, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!86, !84, !85, !86}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !284, file: !283, line: 139, baseType: !310, size: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !84, !313, !86}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !283, line: 81, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !315, line: 71, baseType: !316)
!315 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !317, line: 48, baseType: !318)
!317 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!318 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !284, file: !283, line: 140, baseType: !320, size: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!86, !84, !82, !86}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !284, file: !283, line: 143, baseType: !295, size: 128, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !284, file: !283, line: 144, baseType: !325, size: 64, offset: 832)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !283, line: 98, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !284, file: !283, line: 145, baseType: !86, size: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !284, file: !283, line: 148, baseType: !329, size: 24, offset: 928)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 24, elements: !110)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !284, file: !283, line: 149, baseType: !331, size: 8, offset: 952)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 8, elements: !60)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !284, file: !283, line: 152, baseType: !295, size: 128, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !284, file: !283, line: 155, baseType: !86, size: 32, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !284, file: !283, line: 156, baseType: !313, size: 64, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !82)
!336 = !{}
!337 = !DISubprogram(name: "printf", scope: !277, file: !277, line: 175, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!338 = !DISubroutineType(types: !339)
!339 = !{!86, !335, null}
!340 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !277, file: !277, line: 157, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!341 = !DISubroutineType(types: !342)
!342 = !{!86, !335, !280}
!343 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !124, file: !124, line: 657, type: !344, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !82}
!346 = !{!347, !348, !355, !356, !358, !359}
!347 = !DILocalVariable(name: "program", arg: 1, scope: !343, file: !124, line: 657, type: !82)
!348 = !DILocalVariable(name: "infomap", scope: !343, file: !124, line: 659, type: !349)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 896, elements: !55)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !343, file: !124, line: 659, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !351, file: !124, line: 659, baseType: !82, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !351, file: !124, line: 659, baseType: !82, size: 64, offset: 64)
!355 = !DILocalVariable(name: "node", scope: !343, file: !124, line: 669, type: !82)
!356 = !DILocalVariable(name: "map_prog", scope: !343, file: !124, line: 670, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!358 = !DILocalVariable(name: "lc_messages", scope: !343, file: !124, line: 682, type: !82)
!359 = !DILocalVariable(name: "url_program", scope: !343, file: !124, line: 695, type: !82)
!360 = !DILocation(line: 0, scope: !343)
!361 = !DILocation(line: 659, column: 3, scope: !343)
!362 = !DILocation(line: 659, column: 67, scope: !343)
!363 = !DILocation(line: 670, column: 36, scope: !343)
!364 = !DILocation(line: 672, column: 3, scope: !343)
!365 = !DILocation(line: 672, column: 20, scope: !343)
!366 = !{!367, !252, i64 0}
!367 = !{!"infomap", !252, i64 0, !252, i64 8}
!368 = !DILocation(line: 672, column: 10, scope: !343)
!369 = !DILocation(line: 672, column: 28, scope: !343)
!370 = !DILocation(line: 672, column: 33, scope: !343)
!371 = !DILocation(line: 672, column: 31, scope: !343)
!372 = !DILocation(line: 673, column: 13, scope: !343)
!373 = distinct !{!373, !364, !372, !374, !375}
!374 = !{!"llvm.loop.mustprogress"}
!375 = !{!"llvm.loop.unroll.disable"}
!376 = !DILocation(line: 675, column: 17, scope: !377)
!377 = distinct !DILexicalBlock(scope: !343, file: !124, line: 675, column: 7)
!378 = !{!367, !252, i64 8}
!379 = !DILocation(line: 675, column: 7, scope: !377)
!380 = !DILocation(line: 675, column: 7, scope: !343)
!381 = !DILocation(line: 676, column: 22, scope: !377)
!382 = !DILocation(line: 676, column: 5, scope: !377)
!383 = !DILocation(line: 678, column: 3, scope: !343)
!384 = !DILocation(line: 682, column: 29, scope: !343)
!385 = !DILocation(line: 683, column: 7, scope: !386)
!386 = distinct !DILexicalBlock(scope: !343, file: !124, line: 683, column: 7)
!387 = !DILocation(line: 683, column: 19, scope: !386)
!388 = !DILocation(line: 683, column: 22, scope: !386)
!389 = !DILocation(line: 683, column: 7, scope: !343)
!390 = !DILocation(line: 690, column: 61, scope: !391)
!391 = distinct !DILexicalBlock(scope: !386, file: !124, line: 684, column: 5)
!392 = !DILocation(line: 689, column: 7, scope: !391)
!393 = !DILocation(line: 691, column: 5, scope: !391)
!394 = !DILocation(line: 695, column: 29, scope: !343)
!395 = !DILocation(line: 696, column: 3, scope: !343)
!396 = !DILocation(line: 699, column: 22, scope: !343)
!397 = !DILocation(line: 699, column: 17, scope: !343)
!398 = !DILocation(line: 698, column: 3, scope: !343)
!399 = !DILocation(line: 700, column: 1, scope: !343)
!400 = !DISubprogram(name: "exit", scope: !401, file: !401, line: 145, type: !240, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !336)
!401 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!402 = !DISubprogram(name: "strcmp", scope: !403, file: !403, line: 77, type: !404, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!403 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!404 = !DISubroutineType(types: !405)
!405 = !{!86, !82, !82}
!406 = !DISubprogram(name: "setlocale", scope: !407, file: !407, line: 53, type: !408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!407 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!408 = !DISubroutineType(types: !409)
!409 = !{!85, !86, !82}
!410 = !DISubprogram(name: "strncmp", scope: !403, file: !403, line: 84, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !336)
!411 = !DISubroutineType(types: !412)
!412 = !{!86, !82, !82, !413}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !414, line: 31, baseType: !415)
