; ModuleID = 'coreutils-9.3/build/src/sync.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION] [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [137 x i8] c"Synchronize cached writes to persistent storage\0A\0AIf one or more files are specified, sync only them,\0Aor their containing file systems.\0A\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [68 x i8] c"  -d, --data             sync only file data, no unneeded metadata\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [71 x i8] c"  -f, --file-system      sync the file systems that contain the files\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [57 x i8] c"      --version     output version information and exit\0A\00", align 1, !dbg !32

!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 22)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !64, line: 662, type: !126, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !64, line: 662, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 15)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !64, line: 663, type: !126, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !64, line: 664, type: !126, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !64, line: 665, type: !126, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !64, line: 678, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 23)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !64, line: 678, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 40)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !64, line: 683, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 4)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !64, line: 689, type: !24, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !64, line: 695, type: !39, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !64, line: 696, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 27)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !64, line: 698, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 51)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !64, line: 699, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 12)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !39, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !178, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !39, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 17)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 36)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !194, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 19)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 1280, elements: !40)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !212, line: 50, size: 256, elements: !213)
!212 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!213 = !{!214, !215, !216, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !212, line: 52, baseType: !84, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !211, file: !212, line: 55, baseType: !65, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !212, line: 56, baseType: !217, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !211, file: !212, line: 57, baseType: !65, size: 32, offset: 192)
!219 = !{!"Homebrew clang version 16.0.4"}
!220 = !{i32 7, !"Dwarf Version", i32 4}
!221 = !{i32 2, !"Debug Info Version", i32 3}
!222 = !{i32 1, !"wchar_size", i32 4}
!223 = !{i32 8, !"PIC Level", i32 2}
!224 = !{i32 7, !"uwtable", i32 2}
!225 = !{i32 7, !"frame-pointer", i32 2}
!226 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 58, type: !227, scopeLine: 59, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !65}
!229 = !{!230}
!230 = !DILocalVariable(name: "status", arg: 1, scope: !226, file: !2, line: 58, type: !65)
!231 = !DILocation(line: 0, scope: !226)
!232 = !DILocation(line: 60, column: 14, scope: !233)
!233 = distinct !DILexicalBlock(scope: !226, file: !2, line: 60, column: 7)
!234 = !DILocation(line: 60, column: 7, scope: !226)
!235 = !DILocation(line: 61, column: 5, scope: !233)
!236 = !DILocation(line: 61, column: 5, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !2, line: 61, column: 5)
!238 = !{!239, !239, i64 0}
!239 = !{!"any pointer", !240, i64 0}
!240 = !{!"omnipotent char", !241, i64 0}
!241 = !{!"Simple C/C++ TBAA"}
!242 = !DILocation(line: 64, column: 52, scope: !243)
!243 = distinct !DILexicalBlock(scope: !233, file: !2, line: 63, column: 5)
!244 = !DILocation(line: 64, column: 7, scope: !243)
!245 = !DILocation(line: 71, column: 5, scope: !243)
!246 = !DILocation(line: 65, column: 7, scope: !243)
!247 = !DILocation(line: 75, column: 5, scope: !243)
!248 = !DILocation(line: 73, column: 7, scope: !243)
!249 = !DILocation(line: 78, column: 5, scope: !243)
!250 = !DILocation(line: 76, column: 7, scope: !243)
!251 = !DILocation(line: 80, column: 39, scope: !243)
!252 = !DILocation(line: 80, column: 7, scope: !243)
!253 = !DILocation(line: 81, column: 42, scope: !243)
!254 = !DILocation(line: 81, column: 7, scope: !243)
!255 = !DILocation(line: 82, column: 7, scope: !243)
!256 = !DILocation(line: 84, column: 3, scope: !226)
!257 = !DISubprogram(name: "fprintf", scope: !258, file: !258, line: 155, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!258 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!259 = !DISubroutineType(types: !260)
!260 = !{!65, !261, !316, null}
!261 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !264, line: 157, baseType: !265)
!264 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !264, line: 126, size: 1216, elements: !266)
!266 = !{!267, !270, !271, !272, !274, !275, !280, !281, !282, !286, !290, !300, !304, !305, !308, !309, !311, !313, !314, !315}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !265, file: !264, line: 127, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !265, file: !264, line: 128, baseType: !65, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !265, file: !264, line: 129, baseType: !65, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !265, file: !264, line: 130, baseType: !273, size: 16, offset: 128)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !265, file: !264, line: 131, baseType: !273, size: 16, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !265, file: !264, line: 132, baseType: !276, size: 128, offset: 192)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !264, line: 92, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !276, file: !264, line: 93, baseType: !268, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !276, file: !264, line: 94, baseType: !65, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !265, file: !264, line: 133, baseType: !65, size: 32, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !265, file: !264, line: 136, baseType: !87, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !265, file: !264, line: 137, baseType: !283, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!65, !87}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !265, file: !264, line: 138, baseType: !287, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!65, !87, !86, !65}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !265, file: !264, line: 139, baseType: !291, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !87, !294, !65}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !264, line: 81, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !296, line: 71, baseType: !297)
!296 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !298, line: 48, baseType: !299)
!298 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!299 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !265, file: !264, line: 140, baseType: !301, size: 64, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!65, !87, !84, !65}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !265, file: !264, line: 143, baseType: !276, size: 128, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !265, file: !264, line: 144, baseType: !306, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !264, line: 98, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !265, file: !264, line: 145, baseType: !65, size: 32, offset: 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !265, file: !264, line: 148, baseType: !310, size: 24, offset: 928)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 24, elements: !50)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !265, file: !264, line: 149, baseType: !312, size: 8, offset: 952)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 8, elements: !45)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !265, file: !264, line: 152, baseType: !276, size: 128, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !265, file: !264, line: 155, baseType: !65, size: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !265, file: !264, line: 156, baseType: !294, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!317 = !{}
!318 = !DISubprogram(name: "printf", scope: !258, file: !258, line: 175, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!319 = !DISubroutineType(types: !320)
!320 = !{!65, !316, null}
!321 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !258, file: !258, line: 157, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!322 = !DISubroutineType(types: !323)
!323 = !{!65, !316, !261}
!324 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !64, file: !64, line: 657, type: !325, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !84}
!327 = !{!328, !329, !338, !339, !341, !342}
!328 = !DILocalVariable(name: "program", arg: 1, scope: !324, file: !64, line: 657, type: !84)
!329 = !DILocalVariable(name: "infomap", scope: !324, file: !64, line: 659, type: !330)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 896, elements: !336)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !324, file: !64, line: 659, size: 128, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !332, file: !64, line: 659, baseType: !84, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !332, file: !64, line: 659, baseType: !84, size: 64, offset: 64)
!336 = !{!337}
!337 = !DISubrange(count: 7)
!338 = !DILocalVariable(name: "node", scope: !324, file: !64, line: 669, type: !84)
!339 = !DILocalVariable(name: "map_prog", scope: !324, file: !64, line: 670, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!341 = !DILocalVariable(name: "lc_messages", scope: !324, file: !64, line: 682, type: !84)
!342 = !DILocalVariable(name: "url_program", scope: !324, file: !64, line: 695, type: !84)
!343 = !DILocation(line: 0, scope: !324)
!344 = !DILocation(line: 659, column: 3, scope: !324)
!345 = !DILocation(line: 659, column: 67, scope: !324)
!346 = !DILocation(line: 670, column: 36, scope: !324)
!347 = !DILocation(line: 672, column: 3, scope: !324)
!348 = !DILocation(line: 672, column: 20, scope: !324)
!349 = !{!350, !239, i64 0}
!350 = !{!"infomap", !239, i64 0, !239, i64 8}
!351 = !DILocation(line: 672, column: 10, scope: !324)
!352 = !DILocation(line: 672, column: 28, scope: !324)
!353 = !DILocation(line: 672, column: 33, scope: !324)
!354 = !DILocation(line: 672, column: 31, scope: !324)
!355 = !DILocation(line: 673, column: 13, scope: !324)
!356 = distinct !{!356, !347, !355, !357, !358}
!357 = !{!"llvm.loop.mustprogress"}
!358 = !{!"llvm.loop.unroll.disable"}
!359 = !DILocation(line: 675, column: 17, scope: !360)
!360 = distinct !DILexicalBlock(scope: !324, file: !64, line: 675, column: 7)
!361 = !{!350, !239, i64 8}
!362 = !DILocation(line: 675, column: 7, scope: !360)
!363 = !DILocation(line: 675, column: 7, scope: !324)
!364 = !DILocation(line: 676, column: 22, scope: !360)
!365 = !DILocation(line: 676, column: 5, scope: !360)
!366 = !DILocation(line: 678, column: 3, scope: !324)
!367 = !DILocation(line: 682, column: 29, scope: !324)
!368 = !DILocation(line: 683, column: 7, scope: !369)
!369 = distinct !DILexicalBlock(scope: !324, file: !64, line: 683, column: 7)
!370 = !DILocation(line: 683, column: 19, scope: !369)
!371 = !DILocation(line: 683, column: 22, scope: !369)
!372 = !DILocation(line: 683, column: 7, scope: !324)
!373 = !DILocation(line: 690, column: 61, scope: !374)
!374 = distinct !DILexicalBlock(scope: !369, file: !64, line: 684, column: 5)
!375 = !DILocation(line: 689, column: 7, scope: !374)
!376 = !DILocation(line: 691, column: 5, scope: !374)
!377 = !DILocation(line: 695, column: 29, scope: !324)
!378 = !DILocation(line: 696, column: 3, scope: !324)
!379 = !DILocation(line: 699, column: 22, scope: !324)
!380 = !DILocation(line: 699, column: 17, scope: !324)
!381 = !DILocation(line: 698, column: 3, scope: !324)
!382 = !DILocation(line: 700, column: 1, scope: !324)
!383 = !DISubprogram(name: "exit", scope: !384, file: !384, line: 145, type: !227, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !317)
!384 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!385 = !DISubprogram(name: "strcmp", scope: !386, file: !386, line: 77, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!386 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!387 = !DISubroutineType(types: !388)
!388 = !{!65, !84, !84}
!389 = !DISubprogram(name: "setlocale", scope: !390, file: !390, line: 53, type: !391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!390 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!391 = !DISubroutineType(types: !392)
!392 = !{!86, !65, !84}
!393 = !DISubprogram(name: "strncmp", scope: !386, file: !386, line: 84, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !317)
!394 = !DISubroutineType(types: !395)
!395 = !{!65, !84, !84, !396}
