; ModuleID = 'coreutils-9.3/build/src/wc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, ptr, i32, i32, ptr }
%struct._RuneRange = type { i32, ptr }
%struct.Tokens = type { i64, ptr, ptr, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, ptr, ptr, ptr, ptr, %union.anon, i64, %union.anon.0, %union.anon.0, ptr, i8 }
%union.anon = type { i64 }
%union.anon.0 = type { ptr }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.fstatus = type { i32, %struct.stat }
%union.__mbstate_t = type { i64, [120 x i8] }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0A  or:  %s [OPTION]... --files0-from=F\0A\00", align 1, !dbg !7

!114 = !{!0, !7, !12, !17, !22, !24, !29, !34, !39, !44, !115, !120, !125, !130, !135, !140, !142, !147, !152, !157, !162, !164, !169, !174, !387, !392, !397, !400, !405, !410, !412, !417, !419, !424, !426, !428, !430, !432, !434, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !466, !49, !468, !470, !475, !477, !479, !484, !489, !491, !493, !495, !497, !499, !504, !506, !508, !510, !512, !514, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !539, !551, !555, !557, !562, !564, !566, !570, !572, !574, !579, !584, !589, !595, !612}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 16)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 851, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 6)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 883, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 8)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 888, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 14)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 888, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 11)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 888, type: !117, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 908, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 17)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 909, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 4)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !2, line: 910, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 52)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !2, line: 914, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 2)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 918, type: !159, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !2, line: 920, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 27)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 934, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 31)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "stdin_only", scope: !176, file: !2, line: 949, type: !386, isLocal: true, isDefinition: true)
!176 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 822, type: !177, scopeLine: 823, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !180)
!177 = !DISubroutineType(types: !178)
!178 = !{!61, !61, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!180 = !{!181, !182, !183, !185, !186, !187, !188, !189, !257, !317, !318, !321, !372, !373, !375, !378, !379, !380, !385}
!181 = !DILocalVariable(name: "argc", arg: 1, scope: !176, file: !2, line: 822, type: !61)
!182 = !DILocalVariable(name: "argv", arg: 2, scope: !176, file: !2, line: 822, type: !179)
!183 = !DILocalVariable(name: "ok", scope: !176, file: !2, line: 824, type: !184)
!184 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!185 = !DILocalVariable(name: "optc", scope: !176, file: !2, line: 825, type: !61)
!186 = !DILocalVariable(name: "nfiles", scope: !176, file: !2, line: 826, type: !108)
!187 = !DILocalVariable(name: "files", scope: !176, file: !2, line: 827, type: !179)
!188 = !DILocalVariable(name: "files_from", scope: !176, file: !2, line: 828, type: !107)
!189 = !DILocalVariable(name: "fstatus", scope: !176, file: !2, line: 829, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !2, line: 104, size: 1216, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !191, file: !2, line: 108, baseType: !61, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !191, file: !2, line: 111, baseType: !195, size: 1152, offset: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !196, line: 182, size: 1152, elements: !197)
!196 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!197 = !{!198, !204, !210, !213, !217, !222, !226, !227, !235, !236, !237, !238, !244, !248, !252, !253, !254, !255}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !195, file: !196, line: 182, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !200, line: 31, baseType: !201)
!200 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !202, line: 57, baseType: !203)
!202 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !111, line: 46, baseType: !61)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !195, file: !196, line: 182, baseType: !205, size: 16, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !206, line: 31, baseType: !207)
!206 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !202, line: 70, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !111, line: 45, baseType: !209)
!209 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !195, file: !196, line: 182, baseType: !211, size: 16, offset: 48)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !212, line: 31, baseType: !208)
!212 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !195, file: !196, line: 182, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !202, line: 62, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !111, line: 49, baseType: !216)
!216 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !195, file: !196, line: 182, baseType: !218, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !219, line: 31, baseType: !220)
!219 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !202, line: 75, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !111, line: 47, baseType: !54)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !195, file: !196, line: 182, baseType: !223, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !224, line: 31, baseType: !225)
!224 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !202, line: 60, baseType: !221)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !195, file: !196, line: 182, baseType: !199, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !195, file: !196, line: 182, baseType: !228, size: 128, offset: 256)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !229, line: 33, size: 128, elements: !230)
!229 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!230 = !{!231, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !228, file: !229, line: 35, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !111, line: 122, baseType: !233)
!233 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !228, file: !229, line: 36, baseType: !233, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !195, file: !196, line: 182, baseType: !228, size: 128, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !195, file: !196, line: 182, baseType: !228, size: 128, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !195, file: !196, line: 182, baseType: !228, size: 128, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !195, file: !196, line: 182, baseType: !239, size: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !240, line: 31, baseType: !241)
!240 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !202, line: 71, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 48, baseType: !243)
!243 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !195, file: !196, line: 182, baseType: !245, size: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !246, line: 31, baseType: !247)
!246 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !202, line: 55, baseType: !242)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !195, file: !196, line: 182, baseType: !249, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !250, line: 31, baseType: !251)
!250 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !202, line: 56, baseType: !203)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !195, file: !196, line: 182, baseType: !221, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !195, file: !196, line: 182, baseType: !221, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !195, file: !196, line: 182, baseType: !203, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !195, file: !196, line: 182, baseType: !256, size: 128, offset: 1024)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 128, elements: !160)
!257 = !DILocalVariable(name: "tok", scope: !176, file: !2, line: 830, type: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !259, line: 27, size: 2304, elements: !260)
!259 = !DIFile(filename: "../lib/readtokens0.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!260 = !{!261, !262, !263, !265, !315, !316}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !258, file: !259, line: 29, baseType: !108, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !258, file: !259, line: 30, baseType: !179, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !258, file: !259, line: 31, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !258, file: !259, line: 32, baseType: !266, size: 704, offset: 192)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !267, line: 173, size: 704, elements: !268)
!267 = !DIFile(filename: "../lib/obstack.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!268 = !{!269, !270, !280, !281, !282, !283, !288, !289, !300, !311, !312, !313, !314}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !266, file: !267, line: 175, baseType: !108, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !266, file: !267, line: 176, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !267, line: 166, size: 128, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !272, file: !267, line: 168, baseType: !107, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !267, line: 169, baseType: !271, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !272, file: !267, line: 170, baseType: !277, offset: 128)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: -1)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !266, file: !267, line: 177, baseType: !107, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !266, file: !267, line: 178, baseType: !107, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !266, file: !267, line: 179, baseType: !107, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !266, file: !267, line: 184, baseType: !284, size: 64, offset: 320)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !267, line: 180, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !284, file: !267, line: 182, baseType: !108, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !284, file: !267, line: 183, baseType: !104, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !266, file: !267, line: 185, baseType: !108, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !266, file: !267, line: 192, baseType: !290, size: 64, offset: 448)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !267, line: 188, size: 64, elements: !291)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !290, file: !267, line: 190, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!104, !108}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !290, file: !267, line: 191, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!104, !104, !108}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !266, file: !267, line: 197, baseType: !301, size: 64, offset: 512)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !267, line: 193, size: 64, elements: !302)
!302 = !{!303, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !301, file: !267, line: 195, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !104}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !301, file: !267, line: 196, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !104, !104}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !266, file: !267, line: 199, baseType: !104, size: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !266, file: !267, line: 200, baseType: !54, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !266, file: !267, line: 201, baseType: !54, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !266, file: !267, line: 205, baseType: !54, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !258, file: !259, line: 33, baseType: !266, size: 704, offset: 896)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !258, file: !259, line: 34, baseType: !266, size: 704, offset: 1600)
!317 = !DILocalVariable(name: "read_tokens", scope: !176, file: !2, line: 898, type: !184)
!318 = !DILocalVariable(name: "ai", scope: !176, file: !2, line: 899, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !86, line: 22, flags: DIFlagFwdDecl)
!321 = !DILocalVariable(name: "stream", scope: !322, file: !2, line: 902, type: !324)
!322 = distinct !DILexicalBlock(scope: !323, file: !2, line: 901, column: 5)
!323 = distinct !DILexicalBlock(scope: !176, file: !2, line: 900, column: 7)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !326, line: 157, baseType: !327)
!326 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !326, line: 126, size: 1216, elements: !328)
!328 = !{!329, !331, !332, !333, !335, !336, !341, !342, !343, !347, !351, !356, !360, !361, !364, !365, !367, !369, !370, !371}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !327, file: !326, line: 127, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !327, file: !326, line: 128, baseType: !61, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !327, file: !326, line: 129, baseType: !61, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !327, file: !326, line: 130, baseType: !334, size: 16, offset: 128)
!334 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !327, file: !326, line: 131, baseType: !334, size: 16, offset: 144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !327, file: !326, line: 132, baseType: !337, size: 128, offset: 192)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !326, line: 92, size: 128, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !337, file: !326, line: 93, baseType: !330, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !337, file: !326, line: 94, baseType: !61, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !327, file: !326, line: 133, baseType: !61, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !327, file: !326, line: 136, baseType: !104, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !327, file: !326, line: 137, baseType: !344, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!61, !104}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !327, file: !326, line: 138, baseType: !348, size: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!61, !104, !107, !61}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !327, file: !326, line: 139, baseType: !352, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !104, !355, !61}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !326, line: 81, baseType: !241)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !327, file: !326, line: 140, baseType: !357, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!61, !104, !102, !61}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !327, file: !326, line: 143, baseType: !337, size: 128, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !327, file: !326, line: 144, baseType: !362, size: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !326, line: 98, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !327, file: !326, line: 145, baseType: !61, size: 32, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !327, file: !326, line: 148, baseType: !366, size: 24, offset: 928)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 24, elements: !42)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !327, file: !326, line: 149, baseType: !368, size: 8, offset: 952)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 8, elements: !47)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !327, file: !326, line: 152, baseType: !337, size: 128, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !327, file: !326, line: 155, baseType: !61, size: 32, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !327, file: !326, line: 156, baseType: !355, size: 64, offset: 1152)
!372 = !DILocalVariable(name: "st", scope: !322, file: !2, line: 926, type: !195)
!373 = !DILocalVariable(name: "i", scope: !374, file: !2, line: 965, type: !61)
!374 = distinct !DILexicalBlock(scope: !176, file: !2, line: 965, column: 3)
!375 = !DILocalVariable(name: "skip_file", scope: !376, file: !2, line: 967, type: !184)
!376 = distinct !DILexicalBlock(scope: !377, file: !2, line: 966, column: 5)
!377 = distinct !DILexicalBlock(scope: !374, file: !2, line: 965, column: 3)
!378 = !DILocalVariable(name: "ai_err", scope: !376, file: !2, line: 968, type: !85)
!379 = !DILocalVariable(name: "file_name", scope: !376, file: !2, line: 969, type: !107)
!380 = !DILocalVariable(name: "file_number", scope: !381, file: !2, line: 1010, type: !112)
!381 = distinct !DILexicalBlock(scope: !382, file: !2, line: 1006, column: 13)
!382 = distinct !DILexicalBlock(scope: !383, file: !2, line: 1003, column: 15)
!383 = distinct !DILexicalBlock(scope: !384, file: !2, line: 998, column: 9)
!384 = distinct !DILexicalBlock(scope: !376, file: !2, line: 997, column: 11)
!385 = !DILabel(scope: !176, name: "argv_iter_done", file: !2, line: 1025)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !47)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 977, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 15)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 984, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 40, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 5)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 984, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !395)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 984, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 40)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 991, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 63)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1004, type: !41, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1004, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 30)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1011, type: !137, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1042, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 12)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1048, type: !421, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !144, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1060, type: !421, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1066, type: !122, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "debug", scope: !51, file: !2, line: 73, type: !184, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "total_lines", scope: !51, file: !2, line: 77, type: !436, isLocal: true, isDefinition: true)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !437, line: 32, baseType: !112)
!437 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "total_words", scope: !51, file: !2, line: 78, type: !436, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "total_chars", scope: !51, file: !2, line: 79, type: !436, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "total_bytes", scope: !51, file: !2, line: 80, type: !436, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !51, file: !2, line: 81, type: !436, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !51, file: !2, line: 82, type: !436, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !51, file: !2, line: 83, type: !436, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !51, file: !2, line: 84, type: !436, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "max_line_length", scope: !51, file: !2, line: 85, type: !436, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "print_lines", scope: !51, file: !2, line: 88, type: !184, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "print_words", scope: !51, file: !2, line: 88, type: !184, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "print_chars", scope: !51, file: !2, line: 88, type: !184, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "print_bytes", scope: !51, file: !2, line: 88, type: !184, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "print_linelength", scope: !51, file: !2, line: 89, type: !184, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "number_width", scope: !51, file: !2, line: 92, type: !61, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !51, file: !2, line: 95, type: !184, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !51, file: !2, line: 101, type: !184, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !60, line: 579, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 56)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !60, line: 660, type: !159, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !60, line: 660, type: !117, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !60, line: 661, type: !481, isLocal: true, isDefinition: true)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 10)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !60, line: 661, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 22)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !60, line: 662, type: !481, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !60, line: 662, type: !389, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !60, line: 663, type: !481, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !60, line: 664, type: !481, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !60, line: 665, type: !481, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !60, line: 678, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 23)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !60, line: 678, type: !402, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !60, line: 683, type: !149, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !60, line: 689, type: !9, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !60, line: 695, type: !399, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !60, line: 696, type: !166, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !60, line: 698, type: !516, isLocal: true, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 51)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !60, line: 699, type: !421, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !122, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !122, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !122, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !122, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 129, type: !122, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !421, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !117, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !399, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !127, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "longopts", scope: !51, file: !2, line: 123, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 2816, elements: !138)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !544, line: 50, size: 256, elements: !545)
!544 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!545 = !{!546, !547, !548, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !543, file: !544, line: 52, baseType: !102, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !543, file: !544, line: 55, baseType: !61, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !544, line: 56, baseType: !549, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !544, line: 57, baseType: !61, size: 32, offset: 192)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "total_types", scope: !51, file: !2, line: 149, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 128, elements: !150)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !399, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 7)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !399, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !122, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "total_args", scope: !51, file: !2, line: 145, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 320, elements: !395)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "total_mode", scope: !51, file: !2, line: 154, type: !79, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !389, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 20)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 26)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 203, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 28)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "wc_lines_p", scope: !51, file: !2, line: 70, type: !591, isLocal: true, isDefinition: true)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!184, !102, !61, !594, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !597, file: !2, line: 281, type: !394, isLocal: true, isDefinition: true)
!597 = distinct !DISubprogram(name: "write_counts", scope: !2, file: !2, line: 274, type: !598, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !436, !436, !436, !436, !436, !102}
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608}
!601 = !DILocalVariable(name: "lines", arg: 1, scope: !597, file: !2, line: 274, type: !436)
!602 = !DILocalVariable(name: "words", arg: 2, scope: !597, file: !2, line: 275, type: !436)
!603 = !DILocalVariable(name: "chars", arg: 3, scope: !597, file: !2, line: 276, type: !436)
!604 = !DILocalVariable(name: "bytes", arg: 4, scope: !597, file: !2, line: 277, type: !436)
!605 = !DILocalVariable(name: "linelength", arg: 5, scope: !597, file: !2, line: 278, type: !436)
!606 = !DILocalVariable(name: "file", arg: 6, scope: !597, file: !2, line: 279, type: !102)
!607 = !DILocalVariable(name: "format_int", scope: !597, file: !2, line: 282, type: !102)
!608 = !DILocalVariable(name: "buf", scope: !597, file: !2, line: 283, type: !609)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 21)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !149, isLocal: true, isDefinition: true)
!614 = !{!"Homebrew clang version 16.0.4"}
!615 = !{i32 7, !"Dwarf Version", i32 4}
!616 = !{i32 2, !"Debug Info Version", i32 3}
!617 = !{i32 1, !"wchar_size", i32 4}
!618 = !{i32 8, !"PIC Level", i32 2}
!619 = !{i32 7, !"uwtable", i32 2}
!620 = !{i32 7, !"frame-pointer", i32 2}
!621 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 210, type: !622, scopeLine: 211, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !61}
!624 = !{!625}
!625 = !DILocalVariable(name: "status", arg: 1, scope: !621, file: !2, line: 210, type: !61)
!626 = !DILocation(line: 0, scope: !621)
!627 = !DILocation(line: 212, column: 14, scope: !628)
!628 = distinct !DILexicalBlock(scope: !621, file: !2, line: 212, column: 7)
!629 = !DILocation(line: 212, column: 7, scope: !621)
!630 = !DILocation(line: 213, column: 5, scope: !628)
!631 = !DILocation(line: 213, column: 5, scope: !632)
!632 = distinct !DILexicalBlock(scope: !628, file: !2, line: 213, column: 5)
!633 = !{!634, !634, i64 0}
!634 = !{!"any pointer", !635, i64 0}
!635 = !{!"omnipotent char", !636, i64 0}
!636 = !{!"Simple C/C++ TBAA"}
!637 = !DILocation(line: 220, column: 15, scope: !638)
!638 = distinct !DILexicalBlock(scope: !628, file: !2, line: 215, column: 5)
!639 = !DILocation(line: 220, column: 29, scope: !638)
!640 = !DILocation(line: 216, column: 7, scope: !638)
!641 = !DILocation(line: 225, column: 5, scope: !638)
!642 = !DILocation(line: 221, column: 7, scope: !638)
!643 = !DILocation(line: 227, column: 7, scope: !638)
!644 = !DILocation(line: 236, column: 5, scope: !638)
!645 = !DILocation(line: 229, column: 7, scope: !638)
!646 = !DILocation(line: 243, column: 5, scope: !638)
!647 = !DILocation(line: 237, column: 7, scope: !638)
!648 = !DILocation(line: 247, column: 5, scope: !638)
!649 = !DILocation(line: 244, column: 7, scope: !638)
!650 = !DILocation(line: 248, column: 39, scope: !638)
!651 = !DILocation(line: 248, column: 7, scope: !638)
!652 = !DILocation(line: 249, column: 42, scope: !638)
!653 = !DILocation(line: 249, column: 7, scope: !638)
!654 = !DILocation(line: 250, column: 7, scope: !638)
!655 = !DILocation(line: 252, column: 3, scope: !621)
!656 = !DISubprogram(name: "fprintf", scope: !657, file: !657, line: 155, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!657 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!658 = !DISubroutineType(types: !659)
!659 = !{!61, !660, !661, null}
!660 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !324)
!661 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !102)
!662 = !{}
!663 = !DISubprogram(name: "printf", scope: !657, file: !657, line: 175, type: !664, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!664 = !DISubroutineType(types: !665)
!665 = !{!61, !661, null}
!666 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !657, file: !657, line: 157, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!667 = !DISubroutineType(types: !668)
!668 = !{!61, !661, !660}
!669 = distinct !DISubprogram(name: "emit_stdin_note", scope: !60, file: !60, line: 577, type: !670, scopeLine: 578, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !662)
!670 = !DISubroutineType(types: !671)
!671 = !{null}
!672 = !DILocation(line: 581, column: 5, scope: !669)
!673 = !DILocation(line: 579, column: 3, scope: !669)
!674 = !DILocation(line: 582, column: 1, scope: !669)
!675 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !60, file: !60, line: 657, type: !676, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !51, retainedNodes: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !102}
!678 = !{!679, !680, !687, !688, !690, !691}
!679 = !DILocalVariable(name: "program", arg: 1, scope: !675, file: !60, line: 657, type: !102)
!680 = !DILocalVariable(name: "infomap", scope: !675, file: !60, line: 659, type: !681)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 896, elements: !560)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !675, file: !60, line: 659, size: 128, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !683, file: !60, line: 659, baseType: !102, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !683, file: !60, line: 659, baseType: !102, size: 64, offset: 64)
!687 = !DILocalVariable(name: "node", scope: !675, file: !60, line: 669, type: !102)
!688 = !DILocalVariable(name: "map_prog", scope: !675, file: !60, line: 670, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!690 = !DILocalVariable(name: "lc_messages", scope: !675, file: !60, line: 682, type: !102)
!691 = !DILocalVariable(name: "url_program", scope: !675, file: !60, line: 695, type: !102)
!692 = !DILocation(line: 0, scope: !675)
!693 = !DILocation(line: 659, column: 3, scope: !675)
!694 = !DILocation(line: 659, column: 67, scope: !675)
!695 = !DILocation(line: 670, column: 36, scope: !675)
!696 = !DILocation(line: 672, column: 3, scope: !675)
!697 = !DILocation(line: 672, column: 20, scope: !675)
!698 = !{!699, !634, i64 0}
!699 = !{!"infomap", !634, i64 0, !634, i64 8}
!700 = !DILocation(line: 672, column: 10, scope: !675)
!701 = !DILocation(line: 672, column: 28, scope: !675)
!702 = !DILocation(line: 672, column: 33, scope: !675)
!703 = !DILocation(line: 672, column: 31, scope: !675)
!704 = !DILocation(line: 673, column: 13, scope: !675)
!705 = distinct !{!705, !696, !704, !706, !707}
!706 = !{!"llvm.loop.mustprogress"}
!707 = !{!"llvm.loop.unroll.disable"}
!708 = !DILocation(line: 675, column: 17, scope: !709)
!709 = distinct !DILexicalBlock(scope: !675, file: !60, line: 675, column: 7)
!710 = !{!699, !634, i64 8}
!711 = !DILocation(line: 675, column: 7, scope: !709)
!712 = !DILocation(line: 675, column: 7, scope: !675)
!713 = !DILocation(line: 676, column: 22, scope: !709)
!714 = !DILocation(line: 676, column: 5, scope: !709)
!715 = !DILocation(line: 678, column: 3, scope: !675)
!716 = !DILocation(line: 682, column: 29, scope: !675)
!717 = !DILocation(line: 683, column: 7, scope: !718)
!718 = distinct !DILexicalBlock(scope: !675, file: !60, line: 683, column: 7)
!719 = !DILocation(line: 683, column: 19, scope: !718)
!720 = !DILocation(line: 683, column: 22, scope: !718)
!721 = !DILocation(line: 683, column: 7, scope: !675)
!722 = !DILocation(line: 690, column: 61, scope: !723)
!723 = distinct !DILexicalBlock(scope: !718, file: !60, line: 684, column: 5)
!724 = !DILocation(line: 689, column: 7, scope: !723)
!725 = !DILocation(line: 691, column: 5, scope: !723)
!726 = !DILocation(line: 695, column: 29, scope: !675)
!727 = !DILocation(line: 696, column: 3, scope: !675)
!728 = !DILocation(line: 699, column: 22, scope: !675)
!729 = !DILocation(line: 699, column: 17, scope: !675)
!730 = !DILocation(line: 698, column: 3, scope: !675)
!731 = !DILocation(line: 700, column: 1, scope: !675)
!732 = !DISubprogram(name: "exit", scope: !733, file: !733, line: 145, type: !622, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !662)
!733 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!734 = !DISubprogram(name: "strcmp", scope: !735, file: !735, line: 77, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!735 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!736 = !DISubroutineType(types: !737)
!737 = !{!61, !102, !102}
!738 = !DISubprogram(name: "setlocale", scope: !739, file: !739, line: 53, type: !740, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!739 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!740 = !DISubroutineType(types: !741)
!741 = !{!107, !61, !102}
!742 = !DISubprogram(name: "strncmp", scope: !735, file: !735, line: 84, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !662)
!743 = !DISubroutineType(types: !744)
!744 = !{!61, !102, !102, !108}
!745 = !DILocation(line: 0, scope: !176)
!746 = !DILocation(line: 830, column: 3, scope: !176)
