; ModuleID = 'coreutils-9.3/build/src/yes.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.infomap = type { ptr, ptr }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [STRING]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [65 x i8] c"Repeatedly output a line with all specified STRING(s), or 'y'.\0A\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [48 x i8] c"      --help        display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [57 x i8] c"      --version     output version information and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [4 x i8] c"yes\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32
@.str.7 = private unnamed_addr constant [14 x i8] c"GNU coreutils\00", align 1, !dbg !37
@Version = external global ptr, align 8
@.str.8 = private unnamed_addr constant [16 x i8] c"David MacKenzie\00", align 1, !dbg !42
@rpl_optind = external global i32, align 4

!86 = !DISubrange(count: 23)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !56, line: 678, type: !9, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !56, line: 683, type: !29, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !56, line: 689, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 71)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !56, line: 695, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 5)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !56, line: 696, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 27)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !56, line: 698, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 51)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !56, line: 699, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 12)
!116 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !117, globals: !122, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!117 = !{!118, !120, !121}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!122 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !54, !57, !59, !64, !69, !71, !76, !78, !80, !82, !87, !89, !91, !96, !101, !106, !111}
!123 = !{!"Homebrew clang version 16.0.4"}
!124 = !{i32 7, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{i32 1, !"wchar_size", i32 4}
!127 = !{i32 8, !"PIC Level", i32 2}
!128 = !{i32 7, !"uwtable", i32 2}
!129 = !{i32 7, !"frame-pointer", i32 2}
!130 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 35, type: !131, scopeLine: 36, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !134)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !{!135}
!135 = !DILocalVariable(name: "status", arg: 1, scope: !130, file: !2, line: 35, type: !133)
!136 = !DILocation(line: 0, scope: !130)
!137 = !DILocation(line: 37, column: 14, scope: !138)
!138 = distinct !DILexicalBlock(scope: !130, file: !2, line: 37, column: 7)
!139 = !DILocation(line: 37, column: 7, scope: !130)
!140 = !DILocation(line: 38, column: 5, scope: !138)
!141 = !DILocation(line: 38, column: 5, scope: !142)
!142 = distinct !DILexicalBlock(scope: !138, file: !2, line: 38, column: 5)
!143 = !{!144, !144, i64 0}
!144 = !{!"any pointer", !145, i64 0}
!145 = !{!"omnipotent char", !146, i64 0}
!146 = !{!"Simple C/C++ TBAA"}
!147 = !DILocation(line: 45, column: 15, scope: !148)
!148 = distinct !DILexicalBlock(scope: !138, file: !2, line: 40, column: 5)
!149 = !DILocation(line: 45, column: 29, scope: !148)
!150 = !DILocation(line: 41, column: 7, scope: !148)
!151 = !DILocation(line: 50, column: 5, scope: !148)
!152 = !DILocation(line: 47, column: 7, scope: !148)
!153 = !DILocation(line: 51, column: 39, scope: !148)
!154 = !DILocation(line: 51, column: 7, scope: !148)
!155 = !DILocation(line: 52, column: 42, scope: !148)
!156 = !DILocation(line: 52, column: 7, scope: !148)
!157 = !DILocation(line: 53, column: 7, scope: !148)
!158 = !DILocation(line: 55, column: 3, scope: !130)
!159 = !DISubprogram(name: "fprintf", scope: !160, file: !160, line: 155, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!160 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!161 = !DISubroutineType(types: !162)
!162 = !{!133, !163, !220, null}
!163 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !166, line: 157, baseType: !167)
!166 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !166, line: 126, size: 1216, elements: !168)
!168 = !{!169, !172, !173, !174, !176, !177, !182, !183, !184, !188, !192, !202, !206, !207, !210, !211, !215, !217, !218, !219}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !167, file: !166, line: 127, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !167, file: !166, line: 128, baseType: !133, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !167, file: !166, line: 129, baseType: !133, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !167, file: !166, line: 130, baseType: !175, size: 16, offset: 128)
!175 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !167, file: !166, line: 131, baseType: !175, size: 16, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !167, file: !166, line: 132, baseType: !178, size: 128, offset: 192)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !166, line: 92, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !178, file: !166, line: 93, baseType: !170, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !178, file: !166, line: 94, baseType: !133, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !167, file: !166, line: 133, baseType: !133, size: 32, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !167, file: !166, line: 136, baseType: !120, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !167, file: !166, line: 137, baseType: !185, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!133, !120}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !167, file: !166, line: 138, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!133, !120, !121, !133}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !167, file: !166, line: 139, baseType: !193, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !120, !196, !133}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !166, line: 81, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !198, line: 71, baseType: !199)
!198 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !200, line: 48, baseType: !201)
!200 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!201 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !167, file: !166, line: 140, baseType: !203, size: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!133, !120, !118, !133}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !167, file: !166, line: 143, baseType: !178, size: 128, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !167, file: !166, line: 144, baseType: !208, size: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !166, line: 98, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !167, file: !166, line: 145, baseType: !133, size: 32, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !167, file: !166, line: 148, baseType: !212, size: 24, offset: 928)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 24, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !167, file: !166, line: 149, baseType: !216, size: 8, offset: 952)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 8, elements: !35)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !167, file: !166, line: 152, baseType: !178, size: 128, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !167, file: !166, line: 155, baseType: !133, size: 32, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !167, file: !166, line: 156, baseType: !196, size: 64, offset: 1152)
!220 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !118)
!221 = !{}
!222 = !DISubprogram(name: "printf", scope: !160, file: !160, line: 175, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!223 = !DISubroutineType(types: !224)
!224 = !{!133, !220, null}
!225 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !160, file: !160, line: 157, type: !226, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!226 = !DISubroutineType(types: !227)
!227 = !{!133, !220, !163}
!228 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !56, file: !56, line: 657, type: !229, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !116, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !118}
!231 = !{!232, !233, !242, !243, !245, !246}
!232 = !DILocalVariable(name: "program", arg: 1, scope: !228, file: !56, line: 657, type: !118)
!233 = !DILocalVariable(name: "infomap", scope: !228, file: !56, line: 659, type: !234)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 896, elements: !240)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !228, file: !56, line: 659, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !236, file: !56, line: 659, baseType: !118, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !236, file: !56, line: 659, baseType: !118, size: 64, offset: 64)
!240 = !{!241}
!241 = !DISubrange(count: 7)
!242 = !DILocalVariable(name: "node", scope: !228, file: !56, line: 669, type: !118)
!243 = !DILocalVariable(name: "map_prog", scope: !228, file: !56, line: 670, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!245 = !DILocalVariable(name: "lc_messages", scope: !228, file: !56, line: 682, type: !118)
!246 = !DILocalVariable(name: "url_program", scope: !228, file: !56, line: 695, type: !118)
!247 = !DILocation(line: 0, scope: !228)
!248 = !DILocation(line: 659, column: 3, scope: !228)
!249 = !DILocation(line: 659, column: 67, scope: !228)
!250 = !DILocation(line: 670, column: 36, scope: !228)
!251 = !DILocation(line: 672, column: 3, scope: !228)
!252 = !DILocation(line: 672, column: 20, scope: !228)
!253 = !{!254, !144, i64 0}
!254 = !{!"infomap", !144, i64 0, !144, i64 8}
!255 = !DILocation(line: 672, column: 10, scope: !228)
!256 = !DILocation(line: 672, column: 28, scope: !228)
!257 = !DILocation(line: 672, column: 33, scope: !228)
!258 = !DILocation(line: 672, column: 31, scope: !228)
!259 = !DILocation(line: 673, column: 13, scope: !228)
!260 = distinct !{!260, !251, !259, !261, !262}
!261 = !{!"llvm.loop.mustprogress"}
!262 = !{!"llvm.loop.unroll.disable"}
!263 = !DILocation(line: 675, column: 17, scope: !264)
!264 = distinct !DILexicalBlock(scope: !228, file: !56, line: 675, column: 7)
!265 = !{!254, !144, i64 8}
!266 = !DILocation(line: 675, column: 7, scope: !264)
!267 = !DILocation(line: 675, column: 7, scope: !228)
!268 = !DILocation(line: 676, column: 22, scope: !264)
!269 = !DILocation(line: 676, column: 5, scope: !264)
!270 = !DILocation(line: 678, column: 3, scope: !228)
!271 = !DILocation(line: 682, column: 29, scope: !228)
!272 = !DILocation(line: 683, column: 7, scope: !273)
!273 = distinct !DILexicalBlock(scope: !228, file: !56, line: 683, column: 7)
!274 = !DILocation(line: 683, column: 19, scope: !273)
!275 = !DILocation(line: 683, column: 22, scope: !273)
!276 = !DILocation(line: 683, column: 7, scope: !228)
!277 = !DILocation(line: 690, column: 61, scope: !278)
!278 = distinct !DILexicalBlock(scope: !273, file: !56, line: 684, column: 5)
!279 = !DILocation(line: 689, column: 7, scope: !278)
!280 = !DILocation(line: 691, column: 5, scope: !278)
!281 = !DILocation(line: 695, column: 29, scope: !228)
!282 = !DILocation(line: 696, column: 3, scope: !228)
!283 = !DILocation(line: 699, column: 22, scope: !228)
!284 = !DILocation(line: 699, column: 17, scope: !228)
!285 = !DILocation(line: 698, column: 3, scope: !228)
!286 = !DILocation(line: 700, column: 1, scope: !228)
!287 = !DISubprogram(name: "exit", scope: !288, file: !288, line: 145, type: !131, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !221)
!288 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!289 = !DISubprogram(name: "strcmp", scope: !290, file: !290, line: 77, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!290 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!291 = !DISubroutineType(types: !292)
!292 = !{!133, !118, !118}
!293 = !DISubprogram(name: "setlocale", scope: !294, file: !294, line: 53, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!294 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!295 = !DISubroutineType(types: !296)
!296 = !{!121, !133, !118}
!297 = !DISubprogram(name: "strncmp", scope: !290, file: !290, line: 84, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !221)
!298 = !DISubroutineType(types: !299)
!299 = !{!133, !118, !118, !300}
