; ModuleID = 'coreutils-9.3/build/src/chmod.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.dev_ino = type { i64, i32 }
%struct.infomap = type { ptr, ptr }
%struct.change_status = type { i32, i16, i16 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.FTS = type { ptr, ptr, ptr, i32, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [135 x i8] c"Usage: %s [OPTION]... MODE[,MODE]... FILE...\0A  or:  %s [OPTION]... OCTAL-MODE FILE...\0A  or:  %s [OPTION]... --reference=RFILE FILE...\0A\00", align 1, !dbg !7

!15 = !{!16}
!16 = !DISubrange(count: 105)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1608, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 201)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 128)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 395, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1216, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 152)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 399, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 67)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 48)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 57)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 404, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 75)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 6)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 429, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 1)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !64, file: !2, line: 84, type: !181, isLocal: true, isDefinition: true)
!64 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !65, retainedTypes: !116, globals: !121, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!65 = !{!66, !72, !77, !83, !97}
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 95, baseType: !67, size: 32, elements: !68)
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "NO_PRESERVE_ROOT", value: 128)
!70 = !DIEnumerator(name: "PRESERVE_ROOT", value: 129)
!71 = !DIEnumerator(name: "REFERENCE_FILE_OPTION", value: 130)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !2, line: 57, baseType: !67, size: 32, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "V_high", value: 0)
!75 = !DIEnumerator(name: "V_changes_only", value: 1)
!76 = !DIEnumerator(name: "V_off", value: 2)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 332, baseType: !79, size: 32, elements: !80)
!78 = !DIFile(filename: "../src/system.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !{!81, !82}
!81 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -130)
!82 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -131)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !84, line: 32, baseType: !67, size: 32, elements: !85)
!84 = !DIFile(filename: "../lib/quotearg.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!87 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!88 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!89 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!90 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!91 = !DIEnumerator(name: "c_quoting_style", value: 5)
!92 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!93 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!94 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!95 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!96 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !98, file: !2, line: 44, baseType: !67, size: 32, elements: !110)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "change_status", file: !2, line: 42, size: 64, elements: !99)
!99 = !{!100, !101, !109}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !98, file: !2, line: 52, baseType: !97, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "old_mode", scope: !98, file: !2, line: 53, baseType: !102, size: 16, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !103, line: 31, baseType: !104)
!103 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !105, line: 70, baseType: !106)
!105 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !107, line: 45, baseType: !108)
!107 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!108 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "new_mode", scope: !98, file: !2, line: 54, baseType: !102, size: 16, offset: 48)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "CH_NO_STAT", value: 0)
!112 = !DIEnumerator(name: "CH_FAILED", value: 1)
!113 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 2)
!114 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!115 = !DIEnumerator(name: "CH_SUCCEEDED", value: 4)
!116 = !{!117, !119, !120}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !122, !127, !132, !137, !142, !147, !149, !154, !159, !164, !207, !212, !217, !219, !221, !62, !223, !226, !228, !230, !235, !240, !242, !247, !249, !251, !253, !258, !263, !268, !273, !278, !283, !288, !293, !298, !300, !302, !304, !306, !308, !313, !315, !317, !319, !333, !335, !337, !339, !341, !346, !348, !353, !358, !363, !368, !373, !375, !380, !385, !390, !395, !400, !405}
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !2, line: 438, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 68)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 508, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 14)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 508, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 16)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !2, line: 508, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 13)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 518, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 44)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 531, type: !134, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 533, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 25)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 541, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 31)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 17)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !166, file: !2, line: 557, type: !192, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 417, type: !167, scopeLine: 418, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !170)
!167 = !DISubroutineType(types: !168)
!168 = !{!79, !79, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!170 = !{!171, !172, !173, !174, !179, !180, !182, !183, !184, !185, !189, !190, !191}
!171 = !DILocalVariable(name: "argc", arg: 1, scope: !166, file: !2, line: 417, type: !79)
!172 = !DILocalVariable(name: "argv", arg: 2, scope: !166, file: !2, line: 417, type: !169)
!173 = !DILocalVariable(name: "mode", scope: !166, file: !2, line: 419, type: !119)
!174 = !DILocalVariable(name: "mode_len", scope: !166, file: !2, line: 420, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !176, line: 31, baseType: !177)
!176 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !107, line: 94, baseType: !178)
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DILocalVariable(name: "mode_alloc", scope: !166, file: !2, line: 421, type: !175)
!180 = !DILocalVariable(name: "ok", scope: !166, file: !2, line: 422, type: !181)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DILocalVariable(name: "preserve_root", scope: !166, file: !2, line: 423, type: !181)
!183 = !DILocalVariable(name: "reference_file", scope: !166, file: !2, line: 424, type: !117)
!184 = !DILocalVariable(name: "c", scope: !166, file: !2, line: 425, type: !79)
!185 = !DILocalVariable(name: "arg", scope: !186, file: !2, line: 470, type: !117)
!186 = distinct !DILexicalBlock(scope: !187, file: !2, line: 464, column: 11)
!187 = distinct !DILexicalBlock(scope: !188, file: !2, line: 444, column: 9)
!188 = distinct !DILexicalBlock(scope: !166, file: !2, line: 442, column: 5)
!189 = !DILocalVariable(name: "arg_len", scope: !186, file: !2, line: 471, type: !175)
!190 = !DILocalVariable(name: "mode_comma_len", scope: !186, file: !2, line: 472, type: !175)
!191 = !DILocalVariable(name: "new_mode_len", scope: !186, file: !2, line: 473, type: !175)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !193, line: 25, size: 128, elements: !194)
!193 = !DIFile(filename: "../lib/dev-ino.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!194 = !{!195, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !192, file: !193, line: 27, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !197, line: 31, baseType: !198)
!197 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_ino_t.h", directory: "")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !105, line: 64, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !105, line: 62, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !107, line: 49, baseType: !201)
!201 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !192, file: !193, line: 28, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !204, line: 31, baseType: !205)
!204 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !105, line: 57, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !107, line: 46, baseType: !79)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 560, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "change", scope: !64, file: !2, line: 70, type: !214, isLocal: true, isDefinition: true)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !216, line: 25, flags: DIFlagFwdDecl)
!216 = !DIFile(filename: "../lib/modechange.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "umask_value", scope: !64, file: !2, line: 73, type: !102, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "recurse", scope: !64, file: !2, line: 76, type: !181, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "force_silent", scope: !64, file: !2, line: 79, type: !181, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !64, file: !2, line: 91, type: !225, isLocal: true, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !78, line: 660, type: !209, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !78, line: 660, type: !134, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !78, line: 661, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 10)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !78, line: 661, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 22)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !78, line: 662, type: !232, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !78, line: 662, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 15)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !78, line: 663, type: !232, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !78, line: 664, type: !232, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !78, line: 665, type: !232, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !78, line: 678, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 23)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !78, line: 678, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 40)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !78, line: 683, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 4)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !78, line: 689, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 71)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !78, line: 695, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 5)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !78, line: 696, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 27)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !78, line: 698, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 51)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !78, line: 699, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 12)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 8)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !232, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !161, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !129, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !54, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !232, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 7)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !295, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !275, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !295, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "long_options", scope: !64, file: !2, line: 102, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 2816, elements: !331)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !324, line: 50, size: 256, elements: !325)
!324 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!325 = !{!326, !327, !328, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !324, line: 52, baseType: !117, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !323, file: !324, line: 55, baseType: !79, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 56, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !323, file: !324, line: 57, baseType: !79, size: 32, offset: 192)
!331 = !{!332}
!332 = !DISubrange(count: 11)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "verbosity", scope: !64, file: !2, line: 87, type: !72, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !134, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !161, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !161, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 3)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 243, type: !151, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 249, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 38)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 186)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 45)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 58)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 49)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !280, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 35)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 29)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 56)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 26)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 50)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 59)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !377, isLocal: true, isDefinition: true)
!407 = !{!"Homebrew clang version 16.0.4"}
!408 = !{i32 7, !"Dwarf Version", i32 4}
!409 = !{i32 2, !"Debug Info Version", i32 3}
!410 = !{i32 1, !"wchar_size", i32 4}
!411 = !{i32 8, !"PIC Level", i32 2}
!412 = !{i32 7, !"uwtable", i32 2}
!413 = !{i32 7, !"frame-pointer", i32 2}
!414 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 369, type: !415, scopeLine: 370, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !79}
!417 = !{!418}
!418 = !DILocalVariable(name: "status", arg: 1, scope: !414, file: !2, line: 369, type: !79)
!419 = !DILocation(line: 0, scope: !414)
!420 = !DILocation(line: 371, column: 14, scope: !421)
!421 = distinct !DILexicalBlock(scope: !414, file: !2, line: 371, column: 7)
!422 = !DILocation(line: 371, column: 7, scope: !414)
!423 = !DILocation(line: 372, column: 5, scope: !421)
!424 = !DILocation(line: 372, column: 5, scope: !425)
!425 = distinct !DILexicalBlock(scope: !421, file: !2, line: 372, column: 5)
!426 = !{!427, !427, i64 0}
!427 = !{!"any pointer", !428, i64 0}
!428 = !{!"omnipotent char", !429, i64 0}
!429 = !{!"Simple C/C++ TBAA"}
!430 = !DILocation(line: 380, column: 15, scope: !431)
!431 = distinct !DILexicalBlock(scope: !421, file: !2, line: 374, column: 5)
!432 = !DILocation(line: 380, column: 29, scope: !431)
!433 = !DILocation(line: 380, column: 43, scope: !431)
!434 = !DILocation(line: 375, column: 7, scope: !431)
!435 = !DILocation(line: 385, column: 5, scope: !431)
!436 = !DILocation(line: 381, column: 7, scope: !431)
!437 = !DILocation(line: 390, column: 5, scope: !431)
!438 = !DILocation(line: 386, column: 7, scope: !431)
!439 = !DILocation(line: 394, column: 5, scope: !431)
!440 = !DILocation(line: 391, column: 7, scope: !431)
!441 = !DILocation(line: 398, column: 5, scope: !431)
!442 = !DILocation(line: 395, column: 7, scope: !431)
!443 = !DILocation(line: 401, column: 5, scope: !431)
!444 = !DILocation(line: 399, column: 7, scope: !431)
!445 = !DILocation(line: 402, column: 39, scope: !431)
!446 = !DILocation(line: 402, column: 7, scope: !431)
!447 = !DILocation(line: 403, column: 42, scope: !431)
!448 = !DILocation(line: 403, column: 7, scope: !431)
!449 = !DILocation(line: 407, column: 5, scope: !431)
!450 = !DILocation(line: 404, column: 7, scope: !431)
!451 = !DILocation(line: 408, column: 7, scope: !431)
!452 = !DILocation(line: 410, column: 3, scope: !414)
!453 = !DISubprogram(name: "fprintf", scope: !454, file: !454, line: 155, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!454 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!455 = !DISubroutineType(types: !456)
!456 = !{!79, !457, !510, null}
!457 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !460, line: 157, baseType: !461)
!460 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !460, line: 126, size: 1216, elements: !462)
!462 = !{!463, !466, !467, !468, !470, !471, !476, !477, !478, !482, !486, !494, !498, !499, !502, !503, !505, !507, !508, !509}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !461, file: !460, line: 127, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !461, file: !460, line: 128, baseType: !79, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !461, file: !460, line: 129, baseType: !79, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !461, file: !460, line: 130, baseType: !469, size: 16, offset: 128)
!469 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !461, file: !460, line: 131, baseType: !469, size: 16, offset: 144)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !461, file: !460, line: 132, baseType: !472, size: 128, offset: 192)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !460, line: 92, size: 128, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !472, file: !460, line: 93, baseType: !464, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !472, file: !460, line: 94, baseType: !79, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !461, file: !460, line: 133, baseType: !79, size: 32, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !461, file: !460, line: 136, baseType: !120, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !461, file: !460, line: 137, baseType: !479, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!79, !120}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !461, file: !460, line: 138, baseType: !483, size: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!79, !120, !119, !79}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !461, file: !460, line: 139, baseType: !487, size: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !120, !490, !79}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !460, line: 81, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !105, line: 71, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 48, baseType: !493)
!493 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !461, file: !460, line: 140, baseType: !495, size: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!79, !120, !117, !79}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !461, file: !460, line: 143, baseType: !472, size: 128, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !461, file: !460, line: 144, baseType: !500, size: 64, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !460, line: 98, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !461, file: !460, line: 145, baseType: !79, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !461, file: !460, line: 148, baseType: !504, size: 24, offset: 928)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 24, elements: !344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !461, file: !460, line: 149, baseType: !506, size: 8, offset: 952)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 8, elements: !60)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !461, file: !460, line: 152, baseType: !472, size: 128, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !461, file: !460, line: 155, baseType: !79, size: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !461, file: !460, line: 156, baseType: !490, size: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !117)
!511 = !{}
!512 = !DISubprogram(name: "printf", scope: !454, file: !454, line: 175, type: !513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!513 = !DISubroutineType(types: !514)
!514 = !{!79, !510, null}
!515 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !454, file: !454, line: 157, type: !516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!516 = !DISubroutineType(types: !517)
!517 = !{!79, !510, !457}
!518 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !78, file: !78, line: 657, type: !519, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !117}
!521 = !{!522, !523, !530, !531, !533, !534}
!522 = !DILocalVariable(name: "program", arg: 1, scope: !518, file: !78, line: 657, type: !117)
!523 = !DILocalVariable(name: "infomap", scope: !518, file: !78, line: 659, type: !524)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 896, elements: !311)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !518, file: !78, line: 659, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !526, file: !78, line: 659, baseType: !117, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !526, file: !78, line: 659, baseType: !117, size: 64, offset: 64)
!530 = !DILocalVariable(name: "node", scope: !518, file: !78, line: 669, type: !117)
!531 = !DILocalVariable(name: "map_prog", scope: !518, file: !78, line: 670, type: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!533 = !DILocalVariable(name: "lc_messages", scope: !518, file: !78, line: 682, type: !117)
!534 = !DILocalVariable(name: "url_program", scope: !518, file: !78, line: 695, type: !117)
!535 = !DILocation(line: 0, scope: !518)
!536 = !DILocation(line: 659, column: 3, scope: !518)
!537 = !DILocation(line: 659, column: 67, scope: !518)
!538 = !DILocation(line: 670, column: 36, scope: !518)
!539 = !DILocation(line: 672, column: 3, scope: !518)
!540 = !DILocation(line: 672, column: 20, scope: !518)
!541 = !{!542, !427, i64 0}
!542 = !{!"infomap", !427, i64 0, !427, i64 8}
!543 = !DILocation(line: 672, column: 10, scope: !518)
!544 = !DILocation(line: 672, column: 28, scope: !518)
!545 = !DILocation(line: 672, column: 33, scope: !518)
!546 = !DILocation(line: 672, column: 31, scope: !518)
!547 = !DILocation(line: 673, column: 13, scope: !518)
!548 = distinct !{!548, !539, !547, !549, !550}
!549 = !{!"llvm.loop.mustprogress"}
!550 = !{!"llvm.loop.unroll.disable"}
!551 = !DILocation(line: 675, column: 17, scope: !552)
!552 = distinct !DILexicalBlock(scope: !518, file: !78, line: 675, column: 7)
!553 = !{!542, !427, i64 8}
!554 = !DILocation(line: 675, column: 7, scope: !552)
!555 = !DILocation(line: 675, column: 7, scope: !518)
!556 = !DILocation(line: 676, column: 22, scope: !552)
!557 = !DILocation(line: 676, column: 5, scope: !552)
!558 = !DILocation(line: 678, column: 3, scope: !518)
!559 = !DILocation(line: 682, column: 29, scope: !518)
!560 = !DILocation(line: 683, column: 7, scope: !561)
!561 = distinct !DILexicalBlock(scope: !518, file: !78, line: 683, column: 7)
!562 = !DILocation(line: 683, column: 19, scope: !561)
!563 = !DILocation(line: 683, column: 22, scope: !561)
!564 = !DILocation(line: 683, column: 7, scope: !518)
!565 = !DILocation(line: 690, column: 61, scope: !566)
!566 = distinct !DILexicalBlock(scope: !561, file: !78, line: 684, column: 5)
!567 = !DILocation(line: 689, column: 7, scope: !566)
!568 = !DILocation(line: 691, column: 5, scope: !566)
!569 = !DILocation(line: 695, column: 29, scope: !518)
!570 = !DILocation(line: 696, column: 3, scope: !518)
!571 = !DILocation(line: 699, column: 22, scope: !518)
!572 = !DILocation(line: 699, column: 17, scope: !518)
!573 = !DILocation(line: 698, column: 3, scope: !518)
!574 = !DILocation(line: 700, column: 1, scope: !518)
!575 = !DISubprogram(name: "exit", scope: !576, file: !576, line: 145, type: !415, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !511)
!576 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!577 = !DISubprogram(name: "strcmp", scope: !578, file: !578, line: 77, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!578 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!579 = !DISubroutineType(types: !580)
!580 = !{!79, !117, !117}
!581 = !DISubprogram(name: "setlocale", scope: !582, file: !582, line: 53, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!582 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!583 = !DISubroutineType(types: !584)
!584 = !{!119, !79, !117}
!585 = !DISubprogram(name: "strncmp", scope: !578, file: !578, line: 84, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!586 = !DISubroutineType(types: !587)
!587 = !{!79, !117, !117, !175}
!588 = !DILocation(line: 0, scope: !166)
!589 = !DILocation(line: 421, column: 3, scope: !166)
!590 = !DILocation(line: 421, column: 10, scope: !166)
!591 = !{!592, !592, i64 0}
!592 = !{!"long", !428, i64 0}
!593 = !DILocation(line: 428, column: 21, scope: !166)
!594 = !DILocation(line: 428, column: 3, scope: !166)
!595 = !DILocation(line: 429, column: 3, scope: !166)
!596 = !DILocation(line: 433, column: 3, scope: !166)
!597 = !DILocation(line: 435, column: 47, scope: !166)
!598 = !{!599, !599, i64 0}
!599 = !{!"_Bool", !428, i64 0}
!600 = !DILocation(line: 435, column: 26, scope: !166)
!601 = !DILocation(line: 435, column: 11, scope: !166)
!602 = !DILocation(line: 437, column: 3, scope: !166)
!603 = !DILocation(line: 419, column: 9, scope: !166)
!604 = !DILocation(line: 420, column: 10, scope: !166)
!605 = !DILocation(line: 423, column: 8, scope: !166)
!606 = !DILocation(line: 424, column: 15, scope: !166)
!607 = !DILocation(line: 437, column: 15, scope: !166)
!608 = !DILocation(line: 441, column: 10, scope: !166)
!609 = !DILocation(line: 443, column: 7, scope: !188)
!610 = !DILocation(line: 470, column: 36, scope: !186)
!611 = !{!612, !612, i64 0}
!612 = !{!"int", !428, i64 0}
!613 = !DILocation(line: 470, column: 43, scope: !186)
!614 = !DILocation(line: 470, column: 31, scope: !186)
!615 = !DILocation(line: 0, scope: !186)
!616 = !DILocation(line: 471, column: 30, scope: !186)
!617 = !DILocation(line: 472, column: 49, scope: !186)
!618 = !DILocation(line: 472, column: 48, scope: !186)
!619 = !DILocation(line: 472, column: 46, scope: !186)
!620 = !DILocation(line: 473, column: 50, scope: !186)
!621 = !DILocation(line: 474, column: 17, scope: !622)
!622 = distinct !DILexicalBlock(scope: !186, file: !2, line: 474, column: 17)
!623 = !DILocation(line: 474, column: 28, scope: !622)
!624 = !DILocation(line: 474, column: 17, scope: !186)
!625 = !DILocation(line: 476, column: 43, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !2, line: 475, column: 15)
!627 = !DILocation(line: 476, column: 28, scope: !626)
!628 = !DILocation(line: 477, column: 24, scope: !626)
!629 = !DILocation(line: 478, column: 15, scope: !626)
!630 = !DILocation(line: 479, column: 13, scope: !186)
!631 = !DILocation(line: 479, column: 28, scope: !186)
!632 = !{!428, !428, i64 0}
!633 = !DILocation(line: 480, column: 26, scope: !186)
!634 = !DILocation(line: 480, column: 57, scope: !186)
!635 = !DILocation(line: 480, column: 13, scope: !186)
!636 = !DILocation(line: 483, column: 32, scope: !186)
!637 = !DILocation(line: 485, column: 11, scope: !187)
!638 = !DILocation(line: 488, column: 11, scope: !187)
!639 = !DILocation(line: 491, column: 11, scope: !187)
!640 = !DILocation(line: 493, column: 28, scope: !187)
!641 = !DILocation(line: 494, column: 11, scope: !187)
!642 = !DILocation(line: 496, column: 19, scope: !187)
!643 = !DILocation(line: 497, column: 11, scope: !187)
!644 = !DILocation(line: 499, column: 21, scope: !187)
!645 = !DILocation(line: 500, column: 11, scope: !187)
!646 = !DILocation(line: 502, column: 24, scope: !187)
!647 = !DILocation(line: 503, column: 11, scope: !187)
!648 = !DILocation(line: 505, column: 21, scope: !187)
!649 = !DILocation(line: 506, column: 11, scope: !187)
!650 = !DILocation(line: 507, column: 9, scope: !187)
!651 = !DILocation(line: 508, column: 9, scope: !187)
!652 = !DILocation(line: 510, column: 11, scope: !187)
!653 = distinct !{!653, !602, !654, !549, !550}
!654 = !DILocation(line: 512, column: 5, scope: !166)
!655 = !DILocation(line: 514, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !166, file: !2, line: 514, column: 7)
!657 = !DILocation(line: 514, column: 7, scope: !166)
!658 = !DILocation(line: 516, column: 11, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !2, line: 516, column: 11)
!660 = distinct !DILexicalBlock(scope: !656, file: !2, line: 515, column: 5)
!661 = !DILocation(line: 516, column: 11, scope: !660)
!662 = !DILocation(line: 518, column: 11, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !2, line: 517, column: 9)
!664 = !DILocation(line: 519, column: 11, scope: !663)
!665 = !DILocation(line: 521, column: 5, scope: !660)
!666 = !DILocation(line: 524, column: 12, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !2, line: 524, column: 11)
!668 = distinct !DILexicalBlock(scope: !656, file: !2, line: 523, column: 5)
!669 = !DILocation(line: 524, column: 11, scope: !668)
!670 = !DILocation(line: 525, column: 27, scope: !667)
!671 = !DILocation(line: 525, column: 16, scope: !667)
!672 = !DILocation(line: 525, column: 9, scope: !667)
!673 = !DILocation(line: 528, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !166, file: !2, line: 528, column: 7)
!675 = !DILocation(line: 528, column: 14, scope: !674)
!676 = !DILocation(line: 528, column: 7, scope: !166)
!677 = !DILocation(line: 530, column: 12, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !2, line: 530, column: 11)
!679 = distinct !DILexicalBlock(scope: !674, file: !2, line: 529, column: 5)
!680 = !DILocation(line: 530, column: 17, scope: !678)
!681 = !DILocation(line: 530, column: 33, scope: !678)
!682 = !DILocation(line: 530, column: 40, scope: !678)
!683 = !DILocation(line: 530, column: 28, scope: !678)
!684 = !DILocation(line: 530, column: 25, scope: !678)
!685 = !DILocation(line: 530, column: 11, scope: !679)
!686 = !DILocation(line: 531, column: 9, scope: !678)
!687 = !DILocation(line: 533, column: 70, scope: !678)
!688 = !DILocation(line: 533, column: 60, scope: !678)
!689 = !DILocation(line: 533, column: 53, scope: !678)
!690 = !DILocation(line: 533, column: 9, scope: !678)
!691 = !DILocation(line: 534, column: 7, scope: !679)
!692 = !DILocation(line: 537, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !166, file: !2, line: 537, column: 7)
!694 = !DILocation(line: 537, column: 7, scope: !166)
!695 = !DILocation(line: 539, column: 16, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !2, line: 538, column: 5)
!697 = !DILocation(line: 539, column: 14, scope: !696)
!698 = !DILocation(line: 540, column: 12, scope: !699)
!699 = distinct !DILexicalBlock(scope: !696, file: !2, line: 540, column: 11)
!700 = !DILocation(line: 540, column: 11, scope: !696)
!701 = !DILocation(line: 541, column: 9, scope: !699)
!702 = !DILocation(line: 543, column: 5, scope: !696)
!703 = !DILocation(line: 546, column: 16, scope: !704)
!704 = distinct !DILexicalBlock(scope: !693, file: !2, line: 545, column: 5)
!705 = !DILocation(line: 546, column: 14, scope: !704)
!706 = !DILocation(line: 547, column: 12, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !2, line: 547, column: 11)
!708 = !DILocation(line: 547, column: 11, scope: !704)
!709 = !DILocation(line: 549, column: 47, scope: !710)
!710 = distinct !DILexicalBlock(scope: !707, file: !2, line: 548, column: 9)
!711 = !DILocation(line: 549, column: 11, scope: !710)
!712 = !DILocation(line: 550, column: 11, scope: !710)
!713 = !DILocation(line: 552, column: 21, scope: !704)
!714 = !DILocation(line: 552, column: 19, scope: !704)
!715 = !{!716, !716, i64 0}
!716 = !{!"short", !428, i64 0}
!717 = !DILocation(line: 555, column: 7, scope: !718)
!718 = distinct !DILexicalBlock(scope: !166, file: !2, line: 555, column: 7)
!719 = !{i8 0, i8 2}
!720 = !DILocation(line: 555, column: 15, scope: !718)
!721 = !DILocation(line: 555, column: 18, scope: !718)
!722 = !DILocation(line: 555, column: 7, scope: !166)
!723 = !DILocation(line: 558, column: 22, scope: !724)
!724 = distinct !DILexicalBlock(scope: !718, file: !2, line: 556, column: 5)
!725 = !DILocation(line: 558, column: 20, scope: !724)
!726 = !DILocation(line: 559, column: 11, scope: !727)
!727 = distinct !DILexicalBlock(scope: !724, file: !2, line: 559, column: 11)
!728 = !DILocation(line: 559, column: 24, scope: !727)
!729 = !DILocation(line: 559, column: 11, scope: !724)
!730 = !DILocation(line: 560, column: 9, scope: !727)
!731 = !DILocation(line: 562, column: 5, scope: !724)
!732 = !DILocation(line: 565, column: 20, scope: !733)
!733 = distinct !DILexicalBlock(scope: !718, file: !2, line: 564, column: 5)
!734 = !DILocation(line: 568, column: 30, scope: !166)
!735 = !DILocation(line: 568, column: 28, scope: !166)
!736 = !DILocation(line: 568, column: 8, scope: !166)
!737 = !DILocation(line: 568, column: 6, scope: !166)
!738 = !DILocation(line: 571, column: 3, scope: !166)
!739 = !DILocation(line: 572, column: 1, scope: !166)
!740 = !DISubprogram(name: "set_program_name", scope: !741, file: !741, line: 37, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!741 = !DIFile(filename: "../lib/progname.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!742 = !DISubprogram(name: "atexit", scope: !576, file: !576, line: 133, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!743 = !DISubroutineType(types: !744)
!744 = !{!79, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null}
!748 = !DISubprogram(name: "rpl_getopt_long", scope: !324, file: !324, line: 66, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!749 = !DISubroutineType(types: !750)
!750 = !{!79, !79, !169, !117, !751, !329}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!752 = !DISubprogram(name: "strlen", scope: !578, file: !578, line: 82, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!753 = !DISubroutineType(types: !754)
!754 = !{!178, !117}
!755 = !DISubprogram(name: "x2realloc", scope: !756, file: !756, line: 84, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!756 = !DIFile(filename: "../lib/xalloc.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!757 = !DISubroutineType(types: !758)
!758 = !{!120, !120, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!760 = !DISubprogram(name: "version_etc", scope: !761, file: !761, line: 65, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!761 = !DIFile(filename: "../lib/version-etc.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!762 = !DISubroutineType(types: !763)
!763 = !{null, !458, !117, !117, !117, null}
!764 = !DISubprogram(name: "error", scope: !765, file: !765, line: 395, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!765 = !DIFile(filename: "./lib/error.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!766 = !DISubroutineType(types: !767)
!767 = !{null, !79, !79, !117, null}
!768 = !DISubprogram(name: "quote", scope: !769, file: !769, line: 44, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!769 = !DIFile(filename: "../lib/quote.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!770 = !DISubroutineType(types: !771)
!771 = !{!117, !117}
!772 = !DISubprogram(name: "mode_create_from_ref", scope: !216, file: !216, line: 27, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!773 = !DISubroutineType(types: !774)
!774 = !{!214, !117}
!775 = !DISubprogram(name: "__error", scope: !776, file: !776, line: 80, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!776 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/errno.h", directory: "")
!777 = !DISubroutineType(types: !778)
!778 = !{!329}
!779 = !DISubprogram(name: "quotearg_style", scope: !84, file: !84, line: 383, type: !780, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!780 = !DISubroutineType(types: !781)
!781 = !{!119, !83, !117}
!782 = !DISubprogram(name: "mode_compile", scope: !216, file: !216, line: 25, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!783 = !DISubprogram(name: "umask", scope: !784, file: !784, line: 388, type: !785, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!784 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!785 = !DISubroutineType(types: !786)
!786 = !{!102, !102}
!787 = !DISubprogram(name: "get_root_dev_ino", scope: !788, file: !788, line: 25, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!788 = !DIFile(filename: "../lib/root-dev-ino.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!789 = !DISubroutineType(types: !790)
!790 = !{!225, !225}
!791 = distinct !DISubprogram(name: "process_files", scope: !2, file: !2, line: 333, type: !792, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!181, !169, !79}
!794 = !{!795, !796, !797, !798, !939}
!795 = !DILocalVariable(name: "files", arg: 1, scope: !791, file: !2, line: 333, type: !169)
!796 = !DILocalVariable(name: "bit_flags", arg: 2, scope: !791, file: !2, line: 333, type: !79)
!797 = !DILocalVariable(name: "ok", scope: !791, file: !2, line: 335, type: !181)
!798 = !DILocalVariable(name: "fts", scope: !791, file: !2, line: 337, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !801, line: 197, baseType: !802)
!801 = !DIFile(filename: "../lib/fts_.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !801, line: 80, size: 1024, elements: !803)
!803 = !{!804, !901, !902, !904, !905, !906, !907, !908, !909, !910, !917, !918, !921, !928}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !802, file: !801, line: 81, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !801, line: 199, size: 2048, elements: !807)
!807 = !{!808, !809, !810, !811, !836, !837, !838, !839, !840, !841, !842, !843, !844, !847, !848, !849, !850, !851, !897}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !806, file: !801, line: 200, baseType: !805, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !806, file: !801, line: 201, baseType: !805, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !806, file: !801, line: 202, baseType: !805, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !806, file: !801, line: 203, baseType: !812, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !814, line: 84, baseType: !815)
!814 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/dirent.h", directory: "")
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 73, size: 1088, elements: !816)
!816 = !{!817, !818, !820, !821, !822, !823, !824, !825, !826, !833}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_fd", scope: !815, file: !814, line: 74, baseType: !79, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_loc", scope: !815, file: !814, line: 75, baseType: !819, size: 64, offset: 64)
!819 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_size", scope: !815, file: !814, line: 76, baseType: !819, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_buf", scope: !815, file: !814, line: 77, baseType: !119, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_len", scope: !815, file: !814, line: 78, baseType: !79, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_seek", scope: !815, file: !814, line: 79, baseType: !819, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__padding", scope: !815, file: !814, line: 80, baseType: !819, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_flags", scope: !815, file: !814, line: 81, baseType: !79, size: 32, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_lock", scope: !815, file: !814, line: 82, baseType: !827, size: 512, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_pthread_mutex_t", file: !828, line: 113, baseType: !829)
!828 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_pthread/_pthread_types.h", directory: "")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_opaque_pthread_mutex_t", file: !828, line: 78, size: 512, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__sig", scope: !829, file: !828, line: 79, baseType: !819, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !829, file: !828, line: 80, baseType: !387, size: 448, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__dd_td", scope: !815, file: !814, line: 83, baseType: !834, size: 64, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "_telldir", file: !814, line: 70, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !806, file: !801, line: 206, baseType: !819, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !806, file: !801, line: 207, baseType: !120, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !806, file: !801, line: 208, baseType: !119, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !806, file: !801, line: 209, baseType: !119, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !806, file: !801, line: 210, baseType: !79, size: 32, offset: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !806, file: !801, line: 211, baseType: !79, size: 32, offset: 544)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !806, file: !801, line: 212, baseType: !175, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !806, file: !801, line: 214, baseType: !799, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !806, file: !801, line: 218, baseType: !845, size: 64, offset: 704)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !846, line: 35, baseType: !819)
!846 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stddef.h", directory: "")
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !806, file: !801, line: 220, baseType: !175, size: 64, offset: 768)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !806, file: !801, line: 236, baseType: !108, size: 16, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !806, file: !801, line: 240, baseType: !108, size: 16, offset: 848)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !806, file: !801, line: 246, baseType: !108, size: 16, offset: 864)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !806, file: !801, line: 248, baseType: !852, size: 1152, offset: 896)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 1152, elements: !60)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !784, line: 182, size: 1152, elements: !854)
!854 = !{!855, !856, !857, !860, !861, !866, !870, !871, !878, !879, !880, !881, !884, !888, !892, !893, !894, !895}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !853, file: !784, line: 182, baseType: !203, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !853, file: !784, line: 182, baseType: !102, size: 16, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !853, file: !784, line: 182, baseType: !858, size: 16, offset: 48)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !859, line: 31, baseType: !106)
!859 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!860 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !853, file: !784, line: 182, baseType: !199, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !853, file: !784, line: 182, baseType: !862, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !863, line: 31, baseType: !864)
!863 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !105, line: 75, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !107, line: 47, baseType: !67)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !853, file: !784, line: 182, baseType: !867, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !868, line: 31, baseType: !869)
!868 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !105, line: 60, baseType: !865)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !853, file: !784, line: 182, baseType: !203, size: 32, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !853, file: !784, line: 182, baseType: !872, size: 128, offset: 256)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !873, line: 33, size: 128, elements: !874)
!873 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!874 = !{!875, !877}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !872, file: !873, line: 35, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !107, line: 122, baseType: !819)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !872, file: !873, line: 36, baseType: !819, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !853, file: !784, line: 182, baseType: !872, size: 128, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !853, file: !784, line: 182, baseType: !872, size: 128, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !853, file: !784, line: 182, baseType: !872, size: 128, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !853, file: !784, line: 182, baseType: !882, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !883, line: 31, baseType: !491)
!883 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!884 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !853, file: !784, line: 182, baseType: !885, size: 64, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !886, line: 31, baseType: !887)
!886 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !105, line: 55, baseType: !492)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !853, file: !784, line: 182, baseType: !889, size: 32, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !890, line: 31, baseType: !891)
!890 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !105, line: 56, baseType: !206)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !853, file: !784, line: 182, baseType: !865, size: 32, offset: 928)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !853, file: !784, line: 182, baseType: !865, size: 32, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !853, file: !784, line: 182, baseType: !206, size: 32, offset: 992)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !853, file: !784, line: 182, baseType: !896, size: 128, offset: 1024)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 128, elements: !210)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !806, file: !801, line: 249, baseType: !898, offset: 2048)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: -1)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !802, file: !801, line: 82, baseType: !805, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !802, file: !801, line: 83, baseType: !903, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !802, file: !801, line: 84, baseType: !203, size: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !802, file: !801, line: 85, baseType: !119, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !802, file: !801, line: 86, baseType: !79, size: 32, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !802, file: !801, line: 87, baseType: !79, size: 32, offset: 352)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !802, file: !801, line: 89, baseType: !175, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !802, file: !801, line: 90, baseType: !175, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !802, file: !801, line: 91, baseType: !911, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!79, !914, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !802, file: !801, line: 160, baseType: !79, size: 32, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !802, file: !801, line: 169, baseType: !919, size: 64, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !801, line: 169, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !802, file: !801, line: 191, baseType: !922, size: 64, offset: 704)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !802, file: !801, line: 171, size: 64, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !922, file: !801, line: 184, baseType: !919, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !922, file: !801, line: 190, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !801, line: 190, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !802, file: !801, line: 196, baseType: !929, size: 256, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !930, line: 37, baseType: !931)
!930 = !DIFile(filename: "../lib/i-ring.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !930, line: 29, size: 256, elements: !932)
!932 = !{!933, !935, !936, !937, !938}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !931, file: !930, line: 31, baseType: !934, size: 128)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, elements: !266)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !931, file: !930, line: 32, baseType: !79, size: 32, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !931, file: !930, line: 33, baseType: !67, size: 32, offset: 160)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !931, file: !930, line: 34, baseType: !67, size: 32, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !931, file: !930, line: 35, baseType: !181, size: 8, offset: 224)
!939 = !DILocalVariable(name: "ent", scope: !940, file: !2, line: 341, type: !941)
!940 = distinct !DILexicalBlock(scope: !791, file: !2, line: 340, column: 5)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !801, line: 250, baseType: !806)
!943 = !DILocation(line: 0, scope: !791)
!944 = !DILocation(line: 337, column: 14, scope: !791)
!945 = !DILocation(line: 339, column: 3, scope: !791)
!946 = !DILocation(line: 343, column: 13, scope: !940)
!947 = !DILocation(line: 0, scope: !940)
!948 = !DILocation(line: 344, column: 15, scope: !949)
!949 = distinct !DILexicalBlock(scope: !940, file: !2, line: 344, column: 11)
!950 = !DILocation(line: 344, column: 11, scope: !940)
!951 = !DILocation(line: 346, column: 15, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !2, line: 346, column: 15)
!953 = distinct !DILexicalBlock(scope: !949, file: !2, line: 345, column: 9)
!954 = !DILocation(line: 346, column: 21, scope: !952)
!955 = !DILocation(line: 346, column: 15, scope: !953)
!956 = !DILocation(line: 349, column: 21, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !2, line: 349, column: 19)
!958 = distinct !DILexicalBlock(scope: !952, file: !2, line: 347, column: 13)
!959 = !DILocation(line: 349, column: 19, scope: !958)
!960 = !DILocation(line: 350, column: 27, scope: !957)
!961 = !DILocation(line: 350, column: 17, scope: !957)
!962 = !DILocation(line: 352, column: 13, scope: !958)
!963 = !DILocation(line: 353, column: 11, scope: !953)
!964 = !DILocation(line: 356, column: 13, scope: !940)
!965 = !DILocation(line: 356, column: 10, scope: !940)
!966 = !DILocation(line: 357, column: 5, scope: !791)
!967 = distinct !{!967, !945, !966, !550}
!968 = !DILocation(line: 359, column: 7, scope: !969)
!969 = distinct !DILexicalBlock(scope: !791, file: !2, line: 359, column: 7)
!970 = !DILocation(line: 359, column: 23, scope: !969)
!971 = !DILocation(line: 359, column: 7, scope: !791)
!972 = !DILocation(line: 361, column: 17, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !2, line: 360, column: 5)
!974 = !DILocation(line: 361, column: 7, scope: !973)
!975 = !DILocation(line: 363, column: 5, scope: !973)
!976 = !DILocation(line: 365, column: 10, scope: !791)
!977 = !DILocation(line: 365, column: 3, scope: !791)
!978 = !DISubprogram(name: "xfts_open", scope: !979, file: !979, line: 4, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!979 = !DIFile(filename: "../lib/xfts.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!980 = !DISubroutineType(types: !981)
!981 = !{!799, !982, !79, !984}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!79, !987, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!990 = !DISubprogram(name: "rpl_fts_read", scope: !801, file: !801, line: 266, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !511)
!991 = !DISubroutineType(types: !992)
!992 = !{!941, !799}
!993 = distinct !DISubprogram(name: "process_file", scope: !2, file: !2, line: 204, type: !994, scopeLine: 205, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !996)
!994 = !DISubroutineType(types: !995)
!995 = !{!181, !799, !941}
!996 = !{!997, !998, !999, !1000, !1001, !1004, !1005, !1008, !1011}
