; ModuleID = 'coreutils-9.3/build/src/chown.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.dev_ino = type { i64, i32 }
%struct.infomap = type { ptr, ptr }
%struct._getopt_data = type { i32, i32, i32, ptr, i32, ptr, i32, i32, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.table_entry = type { [12 x i8], [12 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct.saved_cwd, %struct.saved_cwd, %struct.saved_cwd, ptr, i32, i32, ptr }
%struct.saved_cwd = type { i32, ptr }
%struct.Chown_option = type { i32, i8, ptr, i8, i8, ptr, ptr }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.group = type { ptr, ptr, i32, ptr }
%struct.passwd = type { ptr, ptr, i32, i32, i64, ptr, ptr, ptr, ptr, i64 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.FTS = type { ptr, ptr, ptr, i32, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }

!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!132 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !74, !79, !84, !133, !138, !143, !148, !153, !158, !160, !165, !170, !284, !287, !289, !291, !293, !298, !303, !305, !310, !312, !314, !316, !321, !326, !331, !333, !338, !343, !348, !353, !355, !360, !362, !364, !366, !371, !373, !375, !377, !379, !381, !383, !89}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !135, isLocal: true, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 7)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 14)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 16)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 13)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 267, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 42)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 281, type: !145, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 283, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 25)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 291, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 31)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !172, file: !2, line: 319, type: !203, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 157, type: !173, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !91, retainedNodes: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{!109, !109, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!176 = !{!177, !178, !179, !181, !188, !192, !193, !194, !195, !196, !222, !223, !224, !228, !229, !281, !283}
!177 = !DILocalVariable(name: "argc", arg: 1, scope: !172, file: !2, line: 157, type: !109)
!178 = !DILocalVariable(name: "argv", arg: 2, scope: !172, file: !2, line: 157, type: !175)
!179 = !DILocalVariable(name: "preserve_root", scope: !172, file: !2, line: 159, type: !180)
!180 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!181 = !DILocalVariable(name: "uid", scope: !172, file: !2, line: 161, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !183, line: 31, baseType: !184)
!183 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !185, line: 75, baseType: !186)
!185 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !187, line: 47, baseType: !95)
!187 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!188 = !DILocalVariable(name: "gid", scope: !172, file: !2, line: 162, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !190, line: 31, baseType: !191)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !185, line: 60, baseType: !186)
!192 = !DILocalVariable(name: "required_uid", scope: !172, file: !2, line: 166, type: !182)
!193 = !DILocalVariable(name: "required_gid", scope: !172, file: !2, line: 167, type: !189)
!194 = !DILocalVariable(name: "bit_flags", scope: !172, file: !2, line: 170, type: !109)
!195 = !DILocalVariable(name: "dereference", scope: !172, file: !2, line: 174, type: !109)
!196 = !DILocalVariable(name: "chopt", scope: !172, file: !2, line: 176, type: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !94, line: 44, size: 320, elements: !198)
!198 = !{!199, !200, !201, !218, !219, !220, !221}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !197, file: !94, line: 47, baseType: !93, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !197, file: !94, line: 50, baseType: !180, size: 8, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !197, file: !94, line: 54, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !204, line: 25, size: 128, elements: !205)
!204 = !DIFile(filename: "../lib/dev-ino.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!205 = !{!206, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !203, file: !204, line: 27, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !208, line: 31, baseType: !209)
!208 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_ino_t.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino_t", file: !185, line: 64, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !185, line: 62, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !187, line: 49, baseType: !212)
!212 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !203, file: !204, line: 28, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !215, line: 31, baseType: !216)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !185, line: 57, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !187, line: 46, baseType: !109)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !197, file: !94, line: 57, baseType: !180, size: 8, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !197, file: !94, line: 60, baseType: !180, size: 8, offset: 136)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !197, file: !94, line: 63, baseType: !130, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !197, file: !94, line: 66, baseType: !130, size: 64, offset: 256)
!222 = !DILocalVariable(name: "ok", scope: !172, file: !2, line: 177, type: !180)
!223 = !DILocalVariable(name: "optc", scope: !172, file: !2, line: 178, type: !109)
!224 = !DILocalVariable(name: "warn", scope: !225, file: !2, line: 230, type: !180)
!225 = distinct !DILexicalBlock(scope: !226, file: !2, line: 229, column: 11)
!226 = distinct !DILexicalBlock(scope: !227, file: !2, line: 194, column: 9)
!227 = distinct !DILexicalBlock(scope: !172, file: !2, line: 192, column: 5)
!228 = !DILocalVariable(name: "e", scope: !225, file: !2, line: 231, type: !128)
!229 = !DILocalVariable(name: "ref_stats", scope: !230, file: !2, line: 289, type: !232)
!230 = distinct !DILexicalBlock(scope: !231, file: !2, line: 288, column: 5)
!231 = distinct !DILexicalBlock(scope: !172, file: !2, line: 287, column: 7)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !233, line: 182, size: 1152, elements: !234)
!233 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!234 = !{!235, !236, !242, !245, !246, !247, !248, !249, !257, !258, !259, !260, !266, !270, !274, !275, !276, !277}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !232, file: !233, line: 182, baseType: !214, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !232, file: !233, line: 182, baseType: !237, size: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !238, line: 31, baseType: !239)
!238 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !185, line: 70, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !187, line: 45, baseType: !241)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !232, file: !233, line: 182, baseType: !243, size: 16, offset: 48)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !244, line: 31, baseType: !240)
!244 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !232, file: !233, line: 182, baseType: !210, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !232, file: !233, line: 182, baseType: !182, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !232, file: !233, line: 182, baseType: !189, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !232, file: !233, line: 182, baseType: !214, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !232, file: !233, line: 182, baseType: !250, size: 128, offset: 256)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !251, line: 33, size: 128, elements: !252)
!251 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!252 = !{!253, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !250, file: !251, line: 35, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !187, line: 122, baseType: !255)
!255 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !250, file: !251, line: 36, baseType: !255, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !232, file: !233, line: 182, baseType: !250, size: 128, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !232, file: !233, line: 182, baseType: !250, size: 128, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !232, file: !233, line: 182, baseType: !250, size: 128, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !232, file: !233, line: 182, baseType: !261, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !262, line: 31, baseType: !263)
!262 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !185, line: 71, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 48, baseType: !265)
!265 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !232, file: !233, line: 182, baseType: !267, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !268, line: 31, baseType: !269)
!268 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !185, line: 55, baseType: !264)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !232, file: !233, line: 182, baseType: !271, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !272, line: 31, baseType: !273)
!272 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !185, line: 56, baseType: !217)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !232, file: !233, line: 182, baseType: !186, size: 32, offset: 928)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !232, file: !233, line: 182, baseType: !186, size: 32, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !232, file: !233, line: 182, baseType: !217, size: 32, offset: 992)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !232, file: !233, line: 182, baseType: !278, size: 128, offset: 1024)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 128, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 2)
!281 = !DILocalVariable(name: "warn", scope: !282, file: !2, line: 301, type: !180)
!282 = distinct !DILexicalBlock(scope: !231, file: !2, line: 300, column: 5)
!283 = !DILocalVariable(name: "e", scope: !282, file: !2, line: 302, type: !128)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !279)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "reference_file", scope: !91, file: !2, line: 42, type: !130, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !108, line: 660, type: !286, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !108, line: 660, type: !145, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !108, line: 661, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !108, line: 661, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 22)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !108, line: 662, type: !295, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !108, line: 662, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 15)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !108, line: 663, type: !295, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !108, line: 664, type: !295, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !108, line: 665, type: !295, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !108, line: 678, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 23)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !108, line: 678, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 40)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !108, line: 683, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 4)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !108, line: 689, type: !49, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !108, line: 695, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 5)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !108, line: 696, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 27)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !108, line: 698, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 51)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !108, line: 699, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 12)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !295, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 8)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !350, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !335, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !307, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 17)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !140, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !76, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !135, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !295, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !357, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !335, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !357, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 3584, elements: !141)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !388, line: 50, size: 256, elements: !389)
!388 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!389 = !{!390, !391, !392, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !387, file: !388, line: 52, baseType: !128, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !387, file: !388, line: 55, baseType: !109, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !388, line: 56, baseType: !393, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !387, file: !388, line: 57, baseType: !109, size: 32, offset: 192)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !397, line: 564, type: !145, isLocal: true, isDefinition: true)
!397 = !DIFile(filename: "../src/chown-core.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !397, line: 576, type: !368, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !397, line: 309, type: !286, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !397, line: 309, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 45)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !397, line: 309, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 58)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !397, line: 309, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 49)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !397, line: 340, type: !368, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !397, line: 347, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 3)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !397, line: 353, type: !162, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !397, line: 361, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 186)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !397, line: 394, type: !300, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !397, line: 482, type: !162, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !397, line: 483, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 21)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !397, line: 162, type: !442, isLocal: true, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 56)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !397, line: 173, type: !3, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !397, line: 174, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 35)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !397, line: 175, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 30)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !397, line: 180, type: !59, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !397, line: 181, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 44)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !397, line: 182, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 34)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !397, line: 186, type: !323, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !397, line: 187, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 36)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !397, line: 195, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 32)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !397, line: 196, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 28)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !397, line: 197, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 26)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !397, line: 132, type: !286, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !495, line: 2, type: !328, isLocal: true, isDefinition: true)
!495 = !DIFile(filename: "src/version.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "Version", scope: !498, file: !495, line: 2, type: !128, isLocal: false, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C11, file: !495, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !499, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!499 = !{!493, !496}
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "proc_status", scope: !502, file: !503, line: 69, type: !109, isLocal: true, isDefinition: true)
!502 = distinct !DISubprogram(name: "openat_proc_name", scope: !503, file: !503, line: 47, type: !504, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !506, retainedNodes: !521)
!503 = !DIFile(filename: "../lib/openat-proc.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!504 = !DISubroutineType(types: !505)
!505 = !{!130, !130, !109, !128}
!506 = distinct !DICompileUnit(language: DW_LANG_C11, file: !503, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !507, globals: !511, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!507 = !{!508}
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !502, file: !503, line: 63, baseType: !95, size: 32, elements: !509)
!509 = !{!510}
!510 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27)
!511 = !{!500, !512, !514, !516}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !503, line: 81, type: !140, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !503, line: 93, type: !318, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !503, line: 111, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 18)
!521 = !{!522, !523, !524, !525, !526, !527, !531, !534}
!522 = !DILocalVariable(name: "buf", arg: 1, scope: !502, file: !503, line: 47, type: !130)
!523 = !DILocalVariable(name: "fd", arg: 2, scope: !502, file: !503, line: 47, type: !109)
!524 = !DILocalVariable(name: "file", arg: 3, scope: !502, file: !503, line: 47, type: !128)
!525 = !DILocalVariable(name: "result", scope: !502, file: !503, line: 49, type: !130)
!526 = !DILocalVariable(name: "dirlen", scope: !502, file: !503, line: 50, type: !109)
!527 = !DILocalVariable(name: "proc_self_fd", scope: !528, file: !503, line: 80, type: !109)
!528 = distinct !DILexicalBlock(scope: !529, file: !503, line: 71, column: 7)
!529 = distinct !DILexicalBlock(scope: !530, file: !503, line: 70, column: 9)
!530 = distinct !DILexicalBlock(scope: !502, file: !503, line: 62, column: 3)
!531 = !DILocalVariable(name: "dotdot_buf", scope: !532, file: !503, line: 92, type: !478)
!532 = distinct !DILexicalBlock(scope: !533, file: !503, line: 86, column: 11)
!533 = distinct !DILexicalBlock(scope: !528, file: !503, line: 83, column: 13)
!534 = !DILocalVariable(name: "bufsize", scope: !535, file: !503, line: 103, type: !537)
!535 = distinct !DILexicalBlock(scope: !536, file: !503, line: 102, column: 7)
!536 = distinct !DILexicalBlock(scope: !530, file: !503, line: 99, column: 9)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !538, line: 31, baseType: !539)
!538 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !187, line: 94, baseType: !540)
!540 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !543, line: 125, type: !544, isLocal: true, isDefinition: true)
!543 = !DIFile(filename: "../lib/chdir-long.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 88, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 11)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !543, line: 125, type: !150, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !543, line: 125, type: !357, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !543, line: 126, type: !350, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !543, line: 129, type: !286, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !543, line: 161, type: !350, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !543, line: 162, type: !307, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !543, line: 178, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 19)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !543, line: 63, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 72, elements: !87)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !543, line: 63, type: !150, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "file_name", scope: !571, file: !572, line: 45, type: !128, isLocal: true, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C11, file: !572, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !573, globals: !574, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!572 = !DIFile(filename: "../lib/closeout.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!573 = !{!128}
!574 = !{!575, !577, !579, !569, !581}
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !572, line: 121, type: !350, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !572, line: 123, type: !135, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !572, line: 126, type: !421, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !571, file: !572, line: 55, type: !180, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !585, line: 59, type: !586, isLocal: true, isDefinition: true)
!585 = !DIFile(filename: "../lib/cycle-check.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, elements: !351)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !585, line: 59, type: !140, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !585, line: 59, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 24)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !596, file: !597, line: 58, type: !640, isLocal: false, isDefinition: true)
!596 = distinct !DICompileUnit(language: DW_LANG_C11, file: !597, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !598, globals: !599, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!597 = !DIFile(filename: "../lib/error.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!598 = !{!131}
!599 = !{!600, !602, !624, !626, !628, !630, !594, !632, !634, !636, !638}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !597, line: 316, type: !335, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "old_file_name", scope: !604, file: !597, line: 344, type: !128, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "error_at_line", scope: !597, file: !597, line: 337, type: !605, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !596, retainedNodes: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !109, !109, !128, !95, !128, null}
!607 = !{!608, !609, !610, !611, !612, !613}
!608 = !DILocalVariable(name: "status", arg: 1, scope: !604, file: !597, line: 337, type: !109)
!609 = !DILocalVariable(name: "errnum", arg: 2, scope: !604, file: !597, line: 337, type: !109)
!610 = !DILocalVariable(name: "file_name", arg: 3, scope: !604, file: !597, line: 337, type: !128)
!611 = !DILocalVariable(name: "line_number", arg: 4, scope: !604, file: !597, line: 338, type: !95)
!612 = !DILocalVariable(name: "message", arg: 5, scope: !604, file: !597, line: 338, type: !128)
!613 = !DILocalVariable(name: "args", scope: !604, file: !597, line: 340, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !615, line: 22, baseType: !616)
!615 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stdarg.h", directory: "")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !597, baseType: !617)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 192, elements: !82)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !619)
!619 = !{!620, !621, !622, !623}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !618, file: !597, line: 295, baseType: !95, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !618, file: !597, line: 295, baseType: !95, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !618, file: !597, line: 295, baseType: !131, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !618, file: !597, line: 295, baseType: !131, size: 64, offset: 128)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "old_line_number", scope: !604, file: !597, line: 345, type: !95, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !597, line: 379, type: !328, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !597, line: 387, type: !357, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !597, line: 387, type: !286, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "error_message_count", scope: !596, file: !597, line: 61, type: !95, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !596, file: !597, line: 334, type: !109, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !597, line: 193, type: !437, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !597, line: 199, type: !335, isLocal: true, isDefinition: true)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null}
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !645, line: 407, type: !286, isLocal: true, isDefinition: true)
!645 = !DIFile(filename: "../lib/fts.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !645, line: 448, type: !81, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !645, line: 1078, type: !421, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !652, line: 256, type: !286, isLocal: true, isDefinition: true)
!652 = !DIFile(filename: "../lib/getcwd.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !652, line: 261, type: !286, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !652, line: 279, type: !421, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "rpl_optind", scope: !659, file: !660, line: 104, type: !109, isLocal: false, isDefinition: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C11, file: !660, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !661, retainedTypes: !668, globals: !669, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!660 = !DIFile(filename: "../lib/getopt.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!661 = !{!662}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__ord", file: !663, line: 55, baseType: !95, size: 32, elements: !664)
!663 = !DIFile(filename: "../lib/getopt_int.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!664 = !{!665, !666, !667}
!665 = !DIEnumerator(name: "REQUIRE_ORDER", value: 0)
!666 = !DIEnumerator(name: "PERMUTE", value: 1)
!667 = !DIEnumerator(name: "RETURN_IN_ORDER", value: 2)
!668 = !{!131, !128, !175}
!669 = !{!657, !670, !672, !674, !676, !678, !680, !685, !687, !689, !702, !704, !706, !711, !713, !715, !717, !719}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "rpl_opterr", scope: !659, file: !660, line: 109, type: !109, isLocal: false, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "rpl_optopt", scope: !659, file: !660, line: 115, type: !109, isLocal: false, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !660, line: 528, type: !421, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !660, line: 598, type: !286, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !660, line: 621, type: !483, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !660, line: 636, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 41)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !660, line: 652, type: !328, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "rpl_optarg", scope: !659, file: !660, line: 89, type: !130, isLocal: false, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "getopt_data", scope: !659, file: !660, line: 119, type: !691, isLocal: true, isDefinition: true)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_getopt_data", file: !663, line: 61, size: 448, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rpl_optind", scope: !691, file: !663, line: 66, baseType: !109, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rpl_opterr", scope: !691, file: !663, line: 67, baseType: !109, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rpl_optopt", scope: !691, file: !663, line: 68, baseType: !109, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rpl_optarg", scope: !691, file: !663, line: 69, baseType: !130, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__initialized", scope: !691, file: !663, line: 74, baseType: !109, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__nextchar", scope: !691, file: !663, line: 82, baseType: !130, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__ordering", scope: !691, file: !663, line: 85, baseType: !662, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__first_nonopt", scope: !691, file: !663, line: 93, baseType: !109, size: 32, offset: 352)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__last_nonopt", scope: !691, file: !663, line: 94, baseType: !109, size: 32, offset: 384)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !660, line: 405, type: !145, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !660, line: 278, type: !478, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !660, line: 284, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 47)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !660, line: 289, type: !357, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !660, line: 295, type: !286, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !660, line: 319, type: !478, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !660, line: 345, type: !404, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !660, line: 360, type: !323, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !723, line: 220, type: !591, isLocal: true, isDefinition: true)
!723 = !DIFile(filename: "../lib/hash.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(scope: null, file: !723, line: 221, type: !591, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !723, line: 222, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 33)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !723, line: 225, type: !591, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "default_tuning", scope: !735, file: !723, line: 130, type: !739, isLocal: true, isDefinition: true)
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !723, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !736, globals: !738, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!736 = !{!540, !131, !737, !537}
!737 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!738 = !{!721, !724, !726, !731, !733}
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !741, line: 45, baseType: !742)
!741 = !DIFile(filename: "../lib/hash.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !741, line: 33, size: 160, elements: !743)
!743 = !{!744, !745, !746, !747, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !742, file: !741, line: 38, baseType: !737, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !742, file: !741, line: 39, baseType: !737, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !742, file: !741, line: 40, baseType: !737, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !742, file: !741, line: 41, baseType: !737, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !742, file: !741, line: 42, baseType: !180, size: 8, offset: 128)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !751, line: 913, type: !81, isLocal: true, isDefinition: true)
!751 = !DIFile(filename: "../lib/localcharset.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !751, line: 1025, type: !76, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "alias_table", scope: !756, file: !751, line: 93, type: !760, isLocal: true, isDefinition: true)
!756 = distinct !DICompileUnit(language: DW_LANG_C11, file: !751, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !598, globals: !757, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!757 = !{!749, !752, !758, !754}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !751, line: 1155, type: !76, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 4800, elements: !163)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "table_entry", file: !751, line: 86, size: 192, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !762, file: !751, line: 88, baseType: !586, size: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !762, file: !751, line: 89, baseType: !586, size: 96, offset: 96)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "have_cloexec", scope: !768, file: !769, line: 65, type: !109, isLocal: true, isDefinition: true)
!768 = distinct !DISubprogram(name: "rpl_open", scope: !769, file: !769, line: 59, type: !770, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !772, retainedNodes: !774)
!769 = !DIFile(filename: "../lib/open.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!770 = !DISubroutineType(types: !771)
!771 = !{!109, !128, !109, null}
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !773, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!773 = !{!766}
!774 = !{!775, !776, !777, !778, !779, !791, !794, !797}
!775 = !DILocalVariable(name: "filename", arg: 1, scope: !768, file: !769, line: 59, type: !128)
!776 = !DILocalVariable(name: "flags", arg: 2, scope: !768, file: !769, line: 59, type: !109)
!777 = !DILocalVariable(name: "mode", scope: !768, file: !769, line: 68, type: !237)
!778 = !DILocalVariable(name: "fd", scope: !768, file: !769, line: 69, type: !109)
!779 = !DILocalVariable(name: "arg", scope: !780, file: !769, line: 74, type: !782)
!780 = distinct !DILexicalBlock(scope: !781, file: !769, line: 73, column: 5)
!781 = distinct !DILexicalBlock(scope: !768, file: !769, line: 72, column: 7)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !615, line: 22, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !769, baseType: !784)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 192, elements: !82)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !785, file: !769, line: 74, baseType: !95, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !785, file: !769, line: 74, baseType: !95, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !785, file: !769, line: 74, baseType: !131, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !785, file: !769, line: 74, baseType: !131, size: 64, offset: 128)
!791 = !DILocalVariable(name: "len", scope: !792, file: !769, line: 121, type: !537)
!792 = distinct !DILexicalBlock(scope: !793, file: !769, line: 120, column: 5)
!793 = distinct !DILexicalBlock(scope: !768, file: !769, line: 117, column: 7)
!794 = !DILocalVariable(name: "len", scope: !795, file: !769, line: 188, type: !537)
!795 = distinct !DILexicalBlock(scope: !796, file: !769, line: 186, column: 5)
!796 = distinct !DILexicalBlock(scope: !768, file: !769, line: 185, column: 7)
!797 = !DILocalVariable(name: "statbuf", scope: !798, file: !769, line: 191, type: !800)
!798 = distinct !DILexicalBlock(scope: !799, file: !769, line: 190, column: 9)
!799 = distinct !DILexicalBlock(scope: !795, file: !769, line: 189, column: 11)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !233, line: 182, size: 1152, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !800, file: !233, line: 182, baseType: !214, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !800, file: !233, line: 182, baseType: !237, size: 16, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !800, file: !233, line: 182, baseType: !243, size: 16, offset: 48)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !800, file: !233, line: 182, baseType: !210, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !800, file: !233, line: 182, baseType: !182, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !800, file: !233, line: 182, baseType: !189, size: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !800, file: !233, line: 182, baseType: !214, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !800, file: !233, line: 182, baseType: !810, size: 128, offset: 256)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !251, line: 33, size: 128, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !810, file: !251, line: 35, baseType: !254, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !810, file: !251, line: 36, baseType: !255, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !800, file: !233, line: 182, baseType: !810, size: 128, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !800, file: !233, line: 182, baseType: !810, size: 128, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !800, file: !233, line: 182, baseType: !810, size: 128, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !800, file: !233, line: 182, baseType: !261, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !800, file: !233, line: 182, baseType: !267, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !800, file: !233, line: 182, baseType: !271, size: 32, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !800, file: !233, line: 182, baseType: !186, size: 32, offset: 928)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !800, file: !233, line: 182, baseType: !186, size: 32, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !800, file: !233, line: 182, baseType: !217, size: 32, offset: 992)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !800, file: !233, line: 182, baseType: !278, size: 128, offset: 1024)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "have_cloexec", scope: !826, file: !827, line: 64, type: !109, isLocal: true, isDefinition: true)
!826 = distinct !DISubprogram(name: "rpl_openat", scope: !827, file: !827, line: 58, type: !828, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !830, retainedNodes: !832)
!827 = !DIFile(filename: "../lib/openat.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!828 = !DISubroutineType(types: !829)
!829 = !{!109, !109, !128, !109, null}
!830 = distinct !DICompileUnit(language: DW_LANG_C11, file: !827, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !831, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!831 = !{!824}
!832 = !{!833, !834, !835, !836, !837, !838, !850, !853, !856}
!833 = !DILocalVariable(name: "dfd", arg: 1, scope: !826, file: !827, line: 58, type: !109)
!834 = !DILocalVariable(name: "filename", arg: 2, scope: !826, file: !827, line: 58, type: !128)
!835 = !DILocalVariable(name: "flags", arg: 3, scope: !826, file: !827, line: 58, type: !109)
!836 = !DILocalVariable(name: "mode", scope: !826, file: !827, line: 67, type: !237)
!837 = !DILocalVariable(name: "fd", scope: !826, file: !827, line: 68, type: !109)
!838 = !DILocalVariable(name: "arg", scope: !839, file: !827, line: 73, type: !841)
!839 = distinct !DILexicalBlock(scope: !840, file: !827, line: 72, column: 5)
!840 = distinct !DILexicalBlock(scope: !826, file: !827, line: 71, column: 7)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !615, line: 22, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !827, baseType: !843)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 192, elements: !82)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !845)
!845 = !{!846, !847, !848, !849}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !844, file: !827, line: 73, baseType: !95, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !844, file: !827, line: 73, baseType: !95, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !844, file: !827, line: 73, baseType: !131, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !844, file: !827, line: 73, baseType: !131, size: 64, offset: 128)
!850 = !DILocalVariable(name: "len", scope: !851, file: !827, line: 106, type: !537)
!851 = distinct !DILexicalBlock(scope: !852, file: !827, line: 105, column: 5)
!852 = distinct !DILexicalBlock(scope: !826, file: !827, line: 102, column: 7)
!853 = !DILocalVariable(name: "len", scope: !854, file: !827, line: 149, type: !537)
!854 = distinct !DILexicalBlock(scope: !855, file: !827, line: 147, column: 5)
!855 = distinct !DILexicalBlock(scope: !826, file: !827, line: 146, column: 7)
!856 = !DILocalVariable(name: "statbuf", scope: !857, file: !827, line: 152, type: !859)
!857 = distinct !DILexicalBlock(scope: !858, file: !827, line: 151, column: 9)
!858 = distinct !DILexicalBlock(scope: !854, file: !827, line: 150, column: 11)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !233, line: 182, size: 1152, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !859, file: !233, line: 182, baseType: !214, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !859, file: !233, line: 182, baseType: !237, size: 16, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !859, file: !233, line: 182, baseType: !243, size: 16, offset: 48)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !859, file: !233, line: 182, baseType: !210, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !859, file: !233, line: 182, baseType: !182, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !859, file: !233, line: 182, baseType: !189, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !859, file: !233, line: 182, baseType: !214, size: 32, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !859, file: !233, line: 182, baseType: !869, size: 128, offset: 256)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !251, line: 33, size: 128, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !869, file: !251, line: 35, baseType: !254, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !869, file: !251, line: 36, baseType: !255, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !859, file: !233, line: 182, baseType: !869, size: 128, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !859, file: !233, line: 182, baseType: !869, size: 128, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !859, file: !233, line: 182, baseType: !869, size: 128, offset: 640)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !859, file: !233, line: 182, baseType: !261, size: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !859, file: !233, line: 182, baseType: !267, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !859, file: !233, line: 182, baseType: !271, size: 32, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !859, file: !233, line: 182, baseType: !186, size: 32, offset: 928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !859, file: !233, line: 182, baseType: !186, size: 32, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !859, file: !233, line: 182, baseType: !217, size: 32, offset: 992)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !859, file: !233, line: 182, baseType: !278, size: 128, offset: 1024)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !885, line: 38, type: !886, isLocal: true, isDefinition: true)
!885 = !DIFile(filename: "../lib/openat-die.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 43)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !885, line: 57, type: !891, isLocal: true, isDefinition: true)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 46)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "program_name", scope: !896, file: !897, line: 33, type: !128, isLocal: false, isDefinition: true)
!896 = distinct !DICompileUnit(language: DW_LANG_C11, file: !897, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !598, globals: !898, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!897 = !DIFile(filename: "../lib/progname.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!898 = !{!894, !899, !901, !903}
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !897, line: 54, type: !442, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !897, line: 61, type: !357, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !897, line: 64, type: !328, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !907, line: 79, type: !357, isLocal: true, isDefinition: true)
!907 = !DIFile(filename: "../lib/quotearg.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !907, line: 80, type: !76, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !907, line: 81, type: !150, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !907, line: 82, type: !150, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !907, line: 83, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 20)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !907, line: 84, type: !286, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !907, line: 85, type: !357, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !907, line: 86, type: !135, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !907, line: 87, type: !135, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !907, line: 88, type: !357, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !931, file: !907, line: 77, type: !990, isLocal: false, isDefinition: true)
!931 = distinct !DICompileUnit(language: DW_LANG_C11, file: !907, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !938, globals: !939, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!932 = !{!113, !933}
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !114, line: 242, baseType: !95, size: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!936 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!937 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!938 = !{!537, !128}
!939 = !{!905, !908, !910, !912, !914, !919, !921, !923, !925, !927, !929, !940, !944, !954, !956, !961, !963, !965, !967, !969, !971, !973, !975, !977, !979, !986, !988}
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !931, file: !907, line: 93, type: !942, isLocal: false, isDefinition: true)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 320, elements: !296)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !931, file: !907, line: 1043, type: !946, isLocal: false, isDefinition: true)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !907, line: 57, size: 448, elements: !947)
!947 = !{!948, !949, !950, !952, !953}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !946, file: !907, line: 60, baseType: !113, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !907, line: 63, baseType: !109, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !946, file: !907, line: 67, baseType: !951, size: 256, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !358)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !946, file: !907, line: 70, baseType: !128, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !946, file: !907, line: 73, baseType: !128, size: 64, offset: 384)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !931, file: !907, line: 108, type: !946, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "slot0", scope: !931, file: !907, line: 833, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 256)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !907, line: 318, type: !286, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !907, line: 354, type: !286, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !907, line: 355, type: !286, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !907, line: 226, type: !76, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !907, line: 227, type: !328, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !907, line: 227, type: !328, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !907, line: 228, type: !357, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !907, line: 229, type: !328, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !907, line: 229, type: !421, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "slotvec", scope: !931, file: !907, line: 836, type: !981, isLocal: true, isDefinition: true)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !907, line: 825, size: 128, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !982, file: !907, line: 827, baseType: !537, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !982, file: !907, line: 828, baseType: !130, size: 64, offset: 64)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "nslots", scope: !931, file: !907, line: 834, type: !109, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "slotvec0", scope: !931, file: !907, line: 835, type: !982, isLocal: true, isDefinition: true)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 704, elements: !545)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !994, line: 32, type: !286, isLocal: true, isDefinition: true)
!994 = !DIFile(filename: "../lib/root-dev-ino.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !997, line: 65, type: !286, isLocal: true, isDefinition: true)
!997 = !DIFile(filename: "../lib/save-cwd.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 279, type: !340, isLocal: true, isDefinition: true)
!1000 = !DIFile(filename: "../lib/userspec.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 165, type: !150, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 170, type: !81, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 174, type: !150, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !1000, line: 207, type: !140, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 67, type: !350, isLocal: true, isDefinition: true)
!1011 = !DIFile(filename: "../lib/version-etc.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 69, type: !135, isLocal: true, isDefinition: true)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 83, type: !328, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 85, type: !286, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 88, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 171)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 93, type: !466, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 105, type: !145, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 109, type: !318, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 113, type: !483, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 120, type: !478, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 127, type: !473, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 134, type: !323, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 142, type: !461, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 150, type: !59, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 159, type: !1043, isLocal: true, isDefinition: true)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 52)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 170, type: !1048, isLocal: true, isDefinition: true)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 60)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 249, type: !916, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 249, type: !300, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 255, type: !916, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 255, type: !140, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 255, type: !323, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 260, type: !3, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1011, line: 261, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 29)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1070, file: !1071, line: 26, type: !1073, isLocal: false, isDefinition: true)
!1070 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1071, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1072, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!1071 = !DIFile(filename: "../lib/version-etc-fsf.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1072 = !{!1068}
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 376, elements: !709)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1076, file: !1077, line: 24, type: !1079, isLocal: false, isDefinition: true)
!1076 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1077, producer: "Homebrew clang version 16.0.4", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1078, splitDebugInlining: false, nameTableKind: None, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk", sdk: "MacOSX13.sdk")
!1077 = !DIFile(filename: "../lib/exitfail.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1078 = !{!1074}
!1079 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 34, type: !421, isLocal: true, isDefinition: true)
!1082 = !DIFile(filename: "../lib/xalloc-die.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 34, type: !368, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1087, line: 40, type: !1088, isLocal: true, isDefinition: true)
!1087 = !DIFile(filename: "../lib/xfts.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 80, elements: !296)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1087, line: 40, type: !135, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1087, line: 40, type: !145, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1095, line: 85, type: !566, isLocal: true, isDefinition: true)
!1095 = !DIFile(filename: "../lib/xstrtol.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1095, line: 85, type: !295, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(scope: null, file: !1095, line: 85, type: !1100, isLocal: true, isDefinition: true)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 38)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1105, line: 199, type: !135, isLocal: true, isDefinition: true)
!1105 = !DIFile(filename: "../lib/printf-args.c", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1108, file: !1105, line: 209, type: !1290, isLocal: true, isDefinition: true)
!1108 = distinct !DISubprogram(name: "printf_fetchargs", scope: !1105, file: !1105, line: 39, type: !1109, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1282, retainedNodes: !1285)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!109, !1111, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1112, file: !1105, baseType: !95, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1112, file: !1105, baseType: !95, size: 32, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1112, file: !1105, baseType: !131, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1112, file: !1105, baseType: !131, size: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1120, line: 194, baseType: !1121)
!1120 = !DIFile(filename: "../lib/printf-args.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1120, line: 188, size: 1920, elements: !1122)
!1122 = !{!1123, !1126, !1280}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1121, file: !1120, line: 190, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1125, line: 46, baseType: !540)
!1125 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stddef.h", directory: "")
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1121, file: !1120, line: 191, baseType: !1127, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1120, line: 183, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1120, line: 118, size: 256, elements: !1130)
!1130 = !{!1131, !1182}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !1120, line: 120, baseType: !1132, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1120, line: 115, baseType: !1133)
!1133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1120, line: 52, baseType: !95, size: 32, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1135 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1136 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1137 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1138 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1139 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1140 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1141 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1142 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1143 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1144 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1145 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1146 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1147 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1148 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1149 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1150 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1151 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1152 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1153 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1154 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1155 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1156 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1157 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1158 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1159 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1160 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1161 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1162 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1163 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1164 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1165 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1166 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1167 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1168 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1169 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1170 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1171 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1172 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1173 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1174 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1175 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1176 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1177 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1178 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1179 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1180 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1181 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1129, file: !1120, line: 181, baseType: !1183, size: 128, offset: 128)
!1183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1129, file: !1120, line: 121, size: 128, elements: !1184)
!1184 = !{!1185, !1187, !1189, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1201, !1204, !1207, !1210, !1213, !1216, !1219, !1222, !1225, !1227, !1229, !1231, !1233, !1235, !1237, !1239, !1240, !1242, !1244, !1245, !1249, !1250, !1254, !1255, !1257, !1259, !1260, !1262, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1183, file: !1120, line: 123, baseType: !1186, size: 8)
!1186 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1183, file: !1120, line: 124, baseType: !1188, size: 8)
!1188 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
