; ModuleID = 'coreutils-9.3/build/src/shred.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.Options = type { i8, i64, i64, i32, i8, i8, i8 }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }

@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@program_name = external global ptr, align 8
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... FILE...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [134 x i8] c"Overwrite the specified FILE(s) repeatedly, in order to make it harder\0Afor even very expensive hardware probing to recover the data.\0A\00", align 1, !dbg !12
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [39 x i8] c"\0AIf FILE is -, shred standard output.\0A\00", align 1, !dbg !17

!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !2, line: 854, type: !257, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 950, type: !181, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "patterns", scope: !66, file: !2, line: 681, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 1760, elements: !332)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!332 = !{!333}
!333 = !DISubrange(count: 55)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !2, line: 436, type: !166, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !146, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 507, type: !9, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 528, type: !312, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 540, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 19)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 564, type: !257, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 35)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 13)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !2, line: 280, type: !282, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !181, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !312, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1138, type: !9, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1145, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 20)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1057, type: !356, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1082, type: !166, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1091, type: !181, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1095, type: !176, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "nameset", scope: !66, file: !2, line: 983, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 520, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 65)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1000, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !288)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1000, type: !287, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1000, type: !193, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 2816, elements: !274)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !395, line: 50, size: 256, elements: !396)
!395 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!396 = !{!397, !398, !399, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !394, file: !395, line: 52, baseType: !124, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !394, file: !395, line: 55, baseType: !83, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !394, file: !395, line: 56, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !394, file: !395, line: 57, baseType: !83, size: 32, offset: 192)
!402 = !{!"Homebrew clang version 16.0.4"}
!403 = !{i32 7, !"Dwarf Version", i32 4}
!404 = !{i32 2, !"Debug Info Version", i32 3}
!405 = !{i32 1, !"wchar_size", i32 4}
!406 = !{i32 8, !"PIC Level", i32 2}
!407 = !{i32 7, !"uwtable", i32 2}
!408 = !{i32 7, !"frame-pointer", i32 2}
!409 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 165, type: !410, scopeLine: 166, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !83}
!412 = !{!413}
!413 = !DILocalVariable(name: "status", arg: 1, scope: !409, file: !2, line: 165, type: !83)
!414 = !DILocation(line: 0, scope: !409)
!415 = !DILocation(line: 167, column: 14, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !2, line: 167, column: 7)
!417 = !DILocation(line: 167, column: 7, scope: !409)
!418 = !DILocation(line: 168, column: 5, scope: !416)
!419 = !DILocation(line: 168, column: 5, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !2, line: 168, column: 5)
!421 = !{!422, !422, i64 0}
!422 = !{!"any pointer", !423, i64 0}
!423 = !{!"omnipotent char", !424, i64 0}
!424 = !{!"Simple C/C++ TBAA"}
!425 = !DILocation(line: 171, column: 53, scope: !426)
!426 = distinct !DILexicalBlock(scope: !416, file: !2, line: 170, column: 5)
!427 = !DILocation(line: 171, column: 7, scope: !426)
!428 = !DILocation(line: 175, column: 5, scope: !426)
!429 = !DILocation(line: 172, column: 7, scope: !426)
!430 = !DILocation(line: 179, column: 5, scope: !426)
!431 = !DILocation(line: 176, column: 7, scope: !426)
!432 = !DILocation(line: 181, column: 7, scope: !426)
!433 = !DILocation(line: 183, column: 7, scope: !426)
!434 = !DILocation(line: 196, column: 5, scope: !426)
!435 = !DILocation(line: 189, column: 7, scope: !426)
!436 = !DILocation(line: 197, column: 39, scope: !426)
!437 = !DILocation(line: 197, column: 7, scope: !426)
!438 = !DILocation(line: 198, column: 42, scope: !426)
!439 = !DILocation(line: 198, column: 7, scope: !426)
!440 = !DILocation(line: 210, column: 5, scope: !426)
!441 = !DILocation(line: 199, column: 7, scope: !426)
!442 = !DILocation(line: 216, column: 5, scope: !426)
!443 = !DILocation(line: 211, column: 7, scope: !426)
!444 = !DILocation(line: 217, column: 7, scope: !426)
!445 = !DILocation(line: 219, column: 3, scope: !409)
!446 = !DISubprogram(name: "fprintf", scope: !447, file: !447, line: 155, type: !448, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!447 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!448 = !DISubroutineType(types: !449)
!449 = !{!83, !450, !500, null}
!450 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !453, line: 157, baseType: !454)
!453 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !453, line: 126, size: 1216, elements: !455)
!455 = !{!456, !459, !460, !461, !463, !464, !469, !470, !471, !475, !479, !484, !488, !489, !492, !493, !495, !497, !498, !499}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !454, file: !453, line: 127, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !454, file: !453, line: 128, baseType: !83, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !454, file: !453, line: 129, baseType: !83, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !454, file: !453, line: 130, baseType: !462, size: 16, offset: 128)
!462 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !454, file: !453, line: 131, baseType: !462, size: 16, offset: 144)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !454, file: !453, line: 132, baseType: !465, size: 128, offset: 192)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !453, line: 92, size: 128, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !465, file: !453, line: 93, baseType: !457, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !465, file: !453, line: 94, baseType: !83, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !454, file: !453, line: 133, baseType: !83, size: 32, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !454, file: !453, line: 136, baseType: !126, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !454, file: !453, line: 137, baseType: !472, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!83, !126}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !454, file: !453, line: 138, baseType: !476, size: 64, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!83, !126, !136, !83}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !454, file: !453, line: 139, baseType: !480, size: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !126, !483, !83}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !453, line: 81, baseType: !131)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !454, file: !453, line: 140, baseType: !485, size: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!83, !126, !124, !83}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !454, file: !453, line: 143, baseType: !465, size: 128, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !454, file: !453, line: 144, baseType: !490, size: 64, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !453, line: 98, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !454, file: !453, line: 145, baseType: !83, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !454, file: !453, line: 148, baseType: !494, size: 24, offset: 928)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 24, elements: !187)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !454, file: !453, line: 149, baseType: !496, size: 8, offset: 952)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 8, elements: !57)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !454, file: !453, line: 152, baseType: !465, size: 128, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !454, file: !453, line: 155, baseType: !83, size: 32, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !454, file: !453, line: 156, baseType: !483, size: 64, offset: 1152)
!500 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !124)
!501 = !{}
!502 = !DISubprogram(name: "printf", scope: !447, file: !447, line: 175, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!503 = !DISubroutineType(types: !504)
!504 = !{!83, !500, null}
!505 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !447, file: !447, line: 157, type: !506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!506 = !DISubroutineType(types: !507)
!507 = !{!83, !500, !450}
!508 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !82, file: !82, line: 584, type: !509, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !501)
!509 = !DISubroutineType(types: !510)
!510 = !{null}
!511 = !DILocation(line: 588, column: 5, scope: !508)
!512 = !DILocation(line: 586, column: 3, scope: !508)
!513 = !DILocation(line: 589, column: 1, scope: !508)
!514 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !82, file: !82, line: 657, type: !515, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !124}
!517 = !{!518, !519, !526, !527, !529, !530}
!518 = !DILocalVariable(name: "program", arg: 1, scope: !514, file: !82, line: 657, type: !124)
!519 = !DILocalVariable(name: "infomap", scope: !514, file: !82, line: 659, type: !520)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 896, elements: !283)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !514, file: !82, line: 659, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !522, file: !82, line: 659, baseType: !124, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !522, file: !82, line: 659, baseType: !124, size: 64, offset: 64)
!526 = !DILocalVariable(name: "node", scope: !514, file: !82, line: 669, type: !124)
!527 = !DILocalVariable(name: "map_prog", scope: !514, file: !82, line: 670, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!529 = !DILocalVariable(name: "lc_messages", scope: !514, file: !82, line: 682, type: !124)
!530 = !DILocalVariable(name: "url_program", scope: !514, file: !82, line: 695, type: !124)
!531 = !DILocation(line: 0, scope: !514)
!532 = !DILocation(line: 659, column: 3, scope: !514)
!533 = !DILocation(line: 659, column: 67, scope: !514)
!534 = !DILocation(line: 670, column: 36, scope: !514)
!535 = !DILocation(line: 672, column: 3, scope: !514)
!536 = !DILocation(line: 672, column: 20, scope: !514)
!537 = !{!538, !422, i64 0}
!538 = !{!"infomap", !422, i64 0, !422, i64 8}
!539 = !DILocation(line: 672, column: 10, scope: !514)
!540 = !DILocation(line: 672, column: 28, scope: !514)
!541 = !DILocation(line: 672, column: 33, scope: !514)
!542 = !DILocation(line: 672, column: 31, scope: !514)
!543 = !DILocation(line: 673, column: 13, scope: !514)
!544 = distinct !{!544, !535, !543, !545, !546}
!545 = !{!"llvm.loop.mustprogress"}
!546 = !{!"llvm.loop.unroll.disable"}
!547 = !DILocation(line: 675, column: 17, scope: !548)
!548 = distinct !DILexicalBlock(scope: !514, file: !82, line: 675, column: 7)
!549 = !{!538, !422, i64 8}
!550 = !DILocation(line: 675, column: 7, scope: !548)
!551 = !DILocation(line: 675, column: 7, scope: !514)
!552 = !DILocation(line: 676, column: 22, scope: !548)
!553 = !DILocation(line: 676, column: 5, scope: !548)
!554 = !DILocation(line: 678, column: 3, scope: !514)
!555 = !DILocation(line: 682, column: 29, scope: !514)
!556 = !DILocation(line: 683, column: 7, scope: !557)
!557 = distinct !DILexicalBlock(scope: !514, file: !82, line: 683, column: 7)
!558 = !DILocation(line: 683, column: 19, scope: !557)
!559 = !DILocation(line: 683, column: 22, scope: !557)
!560 = !DILocation(line: 683, column: 7, scope: !514)
!561 = !DILocation(line: 690, column: 61, scope: !562)
!562 = distinct !DILexicalBlock(scope: !557, file: !82, line: 684, column: 5)
!563 = !DILocation(line: 689, column: 7, scope: !562)
!564 = !DILocation(line: 691, column: 5, scope: !562)
!565 = !DILocation(line: 695, column: 29, scope: !514)
!566 = !DILocation(line: 696, column: 3, scope: !514)
!567 = !DILocation(line: 699, column: 22, scope: !514)
!568 = !DILocation(line: 699, column: 17, scope: !514)
!569 = !DILocation(line: 698, column: 3, scope: !514)
!570 = !DILocation(line: 700, column: 1, scope: !514)
!571 = !DISubprogram(name: "exit", scope: !572, file: !572, line: 145, type: !410, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !501)
!572 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!573 = !DISubprogram(name: "strcmp", scope: !574, file: !574, line: 77, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!574 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!575 = !DISubroutineType(types: !576)
!576 = !{!83, !124, !124}
!577 = !DISubprogram(name: "setlocale", scope: !578, file: !578, line: 53, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!578 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!579 = !DISubroutineType(types: !580)
!580 = !{!136, !83, !124}
!581 = !DISubprogram(name: "strncmp", scope: !574, file: !574, line: 84, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!582 = !DISubroutineType(types: !583)
!583 = !{!83, !124, !124, !137}
!584 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1168, type: !585, scopeLine: 1169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !588)
!585 = !DISubroutineType(types: !586)
!586 = !{!83, !83, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!588 = !{!589, !590, !591, !593, !603, !604, !605, !606, !607, !608}
!589 = !DILocalVariable(name: "argc", arg: 1, scope: !584, file: !2, line: 1168, type: !83)
!590 = !DILocalVariable(name: "argv", arg: 2, scope: !584, file: !2, line: 1168, type: !587)
!591 = !DILocalVariable(name: "ok", scope: !584, file: !2, line: 1170, type: !592)
!592 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!593 = !DILocalVariable(name: "flags", scope: !584, file: !2, line: 1171, type: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Options", file: !2, line: 131, size: 256, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !594, file: !2, line: 133, baseType: !592, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "n_iterations", scope: !594, file: !2, line: 134, baseType: !137, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !594, file: !2, line: 135, baseType: !129, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "remove_file", scope: !594, file: !2, line: 136, baseType: !72, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !594, file: !2, line: 137, baseType: !592, size: 8, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !594, file: !2, line: 138, baseType: !592, size: 8, offset: 232)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "zero_fill", scope: !594, file: !2, line: 139, baseType: !592, size: 8, offset: 240)
!603 = !DILocalVariable(name: "file", scope: !584, file: !2, line: 1172, type: !587)
!604 = !DILocalVariable(name: "n_files", scope: !584, file: !2, line: 1173, type: !83)
!605 = !DILocalVariable(name: "c", scope: !584, file: !2, line: 1174, type: !83)
!606 = !DILocalVariable(name: "i", scope: !584, file: !2, line: 1175, type: !83)
!607 = !DILocalVariable(name: "random_source", scope: !584, file: !2, line: 1176, type: !124)
!608 = !DILocalVariable(name: "qname", scope: !609, file: !2, line: 1261, type: !136)
!609 = distinct !DILexicalBlock(scope: !610, file: !2, line: 1260, column: 5)
!610 = distinct !DILexicalBlock(scope: !611, file: !2, line: 1259, column: 3)
!611 = distinct !DILexicalBlock(scope: !584, file: !2, line: 1259, column: 3)
!612 = !DILocation(line: 0, scope: !584)
!613 = !DILocation(line: 1171, column: 3, scope: !584)
!614 = !DILocation(line: 1171, column: 18, scope: !584)
!615 = !DILocation(line: 1179, column: 21, scope: !584)
!616 = !DILocation(line: 1179, column: 3, scope: !584)
!617 = !DILocation(line: 1180, column: 3, scope: !584)
!618 = !DILocation(line: 1184, column: 3, scope: !584)
!619 = !DILocation(line: 1186, column: 9, scope: !584)
!620 = !DILocation(line: 1186, column: 22, scope: !584)
!621 = !{!622, !624, i64 8}
!622 = !{!"Options", !623, i64 0, !624, i64 8, !625, i64 16, !423, i64 24, !623, i64 28, !623, i64 29, !623, i64 30}
!623 = !{!"_Bool", !423, i64 0}
!624 = !{!"long", !423, i64 0}
!625 = !{!"long long", !423, i64 0}
!626 = !DILocation(line: 1187, column: 9, scope: !584)
!627 = !DILocation(line: 1187, column: 14, scope: !584)
!628 = !{!622, !625, i64 16}
!629 = !DILocation(line: 1189, column: 3, scope: !584)
!630 = !DILocation(line: 1176, column: 15, scope: !584)
!631 = !DILocation(line: 1189, column: 15, scope: !584)
!632 = !DILocation(line: 1189, column: 71, scope: !584)
!633 = !DILocation(line: 1191, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !584, file: !2, line: 1190, column: 5)
!635 = !DILocation(line: 1194, column: 17, scope: !636)
!636 = distinct !DILexicalBlock(scope: !634, file: !2, line: 1192, column: 9)
!637 = !DILocation(line: 1194, column: 23, scope: !636)
!638 = !{!622, !623, i64 0}
!639 = !DILocation(line: 1195, column: 11, scope: !636)
!640 = !DILocation(line: 1198, column: 44, scope: !636)
!641 = !DILocation(line: 1198, column: 32, scope: !636)
!642 = !DILocation(line: 1198, column: 17, scope: !636)
!643 = !DILocation(line: 1198, column: 30, scope: !636)
!644 = !DILocation(line: 1202, column: 11, scope: !636)
!645 = !DILocation(line: 1205, column: 15, scope: !646)
!646 = distinct !DILexicalBlock(scope: !636, file: !2, line: 1205, column: 15)
!647 = !DILocation(line: 1205, column: 29, scope: !646)
!648 = !DILocation(line: 1205, column: 33, scope: !646)
!649 = !DILocation(line: 1205, column: 15, scope: !636)
!650 = !DILocation(line: 1206, column: 13, scope: !646)
!651 = !DILocation(line: 1207, column: 27, scope: !636)
!652 = !DILocation(line: 1208, column: 11, scope: !636)
!653 = !DILocation(line: 1211, column: 15, scope: !654)
!654 = distinct !DILexicalBlock(scope: !636, file: !2, line: 1211, column: 15)
!655 = !DILocation(line: 1211, column: 22, scope: !654)
!656 = !DILocation(line: 1211, column: 15, scope: !636)
!657 = !DILocation(line: 1212, column: 19, scope: !654)
!658 = !DILocation(line: 1212, column: 31, scope: !654)
!659 = !{!622, !423, i64 24}
!660 = !DILocation(line: 1212, column: 13, scope: !654)
!661 = !DILocation(line: 1214, column: 33, scope: !654)
!662 = !{!423, !423, i64 0}
!663 = !DILocation(line: 1214, column: 19, scope: !654)
!664 = !DILocation(line: 1214, column: 31, scope: !654)
!665 = !DILocation(line: 1216, column: 11, scope: !636)
!666 = !DILocation(line: 1219, column: 36, scope: !636)
!667 = !DILocation(line: 1219, column: 24, scope: !636)
!668 = !DILocation(line: 1219, column: 17, scope: !636)
!669 = !DILocation(line: 1219, column: 22, scope: !636)
!670 = !DILocation(line: 1221, column: 11, scope: !636)
!671 = !DILocation(line: 1224, column: 17, scope: !636)
!672 = !DILocation(line: 1224, column: 25, scope: !636)
!673 = !{!622, !623, i64 28}
!674 = !DILocation(line: 1225, column: 11, scope: !636)
!675 = !DILocation(line: 1228, column: 17, scope: !636)
!676 = !DILocation(line: 1228, column: 23, scope: !636)
!677 = !{!622, !623, i64 29}
!678 = !DILocation(line: 1229, column: 11, scope: !636)
!679 = !DILocation(line: 1232, column: 17, scope: !636)
!680 = !DILocation(line: 1232, column: 27, scope: !636)
!681 = !{!622, !623, i64 30}
!682 = !DILocation(line: 1233, column: 11, scope: !636)
!683 = !DILocation(line: 1235, column: 9, scope: !636)
!684 = !DILocation(line: 1237, column: 9, scope: !636)
!685 = !DILocation(line: 1240, column: 11, scope: !636)
!686 = distinct !{!686, !629, !687, !545, !546}
!687 = !DILocation(line: 1242, column: 5, scope: !584)
!688 = !DILocation(line: 1244, column: 17, scope: !584)
!689 = !{!690, !690, i64 0}
!690 = !{!"int", !423, i64 0}
!691 = !DILocation(line: 1244, column: 15, scope: !584)
!692 = !DILocation(line: 1245, column: 20, scope: !584)
!693 = !DILocation(line: 1245, column: 18, scope: !584)
!694 = !DILocation(line: 1247, column: 15, scope: !695)
!695 = distinct !DILexicalBlock(scope: !584, file: !2, line: 1247, column: 7)
!696 = !DILocation(line: 1247, column: 7, scope: !584)
!697 = !DILocation(line: 1249, column: 7, scope: !698)
!698 = distinct !DILexicalBlock(scope: !695, file: !2, line: 1248, column: 5)
!699 = !DILocation(line: 1250, column: 7, scope: !698)
!700 = !DILocation(line: 1253, column: 20, scope: !584)
!701 = !DILocation(line: 1253, column: 18, scope: !584)
!702 = !DILocation(line: 1254, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !584, file: !2, line: 1254, column: 7)
!704 = !DILocation(line: 1254, column: 7, scope: !584)
!705 = !DILocation(line: 1255, column: 5, scope: !703)
!706 = !DILocation(line: 1257, column: 3, scope: !584)
!707 = !DILocation(line: 1259, column: 8, scope: !611)
!708 = !DILocation(line: 1259, scope: !611)
!709 = !DILocation(line: 1259, column: 17, scope: !610)
!710 = !DILocation(line: 1259, column: 3, scope: !611)
!711 = !DILocation(line: 1261, column: 30, scope: !609)
!712 = !DILocation(line: 1261, column: 21, scope: !609)
!713 = !DILocation(line: 0, scope: !609)
!714 = !DILocation(line: 1262, column: 11, scope: !715)
!715 = distinct !DILexicalBlock(scope: !609, file: !2, line: 1262, column: 11)
!716 = !DILocation(line: 1262, column: 11, scope: !609)
!717 = !DILocation(line: 1264, column: 47, scope: !718)
!718 = distinct !DILexicalBlock(scope: !715, file: !2, line: 1263, column: 9)
!719 = !DILocation(line: 1264, column: 17, scope: !718)
!720 = !DILocation(line: 1264, column: 14, scope: !718)
!721 = !DILocation(line: 1265, column: 9, scope: !718)
!722 = !DILocation(line: 1269, column: 27, scope: !723)
!723 = distinct !DILexicalBlock(scope: !715, file: !2, line: 1267, column: 9)
!724 = !DILocation(line: 1269, column: 43, scope: !723)
!725 = !DILocation(line: 1269, column: 17, scope: !723)
!726 = !DILocation(line: 1269, column: 14, scope: !723)
!727 = !DILocation(line: 0, scope: !715)
!728 = !DILocation(line: 1271, column: 7, scope: !609)
!729 = !DILocation(line: 1272, column: 5, scope: !609)
!730 = !DILocation(line: 1259, column: 29, scope: !610)
!731 = !DILocation(line: 1259, column: 3, scope: !610)
!732 = distinct !{!732, !710, !733, !545, !546}
!733 = !DILocation(line: 1272, column: 5, scope: !611)
!734 = !DILocation(line: 1274, column: 10, scope: !584)
!735 = !DILocation(line: 1275, column: 1, scope: !584)
!736 = !DILocation(line: 1274, column: 3, scope: !584)
!737 = !DISubprogram(name: "set_program_name", scope: !738, file: !738, line: 37, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!738 = !DIFile(filename: "../lib/progname.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!739 = !DISubprogram(name: "atexit", scope: !572, file: !572, line: 133, type: !740, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!740 = !DISubroutineType(types: !741)
!741 = !{!83, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!743 = !DISubprogram(name: "rpl_getopt_long", scope: !395, file: !395, line: 66, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!744 = !DISubroutineType(types: !745)
!745 = !{!83, !83, !587, !124, !746, !400}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!747 = !DISubprogram(name: "xdectoumax", scope: !748, file: !748, line: 33, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!748 = !DIFile(filename: "../lib/xdectoint.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!749 = !DISubroutineType(types: !750)
!750 = !{!141, !124, !141, !141, !124, !124, !83}
!751 = !DISubprogram(name: "error", scope: !752, file: !752, line: 395, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!752 = !DIFile(filename: "./lib/error.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!753 = !DISubroutineType(types: !754)
!754 = !{null, !83, !83, !124, null}
!755 = !DISubprogram(name: "__xargmatch_internal", scope: !756, file: !756, line: 94, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!756 = !DIFile(filename: "../lib/argmatch.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!757 = !DISubroutineType(types: !758)
!758 = !{!759, !124, !124, !762, !127, !137, !763, !592}
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !760, line: 35, baseType: !761)
!760 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stddef.h", directory: "")
!761 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !756, line: 66, baseType: !742)
!764 = !DISubprogram(name: "xnumtoumax", scope: !748, file: !748, line: 36, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!765 = !DISubroutineType(types: !766)
!766 = !{!141, !124, !83, !141, !141, !124, !124, !83}
!767 = !DISubprogram(name: "version_etc", scope: !768, file: !768, line: 65, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!768 = !DIFile(filename: "../lib/version-etc.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!769 = !DISubroutineType(types: !770)
!770 = !{null, !451, !124, !124, !124, null}
!771 = !DISubprogram(name: "randint_all_new", scope: !200, file: !200, line: 40, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!772 = !DISubroutineType(types: !773)
!773 = !{!198, !124, !137}
!774 = !DISubprogram(name: "__error", scope: !775, file: !775, line: 80, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!775 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/errno.h", directory: "")
!776 = !DISubroutineType(types: !777)
!777 = !{!400}
!778 = !DISubprogram(name: "quotearg_n_style_colon", scope: !88, file: !88, line: 403, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!779 = !DISubroutineType(types: !780)
!780 = !{!136, !83, !87, !124}
!781 = distinct !DISubprogram(name: "clear_random_data", scope: !2, file: !2, line: 1161, type: !509, scopeLine: 1162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !501)
!782 = !DILocation(line: 1163, column: 21, scope: !781)
!783 = !DILocation(line: 1163, column: 3, scope: !781)
!784 = !DILocation(line: 1164, column: 1, scope: !781)
!785 = !DISubprogram(name: "xstrdup", scope: !786, file: !786, line: 99, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!786 = !DIFile(filename: "../lib/xalloc.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!787 = !DISubroutineType(types: !788)
!788 = !{!136, !124}
!789 = distinct !DISubprogram(name: "wipefd", scope: !2, file: !2, line: 962, type: !790, scopeLine: 964, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !794)
!790 = !DISubroutineType(types: !791)
!791 = !{!592, !83, !124, !198, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!794 = !{!795, !796, !797, !798, !799}
!795 = !DILocalVariable(name: "fd", arg: 1, scope: !789, file: !2, line: 962, type: !83)
!796 = !DILocalVariable(name: "qname", arg: 2, scope: !789, file: !2, line: 962, type: !124)
!797 = !DILocalVariable(name: "s", arg: 3, scope: !789, file: !2, line: 962, type: !198)
!798 = !DILocalVariable(name: "flags", arg: 4, scope: !789, file: !2, line: 963, type: !792)
!799 = !DILocalVariable(name: "fd_flags", scope: !789, file: !2, line: 965, type: !83)
!800 = !DILocation(line: 0, scope: !789)
!801 = !DILocation(line: 965, column: 18, scope: !789)
!802 = !DILocation(line: 967, column: 16, scope: !803)
!803 = distinct !DILexicalBlock(scope: !789, file: !2, line: 967, column: 7)
!804 = !DILocation(line: 967, column: 7, scope: !789)
!805 = !DILocation(line: 969, column: 17, scope: !806)
!806 = distinct !DILexicalBlock(scope: !803, file: !2, line: 968, column: 5)
!807 = !DILocation(line: 969, column: 7, scope: !806)
!808 = !DILocation(line: 970, column: 7, scope: !806)
!809 = !DILocation(line: 972, column: 16, scope: !810)
!810 = distinct !DILexicalBlock(scope: !789, file: !2, line: 972, column: 7)
!811 = !DILocation(line: 972, column: 7, scope: !789)
!812 = !DILocation(line: 974, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !810, file: !2, line: 973, column: 5)
!814 = !DILocation(line: 975, column: 7, scope: !813)
!815 = !DILocation(line: 977, column: 10, scope: !789)
!816 = !DILocation(line: 977, column: 3, scope: !789)
!817 = !DILocation(line: 978, column: 1, scope: !789)
!818 = distinct !DISubprogram(name: "wipefile", scope: !2, file: !2, line: 1125, type: !819, scopeLine: 1127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{!592, !136, !124, !198, !792}
!821 = !{!822, !823, !824, !825, !826, !827}
!822 = !DILocalVariable(name: "name", arg: 1, scope: !818, file: !2, line: 1125, type: !136)
!823 = !DILocalVariable(name: "qname", arg: 2, scope: !818, file: !2, line: 1125, type: !124)
!824 = !DILocalVariable(name: "s", arg: 3, scope: !818, file: !2, line: 1126, type: !198)
!825 = !DILocalVariable(name: "flags", arg: 4, scope: !818, file: !2, line: 1126, type: !792)
!826 = !DILocalVariable(name: "ok", scope: !818, file: !2, line: 1128, type: !592)
!827 = !DILocalVariable(name: "fd", scope: !818, file: !2, line: 1129, type: !83)
!828 = !DILocation(line: 0, scope: !818)
!829 = !DILocation(line: 1131, column: 8, scope: !818)
!830 = !DILocation(line: 1132, column: 10, scope: !831)
!831 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1132, column: 7)
!832 = !DILocation(line: 1133, column: 7, scope: !831)
!833 = !DILocation(line: 1133, column: 11, scope: !831)
!834 = !DILocation(line: 1133, column: 17, scope: !831)
!835 = !DILocation(line: 1133, column: 27, scope: !831)
!836 = !DILocation(line: 1133, column: 37, scope: !831)
!837 = !{i8 0, i8 2}
!838 = !DILocation(line: 1134, column: 7, scope: !831)
!839 = !DILocation(line: 1134, column: 10, scope: !831)
!840 = !DILocation(line: 1134, column: 32, scope: !831)
!841 = !DILocation(line: 1132, column: 7, scope: !818)
!842 = !DILocation(line: 1135, column: 10, scope: !831)
!843 = !DILocation(line: 1135, column: 5, scope: !831)
!844 = !DILocation(line: 1136, column: 10, scope: !845)
!845 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1136, column: 7)
!846 = !DILocation(line: 1136, column: 7, scope: !818)
!847 = !DILocation(line: 1138, column: 17, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !2, line: 1137, column: 5)
!849 = !DILocation(line: 1138, column: 7, scope: !848)
!850 = !DILocation(line: 1139, column: 7, scope: !848)
!851 = !DILocation(line: 1142, column: 8, scope: !818)
!852 = !DILocation(line: 1142, column: 6, scope: !818)
!853 = !DILocation(line: 1143, column: 7, scope: !854)
!854 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1143, column: 7)
!855 = !DILocation(line: 1143, column: 18, scope: !854)
!856 = !DILocation(line: 1143, column: 7, scope: !818)
!857 = !DILocation(line: 1145, column: 17, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !2, line: 1144, column: 5)
!859 = !DILocation(line: 1145, column: 7, scope: !858)
!860 = !DILocation(line: 1147, column: 5, scope: !858)
!861 = !DILocation(line: 1148, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !818, file: !2, line: 1148, column: 7)
!863 = !DILocation(line: 1148, column: 10, scope: !862)
!864 = !DILocation(line: 1148, column: 20, scope: !862)
!865 = !DILocation(line: 1148, column: 13, scope: !862)
!866 = !DILocation(line: 1148, column: 7, scope: !818)
!867 = !DILocation(line: 1149, column: 10, scope: !862)
!868 = !DILocation(line: 1149, column: 8, scope: !862)
!869 = !DILocation(line: 1149, column: 5, scope: !862)
!870 = !DILocation(line: 1150, column: 10, scope: !818)
!871 = !DILocation(line: 1150, column: 3, scope: !818)
!872 = !DILocation(line: 1151, column: 1, scope: !818)
!873 = !DISubprogram(name: "rpl_free", scope: !874, file: !874, line: 756, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!874 = !DIFile(filename: "./lib/stdlib.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!875 = !DISubroutineType(types: !876)
!876 = !{null, !126}
!877 = !DISubprogram(name: "open_safer", scope: !878, file: !878, line: 22, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!878 = !DIFile(filename: "../lib/fcntl-safer.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!879 = !DISubroutineType(types: !880)
!880 = !{!83, !124, !83, null}
!881 = !DISubprogram(name: "chmod", linkageName: "\01_chmod", scope: !882, file: !882, line: 380, type: !883, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !501)
!882 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!883 = !DISubroutineType(types: !884)
!884 = !{!83, !124, !885}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !886, line: 31, baseType: !887)
!886 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !132, line: 70, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !134, line: 45, baseType: !889)
!889 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!890 = distinct !DISubprogram(name: "do_wipefd", scope: !2, file: !2, line: 820, type: !790, scopeLine: 822, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !947, !948, !949, !950, !951, !952, !956, !963, !966, !968, !969, !973, !974}
!892 = !DILocalVariable(name: "fd", arg: 1, scope: !890, file: !2, line: 820, type: !83)
!893 = !DILocalVariable(name: "qname", arg: 2, scope: !890, file: !2, line: 820, type: !124)
!894 = !DILocalVariable(name: "s", arg: 3, scope: !890, file: !2, line: 820, type: !198)
!895 = !DILocalVariable(name: "flags", arg: 4, scope: !890, file: !2, line: 821, type: !792)
!896 = !DILocalVariable(name: "i", scope: !890, file: !2, line: 823, type: !137)
!897 = !DILocalVariable(name: "st", scope: !890, file: !2, line: 824, type: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !882, line: 182, size: 1152, elements: !899)
!899 = !{!900, !905, !906, !909, !913, !918, !922, !923, !930, !931, !932, !933, !934, !938, !942, !943, !944, !945}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !898, file: !882, line: 182, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !902, line: 31, baseType: !903)
!902 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !132, line: 57, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !134, line: 46, baseType: !83)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !898, file: !882, line: 182, baseType: !885, size: 16, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !898, file: !882, line: 182, baseType: !907, size: 16, offset: 48)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !908, line: 31, baseType: !888)
!908 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!909 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !898, file: !882, line: 182, baseType: !910, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !132, line: 62, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !134, line: 49, baseType: !912)
!912 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !898, file: !882, line: 182, baseType: !914, size: 32, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !915, line: 31, baseType: !916)
!915 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !132, line: 75, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !134, line: 47, baseType: !69)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !898, file: !882, line: 182, baseType: !919, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !920, line: 31, baseType: !921)
!920 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !132, line: 60, baseType: !917)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !898, file: !882, line: 182, baseType: !901, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !898, file: !882, line: 182, baseType: !924, size: 128, offset: 256)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !925, line: 33, size: 128, elements: !926)
!925 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!926 = !{!927, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !924, file: !925, line: 35, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !134, line: 122, baseType: !761)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !924, file: !925, line: 36, baseType: !761, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !898, file: !882, line: 182, baseType: !924, size: 128, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !898, file: !882, line: 182, baseType: !924, size: 128, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !898, file: !882, line: 182, baseType: !924, size: 128, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !898, file: !882, line: 182, baseType: !129, size: 64, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !898, file: !882, line: 182, baseType: !935, size: 64, offset: 832)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !936, line: 31, baseType: !937)
!936 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !132, line: 55, baseType: !133)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !898, file: !882, line: 182, baseType: !939, size: 32, offset: 896)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !940, line: 31, baseType: !941)
!940 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !132, line: 56, baseType: !904)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !898, file: !882, line: 182, baseType: !917, size: 32, offset: 928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !898, file: !882, line: 182, baseType: !917, size: 32, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !898, file: !882, line: 182, baseType: !904, size: 32, offset: 992)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !898, file: !882, line: 182, baseType: !946, size: 128, offset: 1024)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !194)
!947 = !DILocalVariable(name: "size", scope: !890, file: !2, line: 825, type: !129)
!948 = !DILocalVariable(name: "i_size", scope: !890, file: !2, line: 826, type: !129)
!949 = !DILocalVariable(name: "n", scope: !890, file: !2, line: 827, type: !140)
!950 = !DILocalVariable(name: "passarray", scope: !890, file: !2, line: 828, type: !400)
!951 = !DILocalVariable(name: "ok", scope: !890, file: !2, line: 829, type: !592)
!952 = !DILocalVariable(name: "rs", scope: !890, file: !2, line: 830, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "randread_source", file: !955, line: 25, flags: DIFlagFwdDecl)
!955 = !DIFile(filename: "../lib/randread.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!956 = !DILocalVariable(name: "remainder", scope: !957, file: !2, line: 871, type: !129)
!957 = distinct !DILexicalBlock(scope: !958, file: !2, line: 869, column: 13)
!958 = distinct !DILexicalBlock(scope: !959, file: !2, line: 868, column: 15)
!959 = distinct !DILexicalBlock(scope: !960, file: !2, line: 865, column: 9)
!960 = distinct !DILexicalBlock(scope: !961, file: !2, line: 864, column: 11)
!961 = distinct !DILexicalBlock(scope: !962, file: !2, line: 863, column: 5)
!962 = distinct !DILexicalBlock(scope: !890, file: !2, line: 862, column: 7)
!963 = !DILocalVariable(name: "size_incr", scope: !964, file: !2, line: 876, type: !129)
!964 = distinct !DILexicalBlock(scope: !965, file: !2, line: 875, column: 17)
!965 = distinct !DILexicalBlock(scope: !957, file: !2, line: 874, column: 19)
!966 = !DILocalVariable(name: "pass_size", scope: !967, file: !2, line: 906, type: !129)
!967 = distinct !DILexicalBlock(scope: !890, file: !2, line: 905, column: 5)
!968 = !DILocalVariable(name: "pn", scope: !967, file: !2, line: 907, type: !140)
!969 = !DILocalVariable(name: "err", scope: !970, file: !2, line: 928, type: !83)
!970 = distinct !DILexicalBlock(scope: !971, file: !2, line: 927, column: 9)
!971 = distinct !DILexicalBlock(scope: !972, file: !2, line: 926, column: 7)
!972 = distinct !DILexicalBlock(scope: !967, file: !2, line: 926, column: 7)
!973 = !DILocalVariable(name: "type", scope: !970, file: !2, line: 929, type: !83)
!974 = !DILabel(scope: !890, name: "wipefd_out", file: !2, line: 955)
!975 = !DILocation(line: 0, scope: !890)
!976 = !DILocation(line: 824, column: 3, scope: !890)
!977 = !DILocation(line: 824, column: 15, scope: !890)
!978 = !DILocation(line: 833, column: 14, scope: !979)
!979 = distinct !DILexicalBlock(scope: !890, file: !2, line: 833, column: 7)
!980 = !DILocation(line: 833, column: 7, scope: !890)
!981 = !DILocation(line: 834, column: 16, scope: !979)
!982 = !DILocation(line: 834, column: 38, scope: !979)
!983 = !DILocation(line: 834, column: 31, scope: !979)
!984 = !DILocation(line: 834, column: 29, scope: !979)
!985 = !DILocation(line: 834, column: 5, scope: !979)
!986 = !DILocation(line: 836, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !890, file: !2, line: 836, column: 7)
!988 = !DILocation(line: 836, column: 7, scope: !890)
!989 = !DILocation(line: 838, column: 17, scope: !990)
!990 = distinct !DILexicalBlock(scope: !987, file: !2, line: 837, column: 5)
!991 = !DILocation(line: 838, column: 7, scope: !990)
!992 = !DILocation(line: 839, column: 7, scope: !990)
!993 = !DILocation(line: 845, column: 8, scope: !994)
!994 = distinct !DILexicalBlock(scope: !890, file: !2, line: 845, column: 7)
!995 = !{!996, !997, i64 4}
