; ModuleID = 'coreutils-9.3/build/src/stat.ll'
source_filename = "llvm-link"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.rpl_option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct._RuneLocale = type { [8 x i8], [32 x i8], ptr, ptr, i32, [256 x i32], [256 x i32], [256 x i32], %struct._RuneRange, %struct._RuneRange, %struct._RuneRange, ptr, i32, i32, ptr }
%struct._RuneRange = type { i32, ptr }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.statfs = type { i32, i32, i64, i64, i64, i64, i64, %struct.fsid, i32, i32, i32, i32, [16 x i8], [1024 x i8], [1024 x i8], i32, [7 x i32] }
%struct.fsid = type { [2 x i32] }
%struct.stat = type { i32, i16, i16, i64, i32, i32, i32, %struct.timespec, %struct.timespec, %struct.timespec, %struct.timespec, i64, i64, i32, i32, i32, i32, [2 x i64] }
%struct.timespec = type { i64, i64 }
%struct.print_args = type { ptr, %struct.timespec }
%struct.passwd = type { ptr, ptr, i32, i32, i64, ptr, ptr, ptr, ptr, i64 }
%struct.group = type { ptr, ptr, i32, ptr }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i32, i8, ptr }

@__stderrp = external global ptr, align 8

!104 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!105 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!106 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!107 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!108 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!109 = !DIEnumerator(name: "c_quoting_style", value: 5)
!110 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!111 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!112 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!113 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!114 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !116, file: !2, line: 1142, baseType: !87, size: 32, elements: !156)
!116 = distinct !DISubprogram(name: "print_it", scope: !2, file: !2, line: 1133, type: !117, scopeLine: 1137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !131)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120, !97, !120, !122, !129}
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!119, !125, !126, !4, !4, !97, !120, !129}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "/usr/local/Cellar/llvm/16.0.4/lib/clang/16/include/stddef.h", directory: "")
!128 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !147, !148, !149, !152, !153}
!132 = !DILocalVariable(name: "format", arg: 1, scope: !116, file: !2, line: 1133, type: !120)
!133 = !DILocalVariable(name: "fd", arg: 2, scope: !116, file: !2, line: 1133, type: !97)
!134 = !DILocalVariable(name: "filename", arg: 3, scope: !116, file: !2, line: 1133, type: !120)
!135 = !DILocalVariable(name: "print_func", arg: 4, scope: !116, file: !2, line: 1134, type: !122)
!136 = !DILocalVariable(name: "data", arg: 5, scope: !116, file: !2, line: 1136, type: !129)
!137 = !DILocalVariable(name: "fail", scope: !116, file: !2, line: 1138, type: !119)
!138 = !DILocalVariable(name: "n_alloc", scope: !116, file: !2, line: 1149, type: !126)
!139 = !DILocalVariable(name: "dest", scope: !116, file: !2, line: 1150, type: !125)
!140 = !DILocalVariable(name: "b", scope: !116, file: !2, line: 1151, type: !120)
!141 = !DILocalVariable(name: "len", scope: !142, file: !2, line: 1158, type: !126)
!142 = distinct !DILexicalBlock(scope: !143, file: !2, line: 1157, column: 11)
!143 = distinct !DILexicalBlock(scope: !144, file: !2, line: 1155, column: 9)
!144 = distinct !DILexicalBlock(scope: !145, file: !2, line: 1153, column: 5)
!145 = distinct !DILexicalBlock(scope: !146, file: !2, line: 1152, column: 3)
!146 = distinct !DILexicalBlock(scope: !116, file: !2, line: 1152, column: 3)
!147 = !DILocalVariable(name: "fmt_char", scope: !142, file: !2, line: 1159, type: !4)
!148 = !DILocalVariable(name: "mod_char", scope: !142, file: !2, line: 1160, type: !4)
!149 = !DILocalVariable(name: "esc_value", scope: !150, file: !2, line: 1211, type: !97)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 1210, column: 13)
!151 = distinct !DILexicalBlock(scope: !143, file: !2, line: 1209, column: 15)
!152 = !DILocalVariable(name: "esc_length", scope: !150, file: !2, line: 1212, type: !97)
!153 = !DILocalVariable(name: "esc_value", scope: !154, file: !2, line: 1223, type: !97)
!154 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1222, column: 13)
!155 = distinct !DILexicalBlock(scope: !151, file: !2, line: 1221, column: 20)
!156 = !{!157}
!157 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2)
!158 = !{!120, !129, !125, !159, !160, !231, !233, !126, !235, !210, !87, !237}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_args", file: !2, line: 1284, size: 192, elements: !162)
!162 = !{!163, !230}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !161, file: !2, line: 1285, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !166, line: 182, size: 1152, elements: !167)
!166 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/stat.h", directory: "")
!167 = !{!168, !175, !181, !184, !188, !193, !197, !198, !206, !207, !208, !209, !215, !219, !223, !224, !225, !226}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !165, file: !166, line: 182, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !170, line: 31, baseType: !171)
!170 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_dev_t.h", directory: "")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_dev_t", file: !172, line: 57, baseType: !173)
!172 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types.h", directory: "")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !174, line: 46, baseType: !97)
!174 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/i386/_types.h", directory: "")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !165, file: !166, line: 182, baseType: !176, size: 16, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !177, line: 31, baseType: !178)
!177 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_mode_t.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mode_t", file: !172, line: 70, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !174, line: 45, baseType: !180)
!180 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !165, file: !166, line: 182, baseType: !182, size: 16, offset: 48)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !183, line: 31, baseType: !179)
!183 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_nlink_t.h", directory: "")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !165, file: !166, line: 182, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ino64_t", file: !172, line: 62, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !174, line: 49, baseType: !187)
!187 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !165, file: !166, line: 182, baseType: !189, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !190, line: 31, baseType: !191)
!190 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_uid_t.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_uid_t", file: !172, line: 75, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !174, line: 47, baseType: !87)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !165, file: !166, line: 182, baseType: !194, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !195, line: 31, baseType: !196)
!195 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_gid_t.h", directory: "")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_gid_t", file: !172, line: 60, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !165, file: !166, line: 182, baseType: !169, size: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_atimespec", scope: !165, file: !166, line: 182, baseType: !199, size: 128, offset: 256)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !200, line: 33, size: 128, elements: !201)
!200 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_timespec.h", directory: "")
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !199, file: !200, line: 35, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_time_t", file: !174, line: 122, baseType: !204)
!204 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !199, file: !200, line: 36, baseType: !204, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtimespec", scope: !165, file: !166, line: 182, baseType: !199, size: 128, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctimespec", scope: !165, file: !166, line: 182, baseType: !199, size: 128, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_birthtimespec", scope: !165, file: !166, line: 182, baseType: !199, size: 128, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !165, file: !166, line: 182, baseType: !210, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !211, line: 31, baseType: !212)
!211 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_off_t.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !172, line: 71, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !174, line: 48, baseType: !214)
!214 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !165, file: !166, line: 182, baseType: !216, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "blkcnt_t", file: !217, line: 31, baseType: !218)
!217 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blkcnt_t.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blkcnt_t", file: !172, line: 55, baseType: !213)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !165, file: !166, line: 182, baseType: !220, size: 32, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "blksize_t", file: !221, line: 31, baseType: !222)
!221 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_blksize_t.h", directory: "")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_blksize_t", file: !172, line: 56, baseType: !173)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_flags", scope: !165, file: !166, line: 182, baseType: !192, size: 32, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_gen", scope: !165, file: !166, line: 182, baseType: !192, size: 32, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_lspare", scope: !165, file: !166, line: 182, baseType: !173, size: 32, offset: 992)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_qspare", scope: !165, file: !166, line: 182, baseType: !227, size: 128, offset: 1024)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !161, file: !2, line: 1286, baseType: !199, size: 128, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !232, line: 30, baseType: !97)
!232 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_int32_t.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !234, line: 30, baseType: !87)
!234 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_u_int32_t.h", directory: "")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !236, line: 32, baseType: !128)
!236 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !239, file: !2, line: 880, baseType: !87)
!239 = distinct !DISubprogram(name: "print_statfs", scope: !2, file: !2, line: 862, type: !123, scopeLine: 865, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !290, !291, !296, !297, !298, !300, !303}
!241 = !DILocalVariable(name: "pformat", arg: 1, scope: !239, file: !2, line: 862, type: !125)
!242 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !239, file: !2, line: 862, type: !126)
!243 = !DILocalVariable(name: "mod", arg: 3, scope: !239, file: !2, line: 862, type: !4)
!244 = !DILocalVariable(name: "m", arg: 4, scope: !239, file: !2, line: 862, type: !4)
!245 = !DILocalVariable(name: "fd", arg: 5, scope: !239, file: !2, line: 863, type: !97)
!246 = !DILocalVariable(name: "filename", arg: 6, scope: !239, file: !2, line: 863, type: !120)
!247 = !DILocalVariable(name: "data", arg: 7, scope: !239, file: !2, line: 864, type: !129)
!248 = !DILocalVariable(name: "statfsbuf", scope: !239, file: !2, line: 866, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !252, line: 130, size: 17344, elements: !253)
!252 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/mount.h", directory: "")
!253 = !{!254, !257, !258, !261, !262, !263, !264, !265, !272, !273, !274, !275, !276, !280, !284, !285, !286}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !251, file: !252, line: 130, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !256, line: 31, baseType: !87)
!256 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_types/_uint32_t.h", directory: "")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_iosize", scope: !251, file: !252, line: 130, baseType: !231, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !251, file: !252, line: 130, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !260, line: 31, baseType: !187)
!260 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_types/_uint64_t.h", directory: "")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !251, file: !252, line: 130, baseType: !259, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !251, file: !252, line: 130, baseType: !259, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !251, file: !252, line: 130, baseType: !259, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !251, file: !252, line: 130, baseType: !259, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !251, file: !252, line: 130, baseType: !266, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_t", file: !267, line: 31, baseType: !268)
!267 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/_types/_fsid_t.h", directory: "")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsid", file: !267, line: 31, size: 64, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !268, file: !267, line: 31, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 64, elements: !228)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "f_owner", scope: !251, file: !252, line: 130, baseType: !189, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !251, file: !252, line: 130, baseType: !255, size: 32, offset: 480)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !251, file: !252, line: 130, baseType: !255, size: 32, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "f_fssubtype", scope: !251, file: !252, line: 130, baseType: !255, size: 32, offset: 544)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "f_fstypename", scope: !251, file: !252, line: 130, baseType: !277, size: 128, offset: 576)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_mntonname", scope: !251, file: !252, line: 130, baseType: !281, size: 8192, offset: 704)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "f_mntfromname", scope: !251, file: !252, line: 130, baseType: !281, size: 8192, offset: 8896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags_ext", scope: !251, file: !252, line: 130, baseType: !255, size: 32, offset: 17088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "f_reserved", scope: !251, file: !252, line: 130, baseType: !287, size: 224, offset: 17120)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 224, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 7)
!290 = !DILocalVariable(name: "fail", scope: !239, file: !2, line: 867, type: !119)
!291 = !DILocalVariable(name: "p", scope: !292, file: !2, line: 885, type: !294)
!292 = distinct !DILexicalBlock(scope: !293, file: !2, line: 876, column: 7)
!293 = distinct !DILexicalBlock(scope: !239, file: !2, line: 870, column: 5)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!296 = !DILocalVariable(name: "fsid", scope: !292, file: !2, line: 889, type: !235)
!297 = !DILocalVariable(name: "words", scope: !292, file: !2, line: 890, type: !97)
!298 = !DILocalVariable(name: "i", scope: !299, file: !2, line: 891, type: !97)
!299 = distinct !DILexicalBlock(scope: !292, file: !2, line: 891, column: 9)
!300 = !DILocalVariable(name: "u", scope: !301, file: !2, line: 893, type: !235)
!301 = distinct !DILexicalBlock(scope: !302, file: !2, line: 892, column: 11)
!302 = distinct !DILexicalBlock(scope: !299, file: !2, line: 891, column: 9)
!303 = !DILocalVariable(name: "frsize", scope: !304, file: !2, line: 928, type: !235)
!304 = distinct !DILexicalBlock(scope: !293, file: !2, line: 927, column: 7)
!305 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !306, !311, !316, !321, !326, !329, !334, !336, !341, !346, !351, !353, !358, !360, !362, !364, !366, !368, !370, !82, !375, !380, !382, !384, !389, !394, !396, !398, !400, !402, !404, !409, !414, !419, !424, !426, !431, !436, !441, !443, !445, !448, !450, !452, !454, !456, !461, !473, !475, !479, !481, !483, !485, !489, !491, !496, !501, !506, !508, !513, !518, !520, !525, !527, !529, !534, !536, !541, !544, !549, !554, !556, !558, !560, !562, !564, !566, !568, !570, !579, !581, !586, !615, !617, !619, !624, !656, !662, !664, !669, !671, !673, !678, !680, !682, !684, !686, !691, !693}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1869, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 68)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1874, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1528, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 191)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1874, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 5)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1892, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 1)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1897, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !228)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 6)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1915, type: !328, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1931, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 9)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 14)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 15)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1958, type: !277, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1964, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 3)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "follow_links", scope: !84, file: !2, line: 235, type: !119, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !84, file: !2, line: 239, type: !119, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "decimal_point", scope: !84, file: !2, line: 246, type: !120, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !84, file: !2, line: 247, type: !126, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "dont_sync", scope: !84, file: !2, line: 1290, type: !119, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "force_sync", scope: !84, file: !2, line: 1293, type: !119, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !96, line: 586, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 75)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !84, file: !2, line: 189, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 272, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 34)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !96, line: 660, type: !328, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !96, line: 660, type: !277, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !96, line: 661, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 10)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !96, line: 661, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 22)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !96, line: 662, type: !386, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !96, line: 662, type: !348, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !96, line: 663, type: !386, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !96, line: 664, type: !386, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !96, line: 665, type: !386, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !96, line: 678, type: !406, isLocal: true, isDefinition: true)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 23)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !96, line: 678, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 40)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !96, line: 683, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !96, line: 689, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 71)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !96, line: 695, type: !318, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !96, line: 696, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 27)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !96, line: 698, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 51)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !96, line: 699, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 12)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !438, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !438, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !288)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !447, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !331, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !447, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !318, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 8)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "long_options", scope: !84, file: !2, line: 221, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 2304, elements: !339)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rpl_option", file: !466, line: 50, size: 256, elements: !467)
!466 = !DIFile(filename: "../lib/getopt-ext.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!467 = !{!468, !469, !470, !472}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !465, file: !466, line: 52, baseType: !120, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !465, file: !466, line: 55, baseType: !97, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 56, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !465, file: !466, line: 57, baseType: !97, size: 32, offset: 192)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !84, file: !2, line: 243, type: !120, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "cached_modes", scope: !84, file: !2, line: 216, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 96, elements: !356)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !458, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !331, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !447, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "cached_args", scope: !84, file: !2, line: 211, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 256, elements: !417)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1055, type: !343, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1064, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 65)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1675, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1376, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 172)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1696, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 58)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1706, type: !318, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1706, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 64)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 41)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1723, type: !39, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1741, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 45)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1266, type: !328, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !308, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1275, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 43)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1174, type: !391, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1236, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 36)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "printf_flags", scope: !84, file: !2, line: 186, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !459)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "digits", scope: !84, file: !2, line: 178, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 88, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 11)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !551, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 29)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1532, type: !318, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1572, type: !458, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 693, type: !328, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 705, type: !416, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 705, type: !355, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !416, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !355, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !355, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "modebuf", scope: !572, file: !2, line: 639, type: !438, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "human_access", scope: !2, file: !2, line: 637, type: !573, scopeLine: 638, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !577)
!573 = !DISubroutineType(types: !574)
!574 = !{!125, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!577 = !{!578}
!578 = !DILocalVariable(name: "statbuf", arg: 1, scope: !572, file: !2, line: 637, type: !575)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 996, type: !328, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1007, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 26)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "mount_list", scope: !588, file: !2, line: 956, type: !596, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "find_bind_mount", scope: !2, file: !2, line: 952, type: !589, scopeLine: 953, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{!120, !120}
!591 = !{!592, !593, !594, !595, !609}
!592 = !DILocalVariable(name: "name", arg: 1, scope: !588, file: !2, line: 952, type: !120)
!593 = !DILocalVariable(name: "bind_mount", scope: !588, file: !2, line: 954, type: !120)
!594 = !DILocalVariable(name: "name_stats", scope: !588, file: !2, line: 965, type: !165)
!595 = !DILocalVariable(name: "me", scope: !588, file: !2, line: 969, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !598, line: 25, size: 384, elements: !599)
!598 = !DIFile(filename: "../lib/mountlist.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !597, file: !598, line: 27, baseType: !125, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !597, file: !598, line: 28, baseType: !125, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !597, file: !598, line: 29, baseType: !125, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !597, file: !598, line: 31, baseType: !125, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !597, file: !598, line: 32, baseType: !169, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !597, file: !598, line: 33, baseType: !87, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !597, file: !598, line: 34, baseType: !87, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !597, file: !598, line: 35, baseType: !87, size: 1, offset: 290, flags: DIFlagBitField, extraData: i64 288)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !597, file: !598, line: 36, baseType: !596, size: 64, offset: 320)
!609 = !DILocalVariable(name: "dev_stats", scope: !610, file: !2, line: 975, type: !165)
!610 = distinct !DILexicalBlock(scope: !611, file: !2, line: 974, column: 9)
!611 = distinct !DILexicalBlock(scope: !612, file: !2, line: 972, column: 11)
!612 = distinct !DILexicalBlock(scope: !613, file: !2, line: 971, column: 5)
!613 = distinct !DILexicalBlock(scope: !614, file: !2, line: 970, column: 3)
!614 = distinct !DILexicalBlock(scope: !588, file: !2, line: 970, column: 3)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !588, file: !2, line: 957, type: !119, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 961, type: !355, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 961, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 42)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "str", scope: !626, file: !2, line: 652, type: !653, isLocal: true, isDefinition: true)
!626 = distinct !DISubprogram(name: "human_time", scope: !2, file: !2, line: 647, type: !627, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!125, !199}
!629 = !{!630, !631, !646, !647}
!630 = !DILocalVariable(name: "t", arg: 1, scope: !626, file: !2, line: 647, type: !199)
!631 = !DILocalVariable(name: "tm", scope: !626, file: !2, line: 659, type: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !633, line: 75, size: 448, elements: !634)
!633 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/time.h", directory: "")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !632, file: !633, line: 76, baseType: !97, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !632, file: !633, line: 77, baseType: !97, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !632, file: !633, line: 78, baseType: !97, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !632, file: !633, line: 79, baseType: !97, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !632, file: !633, line: 80, baseType: !97, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !632, file: !633, line: 81, baseType: !97, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !632, file: !633, line: 82, baseType: !97, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !632, file: !633, line: 83, baseType: !97, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !632, file: !633, line: 84, baseType: !97, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !632, file: !633, line: 85, baseType: !204, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !632, file: !633, line: 86, baseType: !125, size: 64, offset: 384)
!646 = !DILocalVariable(name: "ns", scope: !626, file: !2, line: 660, type: !97)
!647 = !DILocalVariable(name: "secbuf", scope: !648, file: !2, line: 665, type: !650)
!648 = distinct !DILexicalBlock(scope: !649, file: !2, line: 664, column: 5)
!649 = distinct !DILexicalBlock(scope: !626, file: !2, line: 661, column: 7)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 21)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 61)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "tz", scope: !626, file: !2, line: 656, type: !658, isLocal: true, isDefinition: true)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !659, line: 896, baseType: !660)
!659 = !DIFile(filename: "./lib/time.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !659, line: 896, flags: DIFlagFwdDecl)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 658, type: !355, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 24)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !2, line: 666, type: !458, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 790, type: !355, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 829, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 13)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !331, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !416, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 699, type: !355, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 847, type: !14, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1110, type: !688, isLocal: true, isDefinition: true)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 35)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1472, type: !428, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1483, type: !348, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 392, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 49)
!698 = !{!"Homebrew clang version 16.0.4"}
!699 = !{i32 7, !"Dwarf Version", i32 4}
!700 = !{i32 2, !"Debug Info Version", i32 3}
!701 = !{i32 1, !"wchar_size", i32 4}
!702 = !{i32 8, !"PIC Level", i32 2}
!703 = !{i32 7, !"uwtable", i32 2}
!704 = !{i32 7, !"frame-pointer", i32 2}
!705 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 1752, type: !706, scopeLine: 1753, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !97}
!708 = !{!709}
!709 = !DILocalVariable(name: "status", arg: 1, scope: !705, file: !2, line: 1752, type: !97)
!710 = !DILocation(line: 0, scope: !705)
!711 = !DILocation(line: 1754, column: 14, scope: !712)
!712 = distinct !DILexicalBlock(scope: !705, file: !2, line: 1754, column: 7)
!713 = !DILocation(line: 1754, column: 7, scope: !705)
!714 = !DILocation(line: 1755, column: 5, scope: !712)
!715 = !DILocation(line: 1755, column: 5, scope: !716)
!716 = distinct !DILexicalBlock(scope: !712, file: !2, line: 1755, column: 5)
!717 = !{!718, !718, i64 0}
!718 = !{!"any pointer", !719, i64 0}
!719 = !{!"omnipotent char", !720, i64 0}
!720 = !{!"Simple C/C++ TBAA"}
!721 = !DILocation(line: 1758, column: 53, scope: !722)
!722 = distinct !DILexicalBlock(scope: !712, file: !2, line: 1757, column: 5)
!723 = !DILocation(line: 1758, column: 7, scope: !722)
!724 = !DILocation(line: 1761, column: 5, scope: !722)
!725 = !DILocation(line: 1759, column: 7, scope: !722)
!726 = !DILocation(line: 1763, column: 7, scope: !722)
!727 = !DILocation(line: 1768, column: 5, scope: !722)
!728 = !DILocation(line: 1765, column: 7, scope: !722)
!729 = !DILocation(line: 1772, column: 5, scope: !722)
!730 = !DILocation(line: 1769, column: 7, scope: !722)
!731 = !DILocation(line: 1780, column: 5, scope: !722)
!732 = !DILocation(line: 1773, column: 7, scope: !722)
!733 = !DILocation(line: 1781, column: 39, scope: !722)
!734 = !DILocation(line: 1781, column: 7, scope: !722)
!735 = !DILocation(line: 1782, column: 42, scope: !722)
!736 = !DILocation(line: 1782, column: 7, scope: !722)
!737 = !DILocation(line: 1789, column: 5, scope: !722)
!738 = !DILocation(line: 1784, column: 7, scope: !722)
!739 = !DILocation(line: 1799, column: 5, scope: !722)
!740 = !DILocation(line: 1791, column: 7, scope: !722)
!741 = !DILocation(line: 1809, column: 5, scope: !722)
!742 = !DILocation(line: 1800, column: 7, scope: !722)
!743 = !DILocation(line: 1824, column: 5, scope: !722)
!744 = !DILocation(line: 1810, column: 7, scope: !722)
!745 = !DILocation(line: 1837, column: 5, scope: !722)
!746 = !DILocation(line: 1825, column: 7, scope: !722)
!747 = !DILocation(line: 1847, column: 5, scope: !722)
!748 = !DILocation(line: 1839, column: 7, scope: !722)
!749 = !DILocation(line: 1856, column: 5, scope: !722)
!750 = !DILocation(line: 1848, column: 7, scope: !722)
!751 = !DILocation(line: 1858, column: 7, scope: !722)
!752 = !DILocation(line: 1869, column: 9, scope: !722)
!753 = !DILocation(line: 1874, column: 7, scope: !722)
!754 = !DILocation(line: 1875, column: 7, scope: !722)
!755 = !DILocation(line: 1877, column: 3, scope: !705)
!756 = !DISubprogram(name: "fprintf", scope: !757, file: !757, line: 155, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!757 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdio.h", directory: "")
!758 = !DISubroutineType(types: !759)
!759 = !{!97, !760, !810, null}
!760 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !763, line: 157, baseType: !764)
!763 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_stdio.h", directory: "")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !763, line: 126, size: 1216, elements: !765)
!765 = !{!766, !769, !770, !771, !773, !774, !779, !780, !781, !785, !789, !794, !798, !799, !802, !803, !805, !807, !808, !809}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !764, file: !763, line: 127, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !764, file: !763, line: 128, baseType: !97, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !764, file: !763, line: 129, baseType: !97, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !764, file: !763, line: 130, baseType: !772, size: 16, offset: 128)
!772 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !764, file: !763, line: 131, baseType: !772, size: 16, offset: 144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !764, file: !763, line: 132, baseType: !775, size: 128, offset: 192)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !763, line: 92, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !775, file: !763, line: 93, baseType: !767, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !775, file: !763, line: 94, baseType: !97, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !764, file: !763, line: 133, baseType: !97, size: 32, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !764, file: !763, line: 136, baseType: !159, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !764, file: !763, line: 137, baseType: !782, size: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!97, !159}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !764, file: !763, line: 138, baseType: !786, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!97, !159, !125, !97}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !764, file: !763, line: 139, baseType: !790, size: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!793, !159, !793, !97}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !763, line: 81, baseType: !212)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !764, file: !763, line: 140, baseType: !795, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!97, !159, !120, !97}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !764, file: !763, line: 143, baseType: !775, size: 128, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !764, file: !763, line: 144, baseType: !800, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !763, line: 98, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !764, file: !763, line: 145, baseType: !97, size: 32, offset: 896)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !764, file: !763, line: 148, baseType: !804, size: 24, offset: 928)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 24, elements: !356)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !764, file: !763, line: 149, baseType: !806, size: 8, offset: 952)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 8, elements: !324)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !764, file: !763, line: 152, baseType: !775, size: 128, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !764, file: !763, line: 155, baseType: !97, size: 32, offset: 1088)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !764, file: !763, line: 156, baseType: !793, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !120)
!811 = !{}
!812 = !DISubprogram(name: "printf", scope: !757, file: !757, line: 175, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!813 = !DISubroutineType(types: !814)
!814 = !{!97, !810, null}
!815 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !757, file: !757, line: 157, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!816 = !DISubroutineType(types: !817)
!817 = !{!97, !810, !760}
!818 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !96, file: !96, line: 584, type: !819, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !811)
!819 = !DISubroutineType(types: !820)
!820 = !{null}
!821 = !DILocation(line: 588, column: 5, scope: !818)
!822 = !DILocation(line: 586, column: 3, scope: !818)
!823 = !DILocation(line: 589, column: 1, scope: !818)
!824 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !96, file: !96, line: 657, type: !825, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !120}
!827 = !{!828, !829, !836, !837, !839, !840}
!828 = !DILocalVariable(name: "program", arg: 1, scope: !824, file: !96, line: 657, type: !120)
!829 = !DILocalVariable(name: "infomap", scope: !824, file: !96, line: 659, type: !830)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 896, elements: !288)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !824, file: !96, line: 659, size: 128, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !832, file: !96, line: 659, baseType: !120, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !832, file: !96, line: 659, baseType: !120, size: 64, offset: 64)
!836 = !DILocalVariable(name: "node", scope: !824, file: !96, line: 669, type: !120)
!837 = !DILocalVariable(name: "map_prog", scope: !824, file: !96, line: 670, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!839 = !DILocalVariable(name: "lc_messages", scope: !824, file: !96, line: 682, type: !120)
!840 = !DILocalVariable(name: "url_program", scope: !824, file: !96, line: 695, type: !120)
!841 = !DILocation(line: 0, scope: !824)
!842 = !DILocation(line: 659, column: 3, scope: !824)
!843 = !DILocation(line: 659, column: 67, scope: !824)
!844 = !DILocation(line: 670, column: 36, scope: !824)
!845 = !DILocation(line: 672, column: 3, scope: !824)
!846 = !DILocation(line: 672, column: 20, scope: !824)
!847 = !{!848, !718, i64 0}
!848 = !{!"infomap", !718, i64 0, !718, i64 8}
!849 = !DILocation(line: 672, column: 10, scope: !824)
!850 = !DILocation(line: 672, column: 28, scope: !824)
!851 = !DILocation(line: 672, column: 33, scope: !824)
!852 = !DILocation(line: 672, column: 31, scope: !824)
!853 = !DILocation(line: 673, column: 13, scope: !824)
!854 = distinct !{!854, !845, !853, !855, !856}
!855 = !{!"llvm.loop.mustprogress"}
!856 = !{!"llvm.loop.unroll.disable"}
!857 = !DILocation(line: 675, column: 17, scope: !858)
!858 = distinct !DILexicalBlock(scope: !824, file: !96, line: 675, column: 7)
!859 = !{!848, !718, i64 8}
!860 = !DILocation(line: 675, column: 7, scope: !858)
!861 = !DILocation(line: 675, column: 7, scope: !824)
!862 = !DILocation(line: 676, column: 22, scope: !858)
!863 = !DILocation(line: 676, column: 5, scope: !858)
!864 = !DILocation(line: 678, column: 3, scope: !824)
!865 = !DILocation(line: 682, column: 29, scope: !824)
!866 = !DILocation(line: 683, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !824, file: !96, line: 683, column: 7)
!868 = !DILocation(line: 683, column: 19, scope: !867)
!869 = !DILocation(line: 683, column: 22, scope: !867)
!870 = !DILocation(line: 683, column: 7, scope: !824)
!871 = !DILocation(line: 690, column: 61, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !96, line: 684, column: 5)
!873 = !DILocation(line: 689, column: 7, scope: !872)
!874 = !DILocation(line: 691, column: 5, scope: !872)
!875 = !DILocation(line: 695, column: 29, scope: !824)
!876 = !DILocation(line: 696, column: 3, scope: !824)
!877 = !DILocation(line: 699, column: 22, scope: !824)
!878 = !DILocation(line: 699, column: 17, scope: !824)
!879 = !DILocation(line: 698, column: 3, scope: !824)
!880 = !DILocation(line: 700, column: 1, scope: !824)
!881 = !DISubprogram(name: "exit", scope: !882, file: !882, line: 145, type: !706, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !811)
!882 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/stdlib.h", directory: "")
!883 = !DISubprogram(name: "strcmp", scope: !884, file: !884, line: 77, type: !885, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!884 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/string.h", directory: "")
!885 = !DISubroutineType(types: !886)
!886 = !{!97, !120, !120}
!887 = !DISubprogram(name: "setlocale", scope: !888, file: !888, line: 53, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!888 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/locale.h", directory: "")
!889 = !DISubroutineType(types: !890)
!890 = !{!125, !97, !120}
!891 = !DISubprogram(name: "strncmp", scope: !884, file: !884, line: 84, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!892 = !DISubroutineType(types: !893)
!893 = !{!97, !120, !120, !126}
!894 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 1881, type: !895, scopeLine: 1882, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !898)
!895 = !DISubroutineType(types: !896)
!896 = !{!97, !97, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !937}
!899 = !DILocalVariable(name: "argc", arg: 1, scope: !894, file: !2, line: 1881, type: !97)
!900 = !DILocalVariable(name: "argv", arg: 2, scope: !894, file: !2, line: 1881, type: !897)
!901 = !DILocalVariable(name: "c", scope: !894, file: !2, line: 1883, type: !97)
!902 = !DILocalVariable(name: "fs", scope: !894, file: !2, line: 1884, type: !119)
!903 = !DILocalVariable(name: "terse", scope: !894, file: !2, line: 1885, type: !119)
!904 = !DILocalVariable(name: "format", scope: !894, file: !2, line: 1886, type: !125)
!905 = !DILocalVariable(name: "format2", scope: !894, file: !2, line: 1887, type: !125)
!906 = !DILocalVariable(name: "ok", scope: !894, file: !2, line: 1888, type: !119)
!907 = !DILocalVariable(name: "locale", scope: !894, file: !2, line: 1896, type: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !911, line: 43, size: 768, elements: !912)
!911 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/_locale.h", directory: "")
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !910, file: !911, line: 44, baseType: !125, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !910, file: !911, line: 45, baseType: !125, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !910, file: !911, line: 46, baseType: !125, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !910, file: !911, line: 47, baseType: !125, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !910, file: !911, line: 48, baseType: !125, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !910, file: !911, line: 49, baseType: !125, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !910, file: !911, line: 50, baseType: !125, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !910, file: !911, line: 51, baseType: !125, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !910, file: !911, line: 52, baseType: !125, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !910, file: !911, line: 53, baseType: !125, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !910, file: !911, line: 54, baseType: !4, size: 8, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !910, file: !911, line: 55, baseType: !4, size: 8, offset: 648)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !910, file: !911, line: 56, baseType: !4, size: 8, offset: 656)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !910, file: !911, line: 57, baseType: !4, size: 8, offset: 664)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !910, file: !911, line: 58, baseType: !4, size: 8, offset: 672)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !910, file: !911, line: 59, baseType: !4, size: 8, offset: 680)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !910, file: !911, line: 60, baseType: !4, size: 8, offset: 688)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !910, file: !911, line: 61, baseType: !4, size: 8, offset: 696)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !910, file: !911, line: 62, baseType: !4, size: 8, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !910, file: !911, line: 63, baseType: !4, size: 8, offset: 712)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !910, file: !911, line: 64, baseType: !4, size: 8, offset: 720)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !910, file: !911, line: 65, baseType: !4, size: 8, offset: 728)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !910, file: !911, line: 66, baseType: !4, size: 8, offset: 736)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !910, file: !911, line: 67, baseType: !4, size: 8, offset: 744)
!937 = !DILocalVariable(name: "i", scope: !938, file: !2, line: 1974, type: !97)
!938 = distinct !DILexicalBlock(scope: !894, file: !2, line: 1974, column: 3)
!939 = !DILocation(line: 0, scope: !894)
!940 = !DILocation(line: 1891, column: 21, scope: !894)
!941 = !DILocation(line: 1891, column: 3, scope: !894)
!942 = !DILocation(line: 1892, column: 3, scope: !894)
!943 = !DILocation(line: 1896, column: 32, scope: !894)
!944 = !DILocation(line: 1897, column: 28, scope: !894)
!945 = !{!946, !718, i64 0}
!946 = !{!"lconv", !718, i64 0, !718, i64 8, !718, i64 16, !718, i64 24, !718, i64 32, !718, i64 40, !718, i64 48, !718, i64 56, !718, i64 64, !718, i64 72, !719, i64 80, !719, i64 81, !719, i64 82, !719, i64 83, !719, i64 84, !719, i64 85, !719, i64 86, !719, i64 87, !719, i64 88, !719, i64 89, !719, i64 90, !719, i64 91, !719, i64 92, !719, i64 93}
!947 = !DILocation(line: 1897, column: 20, scope: !894)
!948 = !{!719, !719, i64 0}
!949 = !DILocation(line: 1897, column: 55, scope: !894)
!950 = !DILocation(line: 1897, column: 17, scope: !894)
!951 = !DILocation(line: 1898, column: 31, scope: !894)
!952 = !DILocation(line: 1898, column: 23, scope: !894)
!953 = !DILocation(line: 1898, column: 21, scope: !894)
!954 = !{!955, !955, i64 0}
!955 = !{!"long", !719, i64 0}
!956 = !DILocation(line: 1900, column: 3, scope: !894)
!957 = !DILocation(line: 1902, column: 3, scope: !894)
!958 = !DILocation(line: 1885, column: 8, scope: !894)
!959 = !DILocation(line: 1884, column: 8, scope: !894)
!960 = !DILocation(line: 1886, column: 9, scope: !894)
!961 = !DILocation(line: 1902, column: 15, scope: !894)
!962 = !DILocation(line: 1902, column: 70, scope: !894)
!963 = !DILocation(line: 1904, column: 7, scope: !964)
!964 = distinct !DILexicalBlock(scope: !894, file: !2, line: 1903, column: 5)
!965 = !DILocation(line: 1907, column: 20, scope: !966)
!966 = distinct !DILexicalBlock(scope: !964, file: !2, line: 1905, column: 9)
!967 = !DILocation(line: 1908, column: 39, scope: !966)
!968 = !{!969, !969, i64 0}
!969 = !{!"_Bool", !719, i64 0}
!970 = !DILocation(line: 1909, column: 26, scope: !966)
!971 = !DILocation(line: 1910, column: 11, scope: !966)
!972 = !DILocation(line: 1913, column: 20, scope: !966)
!973 = !DILocation(line: 1914, column: 39, scope: !966)
!974 = !DILocation(line: 1915, column: 26, scope: !966)
!975 = !DILocation(line: 1916, column: 11, scope: !966)
!976 = !DILocation(line: 1919, column: 24, scope: !966)
!977 = !DILocation(line: 1920, column: 11, scope: !966)
!978 = !DILocation(line: 1924, column: 11, scope: !966)
!979 = !DILocation(line: 1928, column: 11, scope: !966)
!980 = !DILocation(line: 1931, column: 19, scope: !966)
!981 = !DILocation(line: 1931, column: 11, scope: !966)
!982 = !DILocation(line: 1934, column: 28, scope: !983)
!983 = distinct !DILexicalBlock(scope: !966, file: !2, line: 1932, column: 13)
!984 = !DILocation(line: 1935, column: 27, scope: !983)
!985 = !DILocation(line: 1936, column: 17, scope: !983)
!986 = !DILocation(line: 1938, column: 28, scope: !983)
!987 = !DILocation(line: 1939, column: 27, scope: !983)
!988 = !DILocation(line: 1940, column: 17, scope: !983)
!989 = !DILocation(line: 1942, column: 28, scope: !983)
!990 = !DILocation(line: 1943, column: 27, scope: !983)
!991 = !DILocation(line: 1944, column: 13, scope: !983)
!992 = !DILocation(line: 1945, column: 11, scope: !966)
!993 = !DILocation(line: 1947, column: 9, scope: !966)
!994 = !DILocation(line: 1949, column: 9, scope: !966)
!995 = !DILocation(line: 1952, column: 11, scope: !966)
!996 = distinct !{!996, !957, !997, !855, !856}
!997 = !DILocation(line: 1954, column: 5, scope: !894)
!998 = !DILocation(line: 1956, column: 15, scope: !999)
!999 = distinct !DILexicalBlock(scope: !894, file: !2, line: 1956, column: 7)
!1000 = !{!1001, !1001, i64 0}
!1001 = !{!"int", !719, i64 0}
!1002 = !DILocation(line: 1956, column: 12, scope: !999)
!1003 = !DILocation(line: 1956, column: 7, scope: !894)
!1004 = !DILocation(line: 1958, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !999, file: !2, line: 1957, column: 5)
!1006 = !DILocation(line: 1959, column: 7, scope: !1005)
!1007 = !DILocation(line: 1962, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !894, file: !2, line: 1962, column: 7)
!1009 = !DILocation(line: 1962, column: 7, scope: !894)
!1010 = !DILocation(line: 1964, column: 11, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 1964, column: 11)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 1963, column: 5)
!1013 = !DILocation(line: 1964, column: 11, scope: !1012)
!1014 = !DILocation(line: 1965, column: 9, scope: !1011)
!1015 = !DILocation(line: 1967, column: 5, scope: !1012)
!1016 = !DILocation(line: 1970, column: 32, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 1969, column: 5)
!1018 = !DILocation(line: 1970, column: 36, scope: !1017)
!1019 = !DILocation(line: 1970, column: 16, scope: !1017)
!1020 = !DILocation(line: 1971, column: 33, scope: !1017)
!1021 = !DILocation(line: 1971, column: 37, scope: !1017)
!1022 = !DILocation(line: 1971, column: 17, scope: !1017)
!1023 = !DILocation(line: 0, scope: !1008)
!1024 = !DILocation(line: 1974, column: 16, scope: !938)
!1025 = !DILocation(line: 0, scope: !938)
!1026 = !DILocation(line: 1974, column: 8, scope: !938)
!1027 = !DILocation(line: 1974, scope: !938)
!1028 = !DILocation(line: 1974, column: 26, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !938, file: !2, line: 1974, column: 3)
!1030 = !DILocation(line: 1974, column: 3, scope: !938)
!1031 = !DILocation(line: 1975, column: 12, scope: !1029)
!1032 = !DILocation(line: 1976, column: 25, scope: !1029)
!1033 = !DILocation(line: 1976, column: 14, scope: !1029)
!1034 = !DILocation(line: 1977, column: 23, scope: !1029)
!1035 = !DILocation(line: 1977, column: 14, scope: !1029)
!1036 = !DILocation(line: 1975, column: 8, scope: !1029)
!1037 = !DILocation(line: 1975, column: 5, scope: !1029)
!1038 = !DILocation(line: 1974, column: 35, scope: !1029)
!1039 = !DILocation(line: 1974, column: 3, scope: !1029)
!1040 = distinct !{!1040, !1030, !1041, !855, !856}
!1041 = !DILocation(line: 1977, column: 48, scope: !938)
!1042 = !DILocation(line: 1979, column: 3, scope: !894)
!1043 = !DISubprogram(name: "set_program_name", scope: !1044, file: !1044, line: 37, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1044 = !DIFile(filename: "../lib/progname.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1045 = !DISubprogram(name: "localeconv", scope: !911, file: !911, line: 73, type: !1046, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!1049 = !DISubprogram(name: "strlen", scope: !884, file: !884, line: 82, type: !1050, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!128, !120}
!1052 = !DISubprogram(name: "atexit", scope: !882, file: !882, line: 133, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!97, !1055}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!1056 = !DISubprogram(name: "rpl_getopt_long", scope: !466, file: !466, line: 66, type: !1057, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!97, !97, !897, !120, !1059, !471}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!1060 = !DISubprogram(name: "__xargmatch_internal", scope: !1061, file: !1061, line: 94, type: !1062, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1061 = !DIFile(filename: "../lib/argmatch.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1064, !120, !120, !1065, !129, !126, !1066, !119}
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !127, line: 35, baseType: !204)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1061, line: 66, baseType: !1055)
!1067 = !DISubprogram(name: "version_etc", scope: !1068, file: !1068, line: 65, type: !1069, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1068 = !DIFile(filename: "../lib/version-etc.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !761, !120, !120, !120, null}
!1071 = !DISubprogram(name: "error", scope: !1072, file: !1072, line: 395, type: !1073, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1072 = !DIFile(filename: "./lib/error.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !97, !97, !120, null}
!1075 = !DISubprogram(name: "strstr", scope: !884, file: !884, line: 89, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!125, !120, !120}
!1078 = distinct !DISubprogram(name: "getenv_quoting_style", scope: !2, file: !2, line: 1053, type: !819, scopeLine: 1054, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !1079)
!1079 = !{!1080, !1081}
!1080 = !DILocalVariable(name: "q_style", scope: !1078, file: !2, line: 1055, type: !120)
!1081 = !DILocalVariable(name: "i", scope: !1082, file: !2, line: 1058, type: !97)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !2, line: 1057, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 1056, column: 7)
!1084 = !DILocation(line: 1055, column: 25, scope: !1078)
!1085 = !DILocation(line: 0, scope: !1078)
!1086 = !DILocation(line: 1056, column: 7, scope: !1083)
!1087 = !DILocation(line: 1056, column: 7, scope: !1078)
!1088 = !DILocation(line: 1058, column: 15, scope: !1082)
!1089 = !DILocation(line: 0, scope: !1082)
!1090 = !DILocation(line: 1059, column: 13, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1082, file: !2, line: 1059, column: 11)
!1092 = !DILocation(line: 1059, column: 11, scope: !1082)
!1093 = !DILocation(line: 1060, column: 34, scope: !1091)
!1094 = !DILocation(line: 1060, column: 9, scope: !1091)
!1095 = !DILocation(line: 1063, column: 11, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !2, line: 1062, column: 9)
!1097 = !DILocation(line: 1065, column: 57, scope: !1096)
!1098 = !DILocation(line: 1064, column: 11, scope: !1096)
!1099 = !DILocation(line: 1067, column: 5, scope: !1082)
!1100 = !DILocation(line: 1069, column: 5, scope: !1083)
!1101 = !DILocation(line: 1070, column: 1, scope: !1078)
!1102 = distinct !DISubprogram(name: "default_format", scope: !2, file: !2, line: 1664, type: !1103, scopeLine: 1665, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !1105)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!125, !119, !119, !119}
!1105 = !{!1106, !1107, !1108, !1109, !1110}
!1106 = !DILocalVariable(name: "fs", arg: 1, scope: !1102, file: !2, line: 1664, type: !119)
!1107 = !DILocalVariable(name: "terse", arg: 2, scope: !1102, file: !2, line: 1664, type: !119)
!1108 = !DILocalVariable(name: "device", arg: 3, scope: !1102, file: !2, line: 1664, type: !119)
!1109 = !DILocalVariable(name: "format", scope: !1102, file: !2, line: 1666, type: !125)
!1110 = !DILocalVariable(name: "temp", scope: !1111, file: !2, line: 1693, type: !125)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 1692, column: 9)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !2, line: 1684, column: 11)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !2, line: 1683, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 1667, column: 7)
!1115 = !DILocation(line: 0, scope: !1102)
!1116 = !DILocation(line: 1667, column: 7, scope: !1114)
!1117 = !DILocation(line: 1667, column: 7, scope: !1102)
!1118 = !DILocation(line: 1669, column: 11, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !2, line: 1669, column: 11)
!1120 = distinct !DILexicalBlock(scope: !1114, file: !2, line: 1668, column: 5)
!1121 = !DILocation(line: 1669, column: 11, scope: !1120)
!1122 = !DILocation(line: 1670, column: 18, scope: !1119)
!1123 = !DILocation(line: 1670, column: 9, scope: !1119)
!1124 = !DILocation(line: 1675, column: 20, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 1672, column: 9)
!1126 = !DILocation(line: 0, scope: !1119)
!1127 = !DILocation(line: 1681, column: 5, scope: !1120)
!1128 = !DILocation(line: 1684, column: 11, scope: !1112)
!1129 = !DILocation(line: 1684, column: 11, scope: !1113)
!1130 = !DILocation(line: 1689, column: 22, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !2, line: 1686, column: 15)
!1132 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 1685, column: 9)
!1133 = !DILocation(line: 1690, column: 9, scope: !1132)
!1134 = !DILocation(line: 1696, column: 20, scope: !1111)
!1135 = !DILocation(line: 0, scope: !1111)
!1136 = !DILocation(line: 1702, column: 15, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1111, file: !2, line: 1702, column: 15)
!1138 = !DILocation(line: 1702, column: 15, scope: !1111)
!1139 = !DILocation(line: 1706, column: 24, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 1703, column: 13)
!1141 = !DILocation(line: 1709, column: 13, scope: !1140)
!1142 = !DILocation(line: 1714, column: 24, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1137, file: !2, line: 1711, column: 13)
!1144 = !DILocation(line: 0, scope: !1137)
!1145 = !DILocation(line: 1718, column: 11, scope: !1111)
!1146 = !DILocation(line: 1723, column: 20, scope: !1111)
!1147 = !DILocation(line: 1726, column: 11, scope: !1111)
!1148 = !DILocation(line: 1740, column: 20, scope: !1111)
!1149 = !DILocation(line: 1745, column: 11, scope: !1111)
!1150 = !DILocation(line: 0, scope: !1112)
!1151 = !DILocation(line: 0, scope: !1114)
!1152 = !DILocation(line: 1748, column: 3, scope: !1102)
!1153 = distinct !DISubprogram(name: "do_statfs", scope: !2, file: !2, line: 1262, type: !1154, scopeLine: 1263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !1156)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!119, !120, !120}
!1156 = !{!1157, !1158, !1159, !1160}
!1157 = !DILocalVariable(name: "filename", arg: 1, scope: !1153, file: !2, line: 1262, type: !120)
!1158 = !DILocalVariable(name: "format", arg: 2, scope: !1153, file: !2, line: 1262, type: !120)
!1159 = !DILocalVariable(name: "statfsbuf", scope: !1153, file: !2, line: 1264, type: !251)
!1160 = !DILocalVariable(name: "fail", scope: !1153, file: !2, line: 1280, type: !119)
!1161 = !DILocation(line: 0, scope: !1153)
!1162 = !DILocation(line: 1264, column: 3, scope: !1153)
!1163 = !DILocation(line: 1264, column: 18, scope: !1153)
!1164 = !DILocation(line: 1266, column: 7, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1153, file: !2, line: 1266, column: 7)
!1166 = !DILocation(line: 1266, column: 7, scope: !1153)
!1167 = !DILocation(line: 1269, column: 47, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1165, file: !2, line: 1267, column: 5)
!1169 = !DILocation(line: 1268, column: 7, scope: !1168)
!1170 = !DILocation(line: 1270, column: 7, scope: !1168)
!1171 = !DILocation(line: 1273, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1153, file: !2, line: 1273, column: 7)
!1173 = !DILocation(line: 1273, column: 37, scope: !1172)
!1174 = !DILocation(line: 1273, column: 7, scope: !1153)
!1175 = !DILocation(line: 1275, column: 17, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 1274, column: 5)
!1177 = !DILocation(line: 1276, column: 14, scope: !1176)
!1178 = !DILocation(line: 1275, column: 7, scope: !1176)
!1179 = !DILocation(line: 1277, column: 7, scope: !1176)
!1180 = !DILocation(line: 1280, column: 15, scope: !1153)
!1181 = !DILocation(line: 1280, column: 8, scope: !1153)
!1182 = !DILocation(line: 1281, column: 12, scope: !1153)
!1183 = !DILocation(line: 1281, column: 10, scope: !1153)
!1184 = !DILocation(line: 1282, column: 1, scope: !1153)
!1185 = distinct !DISubprogram(name: "do_stat", scope: !2, file: !2, line: 1459, type: !1186, scopeLine: 1461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !1188)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!119, !120, !120, !120}
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1195}
!1189 = !DILocalVariable(name: "filename", arg: 1, scope: !1185, file: !2, line: 1459, type: !120)
!1190 = !DILocalVariable(name: "format", arg: 2, scope: !1185, file: !2, line: 1459, type: !120)
!1191 = !DILocalVariable(name: "format2", arg: 3, scope: !1185, file: !2, line: 1460, type: !120)
!1192 = !DILocalVariable(name: "fd", scope: !1185, file: !2, line: 1462, type: !97)
!1193 = !DILocalVariable(name: "statbuf", scope: !1185, file: !2, line: 1463, type: !165)
!1194 = !DILocalVariable(name: "pa", scope: !1185, file: !2, line: 1464, type: !161)
!1195 = !DILocalVariable(name: "fail", scope: !1185, file: !2, line: 1490, type: !119)
!1196 = !DILocation(line: 0, scope: !1185)
!1197 = !DILocation(line: 1462, column: 12, scope: !1185)
!1198 = !DILocation(line: 1463, column: 3, scope: !1185)
!1199 = !DILocation(line: 1463, column: 15, scope: !1185)
!1200 = !DILocation(line: 1464, column: 3, scope: !1185)
!1201 = !DILocation(line: 1464, column: 21, scope: !1185)
!1202 = !DILocation(line: 1465, column: 6, scope: !1185)
!1203 = !DILocation(line: 1465, column: 9, scope: !1185)
!1204 = !{!1205, !718, i64 0}
!1205 = !{!"print_args", !718, i64 0, !1206, i64 8}
!1206 = !{!"timespec", !955, i64 0, !955, i64 8}
!1207 = !DILocation(line: 1466, column: 6, scope: !1185)
!1208 = !DILocation(line: 1466, column: 32, scope: !1185)
!1209 = !{!1206, !955, i64 0}
!1210 = !{!1206, !955, i64 8}
!1211 = !DILocation(line: 1466, column: 14, scope: !1185)
!1212 = !{i64 0, i64 8, !954, i64 8, i64 8, !954}
!1213 = !DILocation(line: 1468, column: 9, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1185, file: !2, line: 1468, column: 7)
!1215 = !DILocation(line: 1468, column: 7, scope: !1185)
!1216 = !DILocation(line: 1470, column: 11, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !2, line: 1470, column: 11)
!1218 = distinct !DILexicalBlock(scope: !1214, file: !2, line: 1469, column: 5)
!1219 = !DILocation(line: 1470, column: 32, scope: !1217)
!1220 = !DILocation(line: 1470, column: 11, scope: !1218)
!1221 = !DILocation(line: 1472, column: 21, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 1471, column: 9)
!1223 = !DILocation(line: 1472, column: 11, scope: !1222)
!1224 = !DILocation(line: 1473, column: 11, scope: !1222)
!1225 = !DILocation(line: 1475, column: 5, scope: !1218)
!1226 = !DILocation(line: 1479, column: 13, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1214, file: !2, line: 1479, column: 12)
!1228 = !{i8 0, i8 2}
!1229 = !DILocation(line: 1480, column: 15, scope: !1227)
!1230 = !DILocation(line: 1481, column: 15, scope: !1227)
!1231 = !DILocation(line: 1481, column: 43, scope: !1227)
!1232 = !DILocation(line: 1479, column: 12, scope: !1214)
!1233 = !DILocation(line: 1483, column: 17, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1227, file: !2, line: 1482, column: 5)
!1235 = !DILocation(line: 1483, column: 45, scope: !1234)
!1236 = !DILocation(line: 1483, column: 7, scope: !1234)
!1237 = !DILocation(line: 1484, column: 7, scope: !1234)
!1238 = !DILocation(line: 1487, column: 7, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1185, file: !2, line: 1487, column: 7)
!1240 = !{!1241, !1242, i64 4}
!1241 = !{!"stat", !1001, i64 0, !1242, i64 4, !1242, i64 6, !1243, i64 8, !1001, i64 16, !1001, i64 20, !1001, i64 24, !1206, i64 32, !1206, i64 48, !1206, i64 64, !1206, i64 80, !1243, i64 96, !1243, i64 104, !1001, i64 112, !1001, i64 116, !1001, i64 120, !1001, i64 124, !719, i64 128}
!1242 = !{!"short", !719, i64 0}
!1243 = !{!"long long", !719, i64 0}
!1244 = !DILocation(line: 1487, column: 33, scope: !1239)
!1245 = !DILocation(line: 1487, column: 36, scope: !1239)
!1246 = !DILocation(line: 1487, column: 7, scope: !1185)
!1247 = !DILocation(line: 1488, column: 5, scope: !1239)
!1248 = !DILocation(line: 1490, column: 15, scope: !1185)
!1249 = !DILocation(line: 1490, column: 8, scope: !1185)
!1250 = !DILocation(line: 1491, column: 12, scope: !1185)
!1251 = !DILocation(line: 1491, column: 10, scope: !1185)
!1252 = !DILocation(line: 1492, column: 1, scope: !1185)
!1253 = !DISubprogram(name: "fstat", linkageName: "\01_fstat$INODE64", scope: !166, file: !166, line: 382, type: !1254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!97, !97, !164}
!1256 = !DISubprogram(name: "__error", scope: !1257, file: !1257, line: 80, type: !1258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1257 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/sys/errno.h", directory: "")
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!471}
!1260 = !DISubprogram(name: "rpl_stat", scope: !1261, file: !1261, line: 1355, type: !1262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1261 = !DIFile(filename: "./lib/sys/stat.h", directory: "/Users/adrienbouquet/Epfl/6_BA/BachelorProject/test_project/coreutils-9.3/build")
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!97, !810, !1264}
!1264 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !164)
!1265 = !DISubprogram(name: "rpl_lstat", scope: !1261, file: !1261, line: 1385, type: !1262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1266 = !DISubprogram(name: "quotearg_style", scope: !102, file: !102, line: 383, type: !1267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !811)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!125, !101, !120}
!1269 = distinct !DISubprogram(name: "print_stat", scope: !2, file: !2, line: 1506, type: !123, scopeLine: 1508, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !84, retainedNodes: !1270)
!1270 = !{!1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1296, !1305, !1306}
!1271 = !DILocalVariable(name: "pformat", arg: 1, scope: !1269, file: !2, line: 1506, type: !125)
!1272 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !1269, file: !2, line: 1506, type: !126)
!1273 = !DILocalVariable(name: "mod", arg: 3, scope: !1269, file: !2, line: 1506, type: !4)
!1274 = !DILocalVariable(name: "m", arg: 4, scope: !1269, file: !2, line: 1506, type: !4)
!1275 = !DILocalVariable(name: "fd", arg: 5, scope: !1269, file: !2, line: 1507, type: !97)
!1276 = !DILocalVariable(name: "filename", arg: 6, scope: !1269, file: !2, line: 1507, type: !120)
!1277 = !DILocalVariable(name: "data", arg: 7, scope: !1269, file: !2, line: 1507, type: !129)
!1278 = !DILocalVariable(name: "parg", scope: !1269, file: !2, line: 1509, type: !160)
!1279 = !DILocalVariable(name: "statbuf", scope: !1269, file: !2, line: 1510, type: !164)
!1280 = !DILocalVariable(name: "btime", scope: !1269, file: !2, line: 1511, type: !199)
!1281 = !DILocalVariable(name: "pw_ent", scope: !1269, file: !2, line: 1512, type: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1284, line: 84, size: 576, elements: !1285)
!1284 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/pwd.h", directory: "")
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1283, file: !1284, line: 85, baseType: !125, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1283, file: !1284, line: 86, baseType: !125, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1283, file: !1284, line: 87, baseType: !189, size: 32, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1283, file: !1284, line: 88, baseType: !194, size: 32, offset: 160)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pw_change", scope: !1283, file: !1284, line: 89, baseType: !203, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pw_class", scope: !1283, file: !1284, line: 90, baseType: !125, size: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1283, file: !1284, line: 91, baseType: !125, size: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1283, file: !1284, line: 92, baseType: !125, size: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1283, file: !1284, line: 93, baseType: !125, size: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pw_expire", scope: !1283, file: !1284, line: 94, baseType: !203, size: 64, offset: 512)
!1296 = !DILocalVariable(name: "gw_ent", scope: !1269, file: !2, line: 1513, type: !1297)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !1299, line: 53, size: 256, elements: !1300)
!1299 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX13.sdk/usr/include/grp.h", directory: "")
!1300 = !{!1301, !1302, !1303, !1304}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1298, file: !1299, line: 54, baseType: !125, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1298, file: !1299, line: 55, baseType: !125, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1298, file: !1299, line: 56, baseType: !194, size: 32, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1298, file: !1299, line: 57, baseType: !897, size: 64, offset: 192)
!1305 = !DILocalVariable(name: "fail", scope: !1269, file: !2, line: 1514, type: !119)
!1306 = !DILocalVariable(name: "linkname", scope: !1307, file: !2, line: 1525, type: !125)
